[{"review_id": "W8Fk4mU_UFWGLu6ygF-e8g", "user_id": "ZH2BsTXtOrzgNLFGDFsogA", "business_id": "OzRGWW5R05kC0pQyUHX3lg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "It has been a while since I ate at this restaurant, although we have received deliveries from them and have always been pleased.  The decor is, in a word, old.  I know it is an old restaurant, but it could use some updating.  The servers generally reflect this as well.  We ordered the calimari as an appetizer and it was excellent.  The past dishes are generous sized, and good value for the price.  Service was timely and attentive.  I would continue to order delivery food from them, but don't know that I would hurry back to dine there.", "date": "2012-01-16 15:45:25"}, {"review_id": "e3M0X6o1c0CsvPpCgKufqg", "user_id": "4FE8md9fMr_jZFNbcOmHsQ", "business_id": "3JekfARgFuMeLTMcOpgqyQ", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "I came here because I overheard the owner of Four Peas in a Pod restaurant in Hickory, enthusiastically telling a customer about Tony's stellar banana splits and milkshakes.\n\nI ordered two hot dogs and a soda, because I was hungry. The price was @$5.\n\nOne orders at the counter, pays, and receives a ticket. I didn't know what to do thereafter, so I just sat at the only open (dirty) table that was available. Eventually, about fifteen minutes later, someone called out my ticket number and I went all the way back to the entrance to pick up my order. \n\nOne picks up their orders immediately to the right of where one orders and pays for their food. This is a pretty screwed up system logistically, but since they've been doing business this way for 100 years, well........I don't guess that my opinion matters much. I just can't see this reverse, cluttered, traffic system as being the ideal way to manage customer flow - especially with all of their empty counter space past the registers. \n\nThe hot dogs were not good and not bad. The taste was okay, but they were only lukewarm and messy. They arrived wrapped in white wax paper in a brown paper bag. They were wrapped with zero regard to their appearance, and handed to me by a unsmiling young lady who look besieged. I can't say as I blame her, but personally, I would put a little more pride into the appearance of the food that I served.\n\nThe hot dogs looked like the bag had been thrown out the window of a moving vehicle. They were \"smushed\" all to heck. The buns were not toasted. Most of the toppings: chili, onions, mustard, and slaw were smeared all over the white paper wrapper. I ate the hot dogs because I was starving, but I wouldn't order them again. I've had gas station hot dogs that were better.\n \nAs I mentioned earlier, the restaurant was jammed, and every table was full. \n\nThe restaurant was not nearly as clean as I would have preferred. My table was filthy. There was a trash heap of French fries, napkins, and other debris under my table. There was salt and \"stuff\" all over my table top. A man came by with a broom and dust pan while I was getting my hot dogs, but he didn't clean the table. \n\nThe place looked to me like it could use a good steam cleaning. The white linoleum floor was yellowed, and overdue for a good buffing with a circular scrubber. The walls needed painting. Yeah, I know, the place is 100 years old. What do I expect? Answer: for it to be clean. Nitpicking? Maybe. \n\nI ordered a nut sundae for dessert. It was $4.00. It was okay, but the portion was a small 8-10 oz. plastic cup. An entire HUGE banana split was $5. \n\nTheir milkshakes are.....1950's colossal, I can see the appeal. \n\nMany younger people were ordering the grape flavor ice cream and shakes. \n\nThe man and woman at the order counter / register were friendly. The two \"soda jerks\" making ice cream confections were very professional and courteous. There was no shame in their game, although they didn't smile either. I don't know why, but somehow I felt that this place is a small version of the Varsity in Atlanta. \n\nParking is VERY limited. \n\nThe restaurant is extremely easy to find.\n \nWould I return? Yes, but only for ice cream or a shake.  Those items rate a four, and that's why one should come here. This place is first and foremost....an ice cream shop, and that's what they do best.", "date": "2015-03-12 21:13:02"}, {"review_id": "Pmpmq8Yys-7fXCOpwDL7Vw", "user_id": "OmjMNG77obZOKQ59o-Tx4Q", "business_id": "BLIJ-p5wYuAhw6Pp6mh6mw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The rooms were very big and very clean.  We actually squeezed 8 people in a room with 2 beds (I know, we're cheapskates) for a weekend trip in Vegas, and it wasn't as bad as you would think!  The bathrooms have lots of counter space, there is a room within the bathroom separating the toilet, the shower is nicely sized (and has kinda crazy heavy water pressure), and there is a huge bathtub (perfect for storing lots of ice with lots of drinks haha).  Great location, pretty good casino area.  We liked how Earl's and Planet Dailies were accessible for quick bites to eat!", "date": "2011-12-18 04:26:50"}, {"review_id": "tfhYOqZJwHlWdrmT7lFJbA", "user_id": "0iCbCiX2f4IGKGU3bzxwuQ", "business_id": "dCj9iQfjVGFETaXuhB63Gw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I like the intimate atmosphere of this gym. It has everything I need and I never have to wait. Also, the gym employees and personal trainers are extremely friendly and helpful. I will say that the place needs to be maintained a little better. Some of the equipment is falling apart or dirty. The glass that is close to the machines has dried sweat that needs to be cleaned. Also, the women's bathroom needs a serious overhaul. It's clean, but definitely needs the tiles replaced, etc.", "date": "2016-09-01 18:50:56"}, {"review_id": "WJn9RNzmdApyBm0GkbKnFg", "user_id": "Mxw0lh2sAXrnidgvA9QG4g", "business_id": "9_8veOtNHWndBzfTvQAQCw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great honking serving sizes and generous servings of multiple fresh veggies if you want them, but dang it, it just doesn't have the flavor! \n\nI was hoping to capture some of the Mission (San Francisco) hole-in-the-wall deliciousness and authenticity, but sadly I felt I might be able to make a more delicious burrito at home. There's just no flavor or seasoning. I don't know what it is - it looked amazing, smelled freaking amazing, and the my party of 3 couldn't wait to just inhale our halibut and chicken burritos and chicken quesadilla as we drove away. However, It just doesn't have....it.", "date": "2013-08-25 01:33:34"}, {"review_id": "rc_r-dIwxGqjKUi4F_vfRA", "user_id": "fiGqQ7pIGKyZ9G0RqWLMpg", "business_id": "jR3VINpCUILf_N_MGAsPUg", "stars": 3.0, "useful": 10, "funny": 0, "cool": 0, "text": "I saw her for my annual pap exam in 2009. She was nice and was pleasant to deal with, during the exam. However, when I was telling her about my fertility issues, she sounded like she wanted me to buy the products in her office (I don't know what they were, what the name was, but it all sounded all too familiar, pyramid scam). Since I had already seen another doctor for those issues and would be seeing Dr. Shapiro, was not interested in anything else at the moment, especially when I was undergoing all the necessary tests. So, if you are going to get an annual with her, be aware of the side job.", "date": "2011-01-27 23:28:23"}, {"review_id": "I4DWrCsS82A3QJl1MpJzBg", "user_id": "jZ1ziwykb5EEla5y4D5Ozg", "business_id": "FgTzITgrmvrZqoHvkTSDzA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bettis' is a fun atmosphere when you come during a sporting event. The bar will be packed, patrons noisy and loud cheering for Pitt or the Steelers. Lots of screens to watch and it's not too too hard to get a drink at the bar even when it's crowded.\n\nThe food is pretty standard; nothing great even for bar grub - fried stuff, nachos, quesadillas, wraps, sandwiches and a few fancier looking items to round out the menu.\n\nOverall, the only time to come to Bettis' is when there's a corresponding game going on. It's a nice establishment, yes, but there are much better places around town if you want a proper meal, even by pub fare standards.", "date": "2011-03-03 16:19:40"}, {"review_id": "HIQLHWJY_n6USbbmVK8cbQ", "user_id": "DWFTuVlhzEajYEsmKJjucw", "business_id": "xtYiHTmunjfCN2sUaQxBjA", "stars": 3.0, "useful": 4, "funny": 2, "cool": 0, "text": "Overall, it's a decent hotel for the price. The rooms are called suites and are decent in size but the quality of the suites are average. Let's just say a suite at the Hardrock has the wow factor where these suites dont have that feeling. They are nice because they have two beds and a couch.\n\nThe carnival buffet is nice for a variety of foods while the seafood buffet is awesome. The other restaurants are pretty good although I find this hotel lacks nice late night eateries. \n\nThe hotel is a tad dated and is off the strip. So I guess it could be a plus or minus. The hotel does offer a shuttle to Harrahs which is on the strip though.\n\nLike most hotels they have self parking and valet parking.\n\nThe Rio does seem to be one of the cheaper hotels in the Caesars chains.", "date": "2015-07-21 04:25:56"}, {"review_id": "ktt8X7fDmwJlfQxGGYN56A", "user_id": "_Le2KFF78hrKyoxE0NgN8Q", "business_id": "aiU0FRtHTIHBWMYapw79LA", "stars": 3.0, "useful": 0, "funny": 1, "cool": 1, "text": "On Saturday we went to the Reddstone (1261 W. 76 St.) for a quick lunch.\n\n  There's a lot to say about this place. The french fries come topped with delicious rosemary and taste like they're fried in duck fat.\n\n    The biggest item of conversation was the orange soup. It was a cold, creamy, spicy orange soup with onions and nuts. I didn't like it, but my foodie friend did.\n\n    The price was expensive but the food and service and atmosphere were well worth it. The service was only OK.\n\n     I have pictures of the soup, the burger and the lovely patio on my blog (http://whatsincleveland.blogspot.com/2011/06/reddstone-restaurant-cleveland-battery.html) as well as a link to their full menu.", "date": "2011-06-15 22:37:14"}, {"review_id": "tyU93bxFC7sAeRKgfb34XA", "user_id": "mEi5pG9NNr0UYTG7DrE_rQ", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went to wicked spoon on a Monday night with the family, because you need to go to at least to one buffet while in Vegas. I've been wanting to try the wicked spoon because I've heard lots of good things about this buffet, being the second best right behind bacchanal. The price was $38 for dinner (I believe it's the week day price) which is a good deal for a buffet. We arrived around 7:30- theres a line to pay and then another one you get in to wait to get seated. We got seated around 8:10 and had about an hour to get our food before they took the food away, which was more than enough time. The buffet closes at 9pm but the food is taken away at 9:15pm (kind of early, no?). Overall the lineup of food was kind of meh for me, I was expecting more.Nothing really blew my mind away, nor did I see anything that had a \"wow\" factor. There were a few items that I did enjoy- all of the pastas were good. Bone marrow was alright. Fried chicken wings were great. Siracha chicken wings were not that great. French onion soup was ok, but a bit too salty. I wish they had a greater seafood selection. The buffet also came with complementary juices, coffee, and lemonade. They cleared our plates at a reasonable pace. The dessert was quite delicious, with the gelato (especially mango passion fruit) being the star. But really the experience and the food was simply just alright.", "date": "2016-08-10 20:14:40"}, {"review_id": "C05I4SzDo0szpDKG6J1kDQ", "user_id": "8XmIIleAnuhOwB7EJjSaGQ", "business_id": "BxKe9Xt_fN6qBzrTofHuEQ", "stars": 3.0, "useful": 2, "funny": 2, "cool": 1, "text": "Came here to see The Hangover...yes, a little hungover....so the brightly colored theater was a little intense for my hungover state, but I did appreciate the comfy seats with armrests that go up....I like snuggling...ok?lol.....Prices were on par with SF, but apparently higher for Vegas.....I'd definitely go again.", "date": "2009-06-21 01:37:07"}, {"review_id": "IzNymm5xWqK1UbVH_wIPFg", "user_id": "ZgAzKwganIXImRAMcvdK_A", "business_id": "4CeOssI4EQ8BnjpUM5wFzg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice!!... All the sushi was very good, and the prices inexpensive ... I really liked all I had....", "date": "2014-06-05 03:33:02"}, {"review_id": "jTHbuS7fifft5efL6dsjyQ", "user_id": "f__9p6lo6hmwnAEh3yorsQ", "business_id": "1WBkAuQg81kokZIPMpn9Zg", "stars": 3.0, "useful": 9, "funny": 5, "cool": 5, "text": "Nicholas my subordinate from work suggested that we should try this place because it looked cool.  So we jump into the car and drove a bazillion miles to get here. \n\nThe place definitely looked cool in person and it was well kept and clean.  The loo was pretty decent as well for a burger joint.  The staff were super friendly and helpful because this was our first time eating here.  Service was good speed, and no mistakes were made. \n\nTo the food, Nicholas order their signature burger, and we split their mac and cheese... which was absolutely amazing! It's definitely not the best I had, but close enough.. and I highly recommend it.  I also order some wings which was okay, they were really tough to chew. \n\nOverall a good place.  Probably won't come back again since it's so very far.", "date": "2017-09-16 04:49:13"}, {"review_id": "VAVGbHr_idlRGxXABO0g1g", "user_id": "zmOdU_artMpKrG-AWYOSPQ", "business_id": "y7Js-07RF8d3N_AEtaw2VQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had to come to this place because it was advertised on Food network! What an experience!\n\n3 scales to weigh yourself--which I didn't partake in. You are dressed in a hospital gown as you walk in to enjoy this very caloric meal and there are posters and tvs all advertising the lack of a weight obsession makes for a happy camper.\n\nMy friend and I shared the single burger and onion rings. If the burgers came with the actual fillings of a typical burger--meat, cheese, lettuce, onions, tomatoes, and pickles--I might have said it was a delicious, fatty burger. But it didn't...no lettuce or pickles to take the brunt of the greasiness of the burger and to cut through, basically, all the fried grease of the onion ring as well. They didn't even have HOT SAUCE! For shame--it really needed it.\n\nI understand the concept--Heart Attack Grill--but STILL!!! Flavor and tartness would've have rounded up this meal in a MUCH more positive light. Also, getting the chance to order a drink out of IV lines--alas, that is a regret saved for another time. I will probably come back because the ambiance of the whole place was funky--but I will be bringing my own bottle of hot sauce next time!", "date": "2015-10-15 01:23:06"}, {"review_id": "HnGJ2CLAezCYj8PDGKzVmA", "user_id": "LkoeMVKa1mPjzxBhHXrz3g", "business_id": "xEIqG7Rq8ydAT9LxCVBOOg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I genuinely like Red Bowl. Everytime I go to eat there my food is fantastic. I always get a bento box with california roll, mongolian beef, miso soup, and brown rice. The service is always a little slow but most of the waitstaff is really nice.  Last night however I ordered takeout. I ordered the mongolian beef, my favorite, and the curry shrimp, my moms favorite. When I got home I realized my mongolian beef didnt even LOOK like it did when I dined in. Not saucy and it didnt have as much flavor. My mom said that her curry shrimp was normally not as runny as it was either. So I guess this place is PERFECT for dine in up don't order to go because they dont seem to care as much about the food then!", "date": "2012-03-14 14:28:04"}, {"review_id": "cdwZHFoxDrr_-llfpstBog", "user_id": "DYoTXaKxFLaUh7MiWSbgjw", "business_id": "X8c23dur0ll2D9XTu-I8Qg", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "Why I was impressed and why I won't go back.\n\nI am impressed by the magnitude, scale and spectacle of this place.  It's truly spectacular and worth a visit, just to see.  At times I felt like I was watching a live concert for a big name DJ, at times I felt like I was watching a lot of people popping Mollies while watching a live concert of a big name DJ, and at times I just caught myself looking around at the sea of people on the 4th and 5th floors.  Seriously, how many people does this place hold?  5,000? 10,000??  I couldn't really tell.\n\nSo why won't I come back?  Simply put, I just don't feel safe in this place.  Here's the deal:  I am sure Las Vegas nightclubs have codes and regulations up the wazzoo and the Hakkasan folks followed them to a T.  That being said, this is a scale and magnitude never seen before.  I think my own common sense observation of the main floor was that if something went wrong we would be in a lot of trouble trying to make our way to an exit along with the deluge of humanity enclosed in the space.  The light show made me wonder what the risk of a fire was, the amount of people in the space made me realize we weren't searched by security when we came in and we were one idiot with a gun away from chaos.  Maybe I am completely paranoid, but I really thought just based on common sense that you could easily end up in a dangerous situation at this place.\n\nSo all in all I was glad to have been once and seen how Vegas can one-up itself once again, but I think I'd be very apprehensive to risk going back.", "date": "2013-06-11 03:22:41"}, {"review_id": "5E8UWQ_JR2tMJGO90RfgIg", "user_id": "XqYudZmEcWtkB9smJ6WU7A", "business_id": "4V_fxpk6DK9SNphlPsDQPw", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "I would give this dealership a 5 but after I got my vehicle serviced by them I think they deserve the negativity this time. All I had done was new tires and a wheel alignment and after getting my car back I had noticed that one of the bottles I use to clean my vehicle's tires was missing and even though it was only a $10 bottle the fact that they took it and lied to my face really irritates me.  A little word of advice don't leave anything in your trunk unless you want one of the service reps or technicians to take something without you noticing it's gone.", "date": "2017-07-15 22:13:02"}, {"review_id": "oQWsgIIkvCRnTM855L-J0w", "user_id": "my4q3Sy6Ei45V58N2l8VGw", "business_id": "jfmyj519pg2flxGEQ2xdPg", "stars": 3.0, "useful": 2, "funny": 1, "cool": 0, "text": "This review is delayed but I ended up going here for my Thanksgiving dinner. I was excited to dine at a place where I didn't have to have a huge wait in Vegas.\n\nThe service was really good and the food I would say it is just okay. What sticks in my mind is the fried fish that had a lot of bones inside.", "date": "2015-02-11 05:13:04"}, {"review_id": "2mChyydohY27sPHpTf-fLw", "user_id": "4K8E9DCN7tgQheXvW_5qDA", "business_id": "dA7ORbBrCdxoMlvn3I6JDA", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'm going to revise my original post after going on the maricopa.gov restaurant inspection list. It appears Shimogamo has a few citations for not keeping their fish at the appropriate temperature of below 41 degrees. In fact, these citations say it was up to 54 degrees.\n\nAs someone who checks the Maricopa.gov site regularly on these restaurant checks, I  know that there are some citations that are really stupid (for example - they got cited for not putting the \"consuming raw fish etc is bad for your health\". Duh, it's a sushi restaurant. But, raw fish storage to me is important, since that's how many people get sick from sushi restaurants. As much as I liked this place, I am going to hold off a couple months until the next inspection to make sure this isn't re-occuring .", "date": "2013-06-07 19:46:15"}, {"review_id": "5lAIHhc3VW-aMxi4WQ7tfA", "user_id": "4PIcSVhqA2pw9sTor5vq6Q", "business_id": "iJziJyLGEbcgTw79t5a-hw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hot Star Large Fried Chicken is more of an order and sit place, service at the counter was average, the insides looked modern and was very clean with several tables and high chairs. Might be hard to eat with large groups here but this isn't really a place to have a nice dinner hangout with, this is better treated as a quick eat and go\n\nFood ***\nI ordered their original large large fried chicken and while the taste was great and crispy, it's a bit hard to justify the $10 charge it comes with, especially since at the end there's a lot of bones. Even with a combo there are a lot of options around Finch for fried chicken where you can get more a bang for your buck. However, if you're craving Taiwanese style, this is a good go to for a pick up and quick eat. \n\nService ***\nYou order and sit so not much to write regarding service, it was just ok\n\nAmbiance *****\nStore was new and looked super high tech, was very clean. Had a lot of high top chairs on the counter if you want to eat alone and some tables with 2-3 seats, felt very welcoming. \n\nTips/Closing comments\n- Good place to eat for a grab and go\n- Try their original large fried chicken!\n- Only cash for less than $5\n- Only cash & debit between $5 and $10\n- Cash, credit, or debit any purchase above $10", "date": "2017-09-03 19:59:57"}, {"review_id": "dOcnRN68erxzFjeBBEMVhw", "user_id": "jzkbhkRdjWPwTIOgRGggIg", "business_id": "xAG04HVxelFsDrQY-Te0xg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Meh, busy store, seems like I often run into things I need that are out of stock, and the employees certainly don't do anything to try to help you.  Twice now I've had to interrupt a group of employees chatting among themselves who ignore you when you walk up for help.  Online ordering is decent, albeit one of the slower stores to notify you that the order is ready.", "date": "2016-09-25 22:00:58"}, {"review_id": "aBNauUjGVn3WdI9QTSgLHA", "user_id": "Lfv4hefW1VbvaC2gatTFWA", "business_id": "tv_p6iJGmaCmejW0L00JIw", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "Stop by and say hello to Gary.  Very friendly service and tasty pizza.  This is in an old pizza shop that was not the best but the pizza is much better.  The menu has regular pizza pies and Northern Italian square cut, hoagies and salads.  The crust is thinner and has a nice crunch.  The sauce seems to line up with some the the more popular style pizza in the area.  Parking is limited and no tables.  A few chairs at the window.", "date": "2014-03-07 18:51:21"}, {"review_id": "Dplv_-wZbWPEVNJO274wEA", "user_id": "dRixPis_gxuZQtJ_Gj9P9g", "business_id": "ppHkkuDvvH8g1Enz6F8OJA", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place! Local cafe with great food and coffee. \n\nBut I'm dropping my rating down some. There are two waitstaff that are young and inattentive. They forget things you ask for. They leave dirty dishes on the table. They place hot plates down in front of reaching kids. When the place fills up its like they can't seem to concentrate. It's gotten to the point that if we see these two working without the owners there then we skip eating there.", "date": "2017-05-06 18:49:42"}, {"review_id": "ehD7PpYtiEzDn3nXOw3Fwg", "user_id": "thx4OvDi4TTQnTyh-qGV8Q", "business_id": "LrxDRg8SQdgHMoz3TSAYFg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "Came here for the first time today. The food was great, but the servers were so slow and inattentive. Their pork sinigang reminded me of Lola's back in the PI. Lechon kawali was fried to perfection, non of it was over cooked and dry. The Bicol express had good flavor and a mild kick while the longanisa fried rice needed a touch of seasoning. My only problem with this place was the service. They are very SLOW! I would see them on their cell phones texting. After dropping the food off at the table, they never came back to refill our drinks or to check up on us. It took an additional 10-15 just to get the attention of our server to get to-go boxes and our check. I work in a restaurant, I know how it gets when it gets busy but dang, they weren't that busy. The girls were polite and friendly but they need to focus on their job. I still want to try this place a couple more times, I hope I get better service next time.", "date": "2013-08-10 06:28:27"}, {"review_id": "mqOvY2KiYh0uby3mgfwdVw", "user_id": "jwctwzboGhQmtC50Juxa9A", "business_id": "aY0Y058p2_iWxMAZron2mg", "stars": 3.0, "useful": 4, "funny": 0, "cool": 1, "text": "I had been to PAESE Ristorante many years ago when they were located on King Street West in downtown Toronto.  I remember having really fond memories of the meal that B and I had had there.  I remember we went there for Summerlicious and had such an amazing meal -- the service was great, the food was unique and delicious, and the portions were large too.  That still remains one of my favourite meals.  Thus, I was sad when I heard that they had shuttered their downtown location as I thought it was closed for good.  Fortunately, I found out later that they had simply relocated to the midtown area of Bathurst and Wilson.  Since then, I had been curious to return to it to try the food again.\n\nWe ordered two cocktails to start.  I had the Paese Collins, a cocktail with beefeater gin, lemon, and a thyme-infused syrou.  It was refreshing!  I was also impressed with this cocktail because there was sufficient alcohol content in it.  After a few sips, I definitely felt the alcohol!  I liked this because it meant that the restaurant did not cheap out on the ingredients.\n\nP had the Paloma Italiana, a cocktail with tequila reposado, Aperol, and grapefruit.  At the time, I think I liked it but it wasn't very memorable now when I'm writing about it.. lol.  (I do remember that it was just as strong as my cocktail meaning that again, they included sufficient alcohol into it -- you'll be surprised at how many restaurants cheap out on the alcohol in cocktails.)\n\nWe were served some bread with an olive spread which was so delicious and tasted like fresh olives!  Yummy.\n\nFor an antipasto to share, we had the Polenta Fries.  These were polenta fries served with roasted garlic aioli and a sundried tomato ketchup.   I'm a fan of polenta fries but I was really disappointed in this dish because of its portion size.  The presentation of it was unique -- the fries were served in a mini cart with paper.  However, since there were only seven or so polenta fries, it didn't look like there was very much of it at all.  The two dipping sauces were served in small squeezable plastic bottles.  I think to improve this dish, they should display it differently to emphasize the fries and not a couple of small fries in a large cart and plate.\n\nI have tasted better polenta fries before.  The polenta fries that I've had before were thick cut so that you could really taste the polenta in each one.  The polenta fries here were a little dry and over-salted. \n\nWe ordered the Mushroom and Spinach Garganelli pasta dish which contained roasted wild mushrooms and spinach with testun al barolo, parmegiano, and truffle oil.  This was a lovely pasta dish.  I especially liked the mushrooms and spinach!\n\nThe Margherita Pizza is a classic pizza to order.  It had mozzarella, fior di latte, basil, and tomato sauce.  Unfortunately, I thought that it's presentation wasn't impressive at all.  I expected the fior di latte to have melted in a more pronounced display on the pizza.  Instead, it looked just like a flat cheese pizza. \n\nTaste-wise, the Margherita Pizza was all right.  I liked the cheese in it.  I also expected there to have been more fresh basil leaves on it to look better (look at the photo of the Margherita Pizza on their website and you will see a big difference between the stock photo and this real life one).  Instead, the few pieces of basil on it were wilted due to the heat of the pizza.  Each bite of the pizza did have basil flavour though.\n\nWe ordered two desserts.  The Verona Chocolate Mousse had Grand Marnier and raspberry coulis.  The chocolate mousse was very soft and creamy.  The chocolate flavour was definitely evident.  It was a pretty dessert too.\n\nOne of the desserts that I remembered having from my first visit to Paese that stood out in my mind was the Affogato.  At the time, I remembered there was ice cream where you poured espresso on it and there was a huge delicious cookie (that B and I couldn't even finish because we had been so full that time).  I described it to P and she was curious about it and thus we ordered the Affogato on this visit.  It had white chocolate gelato, espresso, and a warm cherry and chocolate chip cookie.\n\nIt wasn't served in the same way as my first impression of it years ago where the chocolate chip cookie was placed on top of the mason jar that the ice cream came in but it looked close enough otherwise.  I didn't have any of the espresso (caffeine robs me of sleep) but I did try the white chocolate gelato and cookie.  Mmm, the white chocolate gelato was really good!!  The warm cherry and chocolate chip cookie was great too.\n\nI'm glad that I got to try the new PAESE again but I was disappointed that they simply serve Italian classics now and the creative dishes that I tried at their King Street PAESE years ago weren't available any longer.  Thus, to me PAESE is just like any other Italian restaurant -- their food was good but did come at a price.  The service was very professional.", "date": "2018-01-15 06:11:33"}, {"review_id": "ggrmYFhErYtVAJnmWL6Tzg", "user_id": "q6XnQNNOEgvZaeizUgHTSw", "business_id": "2cIOUvgj94isBx7-ssse8Q", "stars": 3.0, "useful": 4, "funny": 0, "cool": 0, "text": "I had been ordering pizza and dining here since this location opened in the 70's.  It honestly was the place I judged all other pizza by.  After I moved out of province, I still managed to come back every couple of years.  This was consistently among the best pizza in the world up until c2004 when I believe ownership changed...around 30 years of consistency, not too shabby!  I've been here 2 or 3 times since the change and pizza & other Italian dishes are still quite good, but don't expect the old Place Tevere...it's gone forever.  Still a nice restaurant however.", "date": "2011-05-08 16:04:25"}, {"review_id": "-n52VPgD-nXPTWSxx9RYDw", "user_id": "dH0RRa3Bz9_69Zol72ZvyQ", "business_id": "HlXKNztgnDql3M2uWVbHJg", "stars": 3.0, "useful": 0, "funny": 3, "cool": 0, "text": "Still amazing. I haven't had Popeye's in years. So good. But the cashier seems to hate her life LOL. That's why three stars. I asked for no salt on the fries (excuse the ignorance because I haven't eaten here in years!!!!) Every question i asked the cashier rolled her eyes and said something like \"they're already battered....ughhh\" etc etc.\n\nI had to hold back...\nAnd just laughed and said okkkay gurl. \n\nMy friend with me even said she's always like that. I cant believe it... she needs to cheer up and relax her face. Not cool! And if you hate your life... do something about it. No one is forcing you to work there.", "date": "2015-08-26 11:54:06"}, {"review_id": "hYKX0BU4Zrb6bEos9gO5cQ", "user_id": "MGQ7HFlON766kxgRAtDspQ", "business_id": "jRaFTzmmZjYOky0XygFNCA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's decent.  Our waiter was very nice and was a hard worker; he was very attentive and made the experience a whole lot better.  The food was okay.  The pizza was good, but the salmon my mom ordered was overcooked.  I would recommend coming here if you want to have a good time and relax with your family.", "date": "2017-03-13 03:43:09"}, {"review_id": "QZb1sp8oVKSpuVlTM2BV-Q", "user_id": "Hqk48Hqul5YTl1DG8MhTUA", "business_id": "TrGBHqHVzJM5tk2C1D1ctQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Been here twice now.\n\nThe Food is SUPER YUMMY!\n\nIn February when I came (first time) I had the #12 on the dutch crunch bread.  It was great!  I took half home!\n\nToday I ordered the #16 on Dutch Crunch.  STILL YUMMY!\n\nSadly, the customer service leaves a bit to be desired.  If you're greeted with a \"hi!\" That's a lot.  When you pay it asks you for a tip, but the only tip I could leave was \"smile, and make it seem like you're happy to see your customers\".\n\nI take reviews serious as I am a business owner myself, and I praise as much as critique.\n\nMy last two visits give the food a thumbs up, but the customer service a \"needs improvement\".", "date": "2016-04-19 20:50:28"}, {"review_id": "SGEbjV5YnWJURxAT1rjUvw", "user_id": "BrIza5_dTXAGhIJVM-grVg", "business_id": "Mi5uhdFB9OJteXPd0_IKfw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We sat at the bar, the server Mike was amazing. Very pleasant, An very outgoing. The food wasn't the best, well good just not amazing. Overall I enjoy it. Thanks Mike for ur amazing service...", "date": "2018-01-26 02:50:34"}, {"review_id": "fLUF-j-xtEGKPAbbm0idXQ", "user_id": "jJ-O5eYeZRf2YuLiAB_oPA", "business_id": "gGt00WW8sNY2Sop7jYa7Tw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Been wanting to try this place for a while. I think once you realize you can pay like 2 bucks a taco on the west coast, that 4 dollar tacos that are the size of a quarter aren't the best deal. \n\nI got the Short Rib, Fish, Pollo Rojo and Pork Belly Pastor. I thought the taste was good but not spectacular by any means besides maybe the Short Rib. \n\nFor about $20 bucks with no sides or drinks, it's a bit pricey when you compare to other places in CLT that do tacos. It's practically empty for lunch but I could see this place doing well after work or during dinner so I can't comment too much on the atmosphere. The service was great tho.", "date": "2016-02-29 16:35:14"}, {"review_id": "9V_QEDqwfOnhXUdWFMIiJg", "user_id": "PdgpUK6fHArEXsPcKFHXOg", "business_id": "FyucbcsZwdDs5RQ7Tk9z9w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great local place for a show.", "date": "2014-04-06 22:16:37"}, {"review_id": "Dj0sKwykQ1eKe5GdLXfBVQ", "user_id": "RBkCQRlJfGDrlISZyfW6iw", "business_id": "4vDffQ7eSQ7n39cyroOSKQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have mixed feelings about Crave. I absolutely love their ambience. I have been here a few times on dates and with friends and it is a perfect hangout spot. The music is never too loud to not be able to hear your company and I enjoyed the dim-lights and the comfy couches. The hookah is what sells this place for me because their desserts are sub-par at best. I had better cheesecake at Ruby's Tuesday and that's saying a lot. Maybe I am just bougie but I bake myself and their desserts just did not do it for me. So if you are looking for a nice place for a date/hookah, Crave is the place for you but certainly not for their desserts.", "date": "2014-01-26 01:09:58"}, {"review_id": "Uw-C0vWW7rfJi6eZCj1scA", "user_id": "4ZkQwaOoLT2eJWux9fE1Jw", "business_id": "u--jf3lS_04kmQNO4liAsQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We ordered a tray of sandwiches  for the office . It was delivered  timely. The turkey  sandwich  had very little  meat . They were inconsistent  . Normally  there is plenty  of meat but this time it was disappointing.  The cookies  were good . They told us to order one and half sandwiches for each person and ended up with 50 % too much food . I was very disappointed.  I will  pass on using  this place in the near future", "date": "2015-11-12 19:50:29"}, {"review_id": "73A-9SBPOU4miO9Ngcm5fQ", "user_id": "iJCtRAlSvxiUuKlVAnsq0A", "business_id": "NF6di6YcQxN0rDAleE7SyQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ten Ren is quite a unique experience. They carry a wide variety of hot and cold teas and tea-based beverages. The space is divided into a dining area and a premium tea shop.\n\nSome of the items on their food menu is inspired by tea. The Tea Egg for instance is an interesting take on the hard boiled egg and makes for a decent snack. The Fried Rice with Tapioca is less palatable than one would expect.\n\nBoth the food and the teas cost substantially more than neighbouring locales. I would recommend this place only to highly discriminating tea drinkers. As a casual enthusiast, I do not like paying the premium on what tastes pretty ordinary to me.", "date": "2013-04-25 00:10:47"}, {"review_id": "Wtk8iGBkIJKdhdhKYQLDUg", "user_id": "qtQOOYU5Ucyr0p3DnnS1LA", "business_id": "HP8mkVdLa9F4Amsp2thKhQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nothing really our of the ordinary here as I was not super impressed with the quality of the food but the service was absoutely incredible. Knowledgable staff made the somewhat complicated experience of customizing the burrito a lot easier.\n\nDecent price I would say but again i was not all that impressed by the burrito itself", "date": "2011-11-10 00:11:49"}, {"review_id": "dqT5okMms3h1cBic6Ofi7Q", "user_id": "Po4DlhJxBzQ8qAMTCa2NXA", "business_id": "X8c23dur0ll2D9XTu-I8Qg", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "So Hakkasan has been the new BIG club in Las Vegas. The venue and lineups have been said to be really amazing so I decided to go with my friends.\n\nBecause it's fairly new, obviously EVERYONE and their mother wants to go. And because of this, it's pretty ridiculous just to get in.\n\nI went during the night when Calvin Harris was playing. My guy friends had to by tickets which were $75. That's pretty insane already. We showed up much later than we anticipated, around 10:30 or 11. The nice thing about our guy friends having tickets is that they got in within 20 minutes of waiting in line. But good luck finding the correct line. They'll have you going from one place to another. \n\nNow for the ladies. We talked to a promoter and they told us about the ladies line. We were trying to get there around 10ish to beat the crowd but we were driving to Vegas that same day and hit tons of traffic. Going any time after 11ish is a nightmare. NEVER in my life have I every waiting almost 2 hours in line. I'm happy that it was free, but their lines are not well organized. There were too many lines for too many different lists. And the lines basically became a cluster, people weren't sure which line they were in.\n\nSo by the time I did get in, it was waaaaaaaay too crowded. It was impossible to navigate! At this point, I just wanted to have fun. I didn't explore, but my friends went to the hip hop floor. Apparently there was a giant panda dancing with people. But they said the venue is really nice as a whole.\n\nNow I would have given Hakkasan a 2 had it not been for Calvin Harris. It was my first time seeing him but he is AMAZING! PLUS, Hakkasan's sound system and light show were top noch. They had dancers with weird Lady Gaga like outfits. Very cool. When I got into the music, it definitely helped me forget about the nightmare in line. \n\nI'm hoping that the lines and the craziness will go away when the hype begins to lesson but unless you're dying to see a specific performer, I would be sure to go fairly early or just go somewhere else.", "date": "2013-05-20 19:36:16"}, {"review_id": "R-22KdnEDrMYz2K--sXjBQ", "user_id": "Gfxb_D1k8tueAoGn4cseoA", "business_id": "3l54GTr8-E3XPbIxnF_sAA", "stars": 3.0, "useful": 7, "funny": 5, "cool": 6, "text": "Over 900 reviews? I was excited about trying this place.  When we walked in, I saw a few open tables but was told 15 mins wait... (It wasn't lunch or dinner time, i think it was around 3pm on Sunday).  After perhaps 5-7 mins wait, our table \"became\" available... but it seemed that particular table was available from the moment we walked in..  This place was very busy and slow service was expected.  When our server spilled a drink, she said \"that's why I brought extra napkins...\"  \n\nIf you check in on yelp, it's $3.99 for chips and salsa.  Chips were thick and I wondered if these were homemade at this restaurant.\n\nI ordered mimosa with cranberry juice. Never had one before and I thought I would try it. I think I prefer one with orange juice.  Now I know..\n\nThe burger I ordered was very big, I ate about 1/3 of it and couldn't eat anymore.  Very huge. Perhaps I wasn't that hungry, but I thought I had better burgers before.  Perhaps it was a bad day for me.", "date": "2016-01-24 15:06:07"}, {"review_id": "bnPFBpnVhlq9_b5MJ9hSuQ", "user_id": "z72-arTJkduONFATfOZLVg", "business_id": "8K3CRM4COa0SSBEvli0fJQ", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "Waiting for a table on a friday night with the owner taking up 2 tables.  Not the way to do business. The d.j. is playing top 40 music and the staff seems scattered,  I'm sure that is natural given the owner presence. As a visitor, I shouldn't have to wait. The staff seems apologetic and concerned but there are reserved spots but nobody sitting there.\n\nTypically this is a great spot to visit when you want to relax and enjoy the evening, the hookah is really great here and the drinks rock too!", "date": "2015-01-24 06:20:42"}, {"review_id": "8DptLehrt3idOwEqo-8XmQ", "user_id": "4MpRiZD6Ieyz-Z9thCzmZg", "business_id": "ZX9lDyUg4qOqWtVZn0-uqQ", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "I'm really mixed about this hotel. There were several things I really liked, and several I didn't like so much. To the bullet points:\n\nPros:\n-Staff was excellent. Front desk, room service, and valet were all top notch.\n\n-Location is great. Was here to see the Indians and A's. The hotel is about four blocks away from Progressive Field, and I didn't have any problems walking to/from the game (night game, too).\n\n-I highly recommend the valet. So much easier than self-parking. They were really busting their ass to help everyone, especially on Tuesday morning with all the morons who called to get their car, then didn't pick it up.\n\n-The bacon cheeseburger from room service was decent.\n\nCons:\n-Rooms were dated. I guess this hotel just had a major renovation, but it looks like they spent all their time on the common areas (which were nice). You could see dirt in the electrical outlets, and there were stains on the lamp shades and wallpaper. Looked like a little kid went nuts. TV was a decent flat screen, but the remote hardly worked.\n\n-Bed was so-so comfortable. Not the worst, and I was able to sleep OK, but I've had better. The alarm clock was BRIGHT, even on it's dimmest setting.\n\n-The A/C sucked. I like it somewhat warm, and when I first got in to the room I saw the A/C was set at 60, so of course I turned it up. Now it's at 70 and felt like 80. I see why it was turned down. Looked like the curtain was resting against the A/C air inlet, blocking the airflow. The unit was quiet, though.\n\n-The light by the door you turn on when you first get in to the room was very dim. I'd rather see a brighter fluorescent in that lamp so you can see inside. The rest of the lights in the room were fine.\n\n-The housekeeping didn't come until about 5pm the first full day I was there.", "date": "2011-09-09 18:42:30"}, {"review_id": "Y8uDFoj2S32Fts4tjwJNpQ", "user_id": "WvHVCZTkscJ9v6pAqDq_mQ", "business_id": "q8SrBqmGOBiXSJ6Hqy6f7A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Mike's Place is pretty cool, especially for that hangover breakfast when you're able to move enough to drive the car but not enough to actually cook your own food. There are some good pile-up breakfasts on the menu that work perfectly to nip that hangover right in the bud. If you're not going for breakfast, they also have good things, but I can't remember any of them because I really only went for breakfast.\n\nI did have a couple of blah experiences where food was cooked wrong, or I got the wrong item, hence the 3/5 stars. It's nothing too fancy, really, but it's good for the price and the atmosphere is fun. Usually the servers are pretty friendly.", "date": "2015-01-10 16:51:55"}, {"review_id": "GY5_0yDjpSVAq4itMGGGHQ", "user_id": "yTzXs9MXiJ9Ec_VBsCmuTg", "business_id": "DiCfRiL3WX-vwkK85qrIjw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Better than the 3 major franchises, but only ok. Crust is doey and some meats have an unusual initial taste, could be the cheese.  Wings are ok too, but a little different. Great delivery service though.", "date": "2016-07-10 18:00:41"}, {"review_id": "njxHaIuNA2YhRlNsNdx3Qg", "user_id": "Ky2nn0TYhH3PuwHPALt7Lw", "business_id": "MVIthKWqwkQz0dai7LkVzQ", "stars": 3.0, "useful": 1, "funny": 1, "cool": 0, "text": "Customer service was decent. The inside was crowded which doesn't really allow for waiting for takeout so that wasn't smooth. I ordered the AJ Wrap which included rice, chili and veggies. It was a nice size but pricey to me. It was pretty bland with no seasoning whatsoever so I'm gonna have to give it an overall 3 stars. Also there seemed to be more bland rice than chili which was extremely disappointing for $11. Boooo to this item. I ordered a vegan chocolate chip cookie with walnuts and it was just ok. I won't be going out of my way to visit this joint next time I'm in the east side.", "date": "2017-08-13 22:08:49"}, {"review_id": "tx_xCvRFzFuKAcS9WqG52Q", "user_id": "itDc4YVYP6KaRPpWlSgsJg", "business_id": "8rxTliTcvcIjkbzx5nmiXg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ive been going here for more then 8 years and in general have had good experiences.  I do however HATE when your Dr. leaves the practice and you call to make an appointment and are told they no longer work there, and you just saw that Dr a month ago, which has now happened to me on five  occasions.  What if I don't trust the other Dr.s at the practice?  Dr. Levitt must be difficult to work for when so many good Dr.s keep leaving.", "date": "2015-09-29 17:23:25"}, {"review_id": "rVj-RgmtbzIziUyRFkZanQ", "user_id": "ntuYgYgQEMj2-skkch2qQw", "business_id": "h6BfSMMGfhNF9WCkTU0RMQ", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I've been to Aveda once for a wash and style and a few times for a haircut - all by institute students.  Try and call a couple weeks ahead to book an appointment as their appointments book up pretty quickly.\nAll my visits have been pleasant - everyone is very pleasant and friendly.  Part of the Aveda experience is they offer you a coffee/tea when you first arrive and also a nice head massage. I also love the Aveda products they use on your hair during your appointment.  However, do keep in mind that your appointment will very likely take about 2 hours for a pretty simple haircut (a trim).\nMy main gripe with the institute students is that they don't really listen to what I want when it comes to layering my hair - I have pretty thick hair and I always ask them to take some bulk off; of the 3 times I've been there only 1 time did the stylist kind of listen to me and take some bulk off - but that's only after I repeated to the educator that I wanted my hair layered and to take some bulk off.  \nI'd recommend getting a haircut by an institute student if you have pretty thin hair and are looking for a pretty simple haircut.\nIf you have a SPC card you do get 10% off their services; with the 10% off a haircut by an institute student comes out to be ~$27.", "date": "2015-06-29 18:07:59"}, {"review_id": "ye5BL72BDt5vWkLAlEGLMA", "user_id": "tdxR42PJOMwI4GQEbrvrsw", "business_id": "duw-3Aj7gAKbQG-isS5UtQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good NOT great.  I had dinner here with several of my coworkers.   I opted for the Chilean Seabass, it was good, not great!  I was almost going to say it was OKAY but I think it might be better than okay.  The service however is fantastic and the atmosphere superb!  We all sat outside to dine and it was very nice, very relaxing.  I would return perhaps to have lunch or breakfast but for the money, there are way too many options in Vegas for dinner and this would not be my first choice.", "date": "2008-10-14 03:22:54"}, {"review_id": "uOya80bppIemWXmBvAbCSA", "user_id": "Yc3g0KMp3991QIC4Ot1fxQ", "business_id": "Zv77o3aDuNDY0t3fCU2ebQ", "stars": 3.0, "useful": 3, "funny": 4, "cool": 3, "text": "This place is classic east coast Italian, with parking in the rear and an unmarked back door entrance included.  Definitely a run down, hole in the wall type of place with a musty smell and a decor I'm sure hasn't ever changed in the decades this place has existed.  \n\nFive of us came in on Saturday night on a whim to \"try something different\" from our usual haunts.  Boy was this place different!  We sat in the bar area where several tvs were showing the cards preseason game, and one muted tv was on the sound of music...\n\nThere were 3 or 4 other parties in the bar area, average age was approx 68.  Fortunately none of them really had any problem with our obnoxious drunkenness.  Not sure how many people were in the dining room portion of the restaurant, but suffice it to say the place was far from empty, which is always a good sign.  But there was only 1 bartender/waitress working in the bar area, and though we were more than patient and amiable, she was still very flustered with her duties.  Eh, we were drunk and didn't care.\n\nOn to the food.  We ordered the eggplant rollatini and mozz sticks to start, a pizza, manicotti, chicken parm, and fettuccine alfredo.  Everything was pretty good, huge portioned, relatively cheap, traditional italian(-american) food.  It really hit the spot!  The marinara sauce was incredible, and the manicotti was bursting with ricotta.  The pizza was good, the chicken parm standard (the spaghetti was cooked perfectly al dente), and the fettuccine was probably the loser of the group (my meal, of course) - it was good, but not as creamy as I had hoped.\n\nAll in all, this was exactly the type of experience we expected and went looking for.  I honestly have a feeling we'll all be back.", "date": "2009-09-09 01:26:20"}, {"review_id": "PTvKK4Y1FqvDXSG0SDtJ-A", "user_id": "ShfwfGZcxQPpVYmEgilx_w", "business_id": "L2p0vO3fsS2LC6hhQo3CzA", "stars": 3.0, "useful": 2, "funny": 2, "cool": 0, "text": "I ate breakfast here on the 4th of July. Honestly, the food is decent (nothing special)-it's also overpriced.   MBB is a small restaurant that always has a line out the door and around the corner, but since I've eaten here, I really don't understand why.  Maybe everyone's visiting Phoenix like me????\n\nI highly recommend going to LoLo's, it's better (more options and taste wise), and you get more bang for your buck. A stranger (Phoenix resident) also leaned over to tell me that LoLo's is definitely the better option.", "date": "2014-07-04 22:00:59"}, {"review_id": "a8Z3kQ4fsbc1JlEFuc7Zgg", "user_id": "8HCEPF0IflyB690Q745fKg", "business_id": "FeC5DeqINOSr37y5TABnKA", "stars": 3.0, "useful": 2, "funny": 1, "cool": 1, "text": "Parkette, a perfectly nice place for brunch by Trinity Bellwoods park!\n...Especially when Swan down the street has a super long line up.\n\nAfter Jenn K's yoga UYE (which I totally wish I could have been a part of because she did an awesome job teaching!), we ended up at Parkette for brunch.\n\nIt's a bright space and I love coca-cola decor!\n\nThey offered some interesting brunch options.\nDeep fried pork belly eggs benedict?!\n..Okay!\n\nFor $12 dollars, you can have crispy pork belly smothered in hollandaise sauce, with spinach, potatoes, and eggs.\n\n* Fatty pork belly for breakfast was good but different.\n* I found the hollandaise had a bit too much lemon juice and it was a bit citrusy for my liking.\n* I wasn't into the eggs benedict served on fresh cut bread.\n* A bit skimpy on the fruit\n\nIt's a nice spot though, so if I'm in the area, I would consider popping in again, perhaps for a rustic Italian dinner.", "date": "2011-09-12 02:20:27"}, {"review_id": "OsbtVAtkgHGv8KhiMCL7lA", "user_id": "lBIfa3INjAj_z2_amlnq3w", "business_id": "avpF0bQMLX3sfSxrLtcc5Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped by for a drink at the outdoor area. The staff is pleasant and friendly. The wine pours are super generous. Not a bad place to rest a bit and get a drink.", "date": "2015-06-02 02:50:30"}, {"review_id": "wRhGC7iMG4lwXGQciAuBnA", "user_id": "szscXVvV67KKYbFA9v65vA", "business_id": "g14SuHGkIL-2pSWhRkSSlQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Read the good reviews and decided I should give it a try.\nIt's a lot of food for lunch. Got their vegetarian thali.\nRice was good (yes rice can be bad too)\nNaan was ok,acceptable. I don't think it's homemade. I don't think they have a tandoor oven there. \nFood had a light kick but the Chili pickle was there if you wanted more zing.\nThe rest was decent. My favourite was the paneer dish, I liked the sauce for my naan.\nIt's light in that they don't add much cream, if any to their dishes.\nIs it my fave? Nope. But it cured the Indian craving ?\nYup...", "date": "2018-01-17 20:56:43"}, {"review_id": "rRO-WI0M_gkcbvNbW0DdRw", "user_id": "cI2kLhREdr6GqSePfcGj-g", "business_id": "B3omTXI--0eiBC7nCv_WXg", "stars": 3.0, "useful": 0, "funny": 2, "cool": 0, "text": "I debated on 2 stars or 3 stars but decided on 3 because it was my first visit and maybe It was just a bad day. \nI ordered the Gobbler and the Farm Fries. \nThe Farm Fries were hot and loaded with cheese and gravy. Maybe a bit too much gravy but that's nothing to cry over. \nWhere it all want wrong was the gobbler. It was just a boring puece of deep fried chicken on a bun. It was either sitting out too long or overcooked (or both ) because it was really dry and chewy. The only way I could finish it was to remove the bun and just eat the chicken, though I ended up feeding half to my dog.\nFYI, the dog had no complaints.", "date": "2015-05-20 00:31:16"}, {"review_id": "AUFPkK9vky3EJR61dSg92Q", "user_id": "HyXK2GNR9i4SWpLQGOqQYQ", "business_id": "osvcl7Fh_J5VwUikh5Vskg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "4.99 all day breakfast that comes with ham, eggs, milk tea, and a typical noodle dish (like macaroni or vermicelli) and you can choose your meat (like spam, satay beef, etc.). If you feel like the basic is not enough, you can always ask them to add extra soup, noodle, or meat for an extra dollar-ish. For the most part, if you're a typical guy, it's not gonna be enough. Sometimes depending on how hungry i am, it might not be, but for the most part it's enough.\n\nThey also have a large number of hk cafe dishes so this pretty much hits the spot even if it's not amazing food.", "date": "2013-01-13 21:48:01"}, {"review_id": "jMJKjz-BeC9TFs-zTTFRLQ", "user_id": "460PoNGmuFFKF4cJ2XQj9A", "business_id": "WfgupKdYx1h0mKBmOmNQ3g", "stars": 3.0, "useful": 2, "funny": 0, "cool": 2, "text": "Pretty good value for your money.  I had the cashew chicken lunch special. The lunch specials are reasonably priced and come with massive amounts of food.  Each lunch special includes a cup of hot and sour OR egg drop soup, 2 fried wontons, 1 egg roll and your entree served with steamed rice.  Since I'm a big fan of wor won ton soup and am always looking for the best out there, I also ordered that to give it a try.  Like a previous review, I found the won ton soup to be very fresh and satisfying and it was probably my favorite part of the meal.  The hot and sour soup was also good; it didn't seem hot at first, but as I continued eating it, I could taste a little bit of heat kicking in.  Because there was so much food, I didn't eat the fried won tons or the egg roll.  The cashew chicken was a tad salty, but mix it with the steamed rice and you're good to go.  A solid \"A-OK.\"", "date": "2009-08-27 08:21:06"}, {"review_id": "kAZdYdQ16nUKLfOVZSyKMw", "user_id": "Znid_azpcHmdRMHGicmkWA", "business_id": "gTw6PENNGl68ZPUpYWP50A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Lychee soju gets 5 stars but it really should be kept chilled! There are a lot if asian kids that come here that are extremely loud. They have a lot of spicy or sou dishes. We ordered a bunch of things and they were ok. The garlic chix wings were good. The katsu was overcooked and hard to chew. I had to chew it for a while before it was safe to swallow. The eggs and spam dish would be a great dish for breakfast. Service started off slow and cold but a few other servers redeemed the server points. This place is small even with the patio area. Not sure if this place is worth the long drive from north las vegas.", "date": "2013-07-22 04:35:43"}, {"review_id": "8CpBcZvT6iEfDBTSwgokFw", "user_id": "X9qakqm1ypizTTiC_R58OA", "business_id": "i1Xkm22_96GNVVOXSUoL0A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "So this would be the newest trend happening right now in Toronto. In my personal opinion, I'm not a fan. Now this is just me, the service was great, the spices used were nice. However, the \"freshly frozen\" seafood didn't match up in quality with other seafood I have eaten. Plus I don't like eating with gloves on, so the whole idea throws me right off. In total probably 3/5 stars.\n\nWould I go back again? Perhaps, but I wouldn't wait an hour for it. Let's be real, when I get \"hangry\" I prefer to eat right away.", "date": "2015-12-14 16:29:46"}, {"review_id": "Zdis_HivR2arR0m33XEX_w", "user_id": "9Z9sBCS4nk7iYktFmUh7EA", "business_id": "yqYtY3-Po4OVPafA9Z-Xyw", "stars": 3.0, "useful": 4, "funny": 4, "cool": 4, "text": "Glad to be back to AZ and craving some sushi. Once my father told me \"if you want fresh fish, eat at the coast, you won't find fresh fish in the desert\"  I guess times have changed.\n\nThe place looks nice, on a strip mall, the ambiance is kind of cold, seamed to me like of a old breakfast place. I sat at the bar that is oddly positioned at the entrance and at first smelled a bit like floor cleaner\n\nThe warmth of the place is on the service, fast friendly and with a smile.\n\nMy beer was cold, off to a good start.\n\nMenu offers some different spins on the traditional and great variety of dishes without being overwhelming.\n\nI ordered some salon sashimi and a couple of different sushi.\n\n\nI was a bit disappointed even though the quality and fat of the fish seemed good it had a slight \"fridge\" taste. May be the way the store it is not the beast? I don't know nevertheless killed my will to come again\n\nSafe yelping", "date": "2014-11-05 01:34:14"}, {"review_id": "k-RiBH8XCPT6fo0oSYYdVg", "user_id": "4bxhIKz9ePWqD93UkEjnbg", "business_id": "B_oZ0JvfN2NNWj7yK-bpow", "stars": 3.0, "useful": 3, "funny": 2, "cool": 3, "text": "The service was very friendly and thorough though a little slow at the drive thru likely attributed to people placing large Swiss Chalet dinner orders while we burger and fries-type people are left waiting. Not a biggie though. \n\nThe burger was good but the fish sandwich went half eaten before being tossed. It was obviously REfried but too much so as it tasted a little burned. I wouldn't order it again.", "date": "2017-11-14 22:39:08"}, {"review_id": "D0aiDJiV4dgSI-1SN-33Yg", "user_id": "5IaHGddT0RLq1-S5LbP1iw", "business_id": "J5JzAUd2wzyArZ-qHT0A4A", "stars": 3.0, "useful": 3, "funny": 0, "cool": 2, "text": "Poros is a great lunch/dinner spot right in Market Square in downtown Pittsburgh. We started with the dips. You can pick one or two or get a discount if you pick all three. I thought all three dips were delicious-- Hummus, Baba Ganoush and Tzatziki served with pita and bread. My friend and I split the Chicken Shwarma and the Grilled Cheese sandwiches. I thought the Chicken was delicious, but the Grilled Cheese left a little something to be desired. That being said, I think it's hard to make a grilled cheese memorable.\n\nI REALLY want to go back and have some seafood dishes here because it seems like that is what they really specialize in. They have a gorgeous display of fresh fish and thinking about Chilean Sea Bass makes my mouth water!", "date": "2016-05-26 20:05:03"}, {"review_id": "rlNz-tZAtOAKtsTacvr9BA", "user_id": "RGezGxhPbG8SNZyms-WfeA", "business_id": "lslPZKTjaG9vhfINJ9acFA", "stars": 3.0, "useful": 3, "funny": 1, "cool": 0, "text": "I brought my daughter to Fuchsia over two years ago for a last minute facial.  I called lots of places on a Sunday morning, and this was the only place that could fit me in at the last minute.\n\nMy daughter was having some breakouts, and I thought a facial would serve her well.  I immediately became a member because I thought the $59 membership would \"force\" me to get out and do something for myself.  (Although I have not been a stay at home mom for 9 years, I am still accustomed to not spending much money on myself.)\n\nMy daughter's face cleared up quickly.  I followed up with some express facials, but eventually I signed her up for monthly facials as well because her skin only stayed clear with consistent facials.  I currently have both daughters (14 and 16) getting monthly facials.  \n\nThe place is clean and very welcoming.  I never had regular facials before coming to Fuchsia.  I had one facial at Dolce salon.  It was nice, but I thought the people were snotty.\n\nI later had a second facial and massage at JC Penny salon.  It was also nice.  However, when I went back for my second appointment, I waited for 20 minutes before leaving.\n\nSo mostly the facials I have had have been at Fuchsia.  From what I remember of the other places, Fuchsia's prices were much better and the quality was better as well.  \n\nNever once did I feel pressured to get memberships for my daughters.  Most of the ladies there do not pressure you to buy products either.  Some of the products are expensive, but Eminence products last a really long time and are worth it.  \n\nWe started to get pedicures at Fuchsia to last year after my daughter got an infection in her toe after getting a pedicure at a \"hole in the wall\" place.  The cost for pedicures is a little more at Fuchsia, but the infection on my daughter's foot taught me to not be so cheap in that area.\n\nFuchsia is a great place, and I am so happy with the service we've gotten.  They're flexible and are great when we have to make a change in appointments due to my daughter's busy school schedules.   \n\nMy girls still have some breakouts at times, but regular facials and extractions have really helped their skin and confidence with their appearance.\n\n**After being a member for quite some time, we finally cancelled last summer when we had problems scheduling.  Once the receptionist scheduled us on the day of a big event and when we showed up the day before for facials, manicures, and pedicures, she told me that we were scheduled for the following day.  That happened twice.  Then they could not coordinate three of us together without one of us waiting, so it became a hassle with scheduling.", "date": "2012-03-16 21:44:02"}, {"review_id": "wQt2nQDMVgNxU-wrBtOY5g", "user_id": "PePWIBvMyZ529fhrJLzgJQ", "business_id": "X8c23dur0ll2D9XTu-I8Qg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I feel like this club has a darker vibe than XS or Light.  They do have nice productions with all their lights and visuals, including performances by girls dressed in brightly colored costumes performing a choreographed dance on a small stage behind the DJ above the crowd.  Nothing as elaborate as Light.  The dance floor is pretty small. A lot of VIP tables.  The second floor is the mezzanine which overlooks the dance floor and DJ, and there's a third floor with the Ling Ling room where hip hop is played.  The club itself seems pretty big because there's room to roam about. Ladies, wear comfy shoes as there is no area to rest your feet unless you have a VIP table, and there are a lot of stairs.  Great venue for EDM but not as elegant as XS.  Both guest list lines and general admission lines are freaking long (they probably hold the line to make it look like its super poppin inside) so allow for early arrival so you can enjoy a little of the club before it gets too packed with sloppy drunk people.  I'd probably only come back for a DJ I really want to see.", "date": "2013-06-06 15:24:10"}, {"review_id": "Lvf96acLPB5J3e6RQVt0rw", "user_id": "xZV_WXfK67NJEwi0bLEVfQ", "business_id": "5eKk8dA1QtKaQr_5i_SCRw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not the best Mexican food I've had by any means, but this is Pittsburgh....At least there were real latinos working there and it's fun to hear Spanish. I liked the decor and people seemed to be having a good time. I would go again if someone invited me because they wanted to go, but I probably wouldn't suggest it if I were to invite someone to dinner.", "date": "2012-03-17 02:08:06"}, {"review_id": "Z4Lq0rs8Kzl7PtOd1CzYVg", "user_id": "W76klLi5DWh8v3aVhqATCQ", "business_id": "Dxp9SElV1f5MwPxIun_47w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Horrible service. They aren't personable here. One time, we were one of five tables and walked out because it had been 20 minutes between receiving a menu and waiting to be served. I think FAB Concepts needs to get their stuff together. Food isn't great. I only ever really get the pulled pork poutine. We really only go here because of the location.", "date": "2018-02-28 22:02:42"}, {"review_id": "WesQlLnKHxSzg9T0QbqdRg", "user_id": "KMdZYf77IF_9YxlP5I8_Tg", "business_id": "G1t8_G105yWDTPiWe1oEQw", "stars": 3.0, "useful": 2, "funny": 1, "cool": 0, "text": "Love, Love both my doctors!! Yuiko and Oliver are 2 of the best! \nHowever, 55 days to her an appt?? Absolutely outrageous! I have to pay monthly to be seen with you. Yet, I wait 2 months for an appt?! You have taken on way, way too many patients! At what point do u stop doing that and care for the ones you already have?!!\n\nThanks for nothing Obamacare! Biggest FAILURE of our President!", "date": "2016-10-06 21:25:19"}, {"review_id": "W-d0szHycL-FnNJ5PmSTJw", "user_id": "24VGprTZAD2YVMgCLyyCFw", "business_id": "j2ylpi_0ByksVQiq4GiTYA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pleasant staff and they appear keep all popular books from Amazon (even the stranger ones) in stock. Service on the phone was very polite and efficient.\n\nCertainly Amazon is always, repeat always a great deal\ncheaper. However on the app or in browser you cannot browse your selection, choose your item and begin reading that day.\n\nFor those of us who are impatient and still reading books on paper, it's a decent store to shop, but certainly no place to save money.", "date": "2015-05-17 23:48:25"}, {"review_id": "AYEXejHNAEu-CvB4YsZiOw", "user_id": "WZWzbU3y3PMUFQZMDpSygQ", "business_id": "f2BFIjiKorIh9SARv8s_ug", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "The pool is huge and fun.  It goes around the entire complex.  \n\nThe music was good but the party ends early.  It was 100 degrees or more most days, so having the party from 12 to 4, when the sun doesn't go down until around 8pm sort of sucked  \n\nThe bartender Black Ice is the best.  He kept the drinks fruity and potent.    \n\nThe place is nice, I like the set up and the ability to gamble in water. \nTHEY WILL ENSURE you have on a swimsuit.  I had on cutoff shorts over my swim bottoms  I didn't want to walk around the hotel and Vegas with just a cover up on, so I chose shorts.  The woman checking bags made me pull part of my short down to show in fact I had on swimwear.   Do not bring a huge bag or else it won't get in.  They will provide towels for you.  \n\nTwo problems:\n\n1.  Getting in here is soooo confusing.  You have to walk through the hotel around and down up and over.  Then finally you get into a SUPER hot parking structure.  And then stand in line to get in.  Really there has to be a better way.  Throughout the hotel you can see where you are going.  There are doors and entrances, but security stands there and tells you to keep walking to the back.  If the back is going to be the main entrance then have a GOOD access to the back without having to enter the front of the Casino and  walk a long way.  We made \n\n\n2. There are not a lot of places for the \"commoners\" to sit and lounge. We got there later in the day so it was not an issue as we were able to sit at an empty bar and leave our stuff in there.  But with a nice crowd I can see you having no place to set your stuff.  You will have to have a cabana or reserve one of the seating areas.  If you're gonna pack in the people have a spot for them to sit if they please.  Yeah I get it you want people in the massive pool, but it's nice to be able to sit down too if you choose since it's a \"beach\".", "date": "2016-07-29 07:14:58"}, {"review_id": "q9WFOL9paOmFOhOCJhNTyQ", "user_id": "bAV9OzddT7ufO7cfGPGabA", "business_id": "gChmBjLSe3qa8rzEngoDLQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went for restaurant week. The menu was small and simple. I had the soy glazed salmon and  stuffed dates. Both were delicious. What wasn't anticipated was the 20% gratitude pre applied to my bill. Takes away from me being able to control the tip. ***Edit- They have added the 20% gratuity to anyone eating from the restaurant week menu.", "date": "2018-07-23 01:38:22"}, {"review_id": "RgM_anHLK2iuk1oh3r5trw", "user_id": "vWP8-aQX0rYJszqkWVL7Ew", "business_id": "bzyoY6HHZJS39fspg-6DrA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "Came here again with some co-workers. Lesson learned from the last time we were here, no more splitting family meals with a bunch of hungry adults. I think this time we all got our own meals. Two meat meal was my choice no sharing. Texas style brisket was good but probably should have done the sliced brisket, looked bigger and not chopped up. The turkey was juicy and good too. There was ice cream.\n\nThey were fast with bringing out our food. Don't mess with hungry peoples food. But still pricey didn't have any lunch special prices.", "date": "2012-02-12 22:17:33"}, {"review_id": "3O6KRL3Ht9IHapSTIonpLQ", "user_id": "IKyw64foo97ans4NCboI-g", "business_id": "0FUtlsQrJI7LhqDPxLumEw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food is good, but the lines are long for waiting especially on weekends. \nI would go either early or off times.", "date": "2015-09-07 03:47:44"}, {"review_id": "CevznsFJQPNfQaJ_fzMo8w", "user_id": "m5b84-nPPVNLlDtZyVGZ3w", "business_id": "n9BrA1zIwlbiP1hLAc24jg", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "Solid choice for take out in the neighbourhood. Dude behind the cash was super friendly, informative, totally willing to jump in to make the sale.  They have three sizes of pizza, we were sharing just two of us and so we chose the middle size, which works out to 3 pieces each.  We shared a pasta, too, and this made a good sized meal for two people and only $27.  I preferred the pizza - the crust was really good, and the toppings were great (funghi), but he preferred the pasta (carbonara).  Next time I'd want to try some other things, but I would certainly be back.", "date": "2015-07-22 03:00:24"}, {"review_id": "-BBFEwXbA-zBCzx5SV0T_A", "user_id": "CxDOIDnH8gp9KXzpBHJYXw", "business_id": "r-YMM2Ibe80-APKShjo46A", "stars": 3.0, "useful": 2, "funny": 2, "cool": 3, "text": "Marish's Boulangerie is a cute little French cafe, it seems to be the only French bakery in the Port Credit area.\n\nTheir pastries and baked goods looks really good and tasty. Price wise it is a little more pricer..but it is nice to enjoy some quality pastries after a walk around the area.\n\nStaffs are nice and friendly. The Dark Chocolate Creme Brulee ($5.65) definitely really great in my photo!! And trust me, it tasted as delicious as it looked!", "date": "2011-05-11 23:54:12"}, {"review_id": "79cfhG61fdLusTapKet7Ww", "user_id": "M0NyAn-gufB2cfJNgvIdzQ", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was a little disappointed with this buffet. The buffet selection is very small. They had a breakfast section and a lunch section. I only enjoyed their french toast, angry mac n' cheese, sticky buns, and their banana bread pudding. Their dessert section very small that I only took 2 desserts, which was the banana pudding and a cookie.", "date": "2017-09-05 01:05:43"}, {"review_id": "kVlTBZCVMvewFlZ0Thh77w", "user_id": "BaH68sAKBFtkLVNozYoJvQ", "business_id": "g7bVip6ncXJC5xzkQMjohQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's alright. The décor is definitely what got me. Many times I've passed by here before thinking it would be a very interesting place to dine. It's quite quirky indeed!\n\nThe food was ok. Westernised pan-Asian cuisine. Nothing exceptional but still a decent dining experience. \n\nDisappointed that they did not provide any tea for free, though. Pretty much any self-respecting East Asian restaurant will serve you tea as they would tap water.. at no extra charge.", "date": "2014-02-13 03:46:22"}, {"review_id": "659TP8Kw2T5kwYZAjvAfgg", "user_id": "5Q-gQdK0kiK7GF905w8tMw", "business_id": "GjX2WgchvvS-JAWBmzkLyQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We are big fans of Pho, so we were happy to see another choice added to the city.  When comparing other Pho spots in town, the service was the best we've had among them and the prices were slightly cheaper.", "date": "2011-01-29 22:20:48"}, {"review_id": "37VbYNTmkpVNoX_OgDh8SQ", "user_id": "oUGJ-4qUlD5-hwTLyitSsQ", "business_id": "q41a20zmo6bFmYBzjUABtA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Took my 2007 Hyundai entourage in for a break check I waited about 1 1/2 hours for the inspection. \nThey told me the rotors and break pads are glazed and needed to have the rotors turned and pads replaced. Estimate $ 500.00 \nCome to find out all I need to to is sand off the glazing from rotor and pads. I'll do it myself at home cost 0 dollars yay", "date": "2018-08-18 18:48:15"}, {"review_id": "auklUP97RxnZzBTm0Dznsw", "user_id": "B0L6WgKlb9MnRQSjcqYTAA", "business_id": "_6Brh4UGrsnakkBKT1H_Qw", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "I want to give this place a 2.5 stars but I can't. So I guess 3 will have to do...but too high. Pizza was ok...one came out underdone. Beers a little pricey for quality. Service was maybe 2 stars...not very good. I would not come all the way downtown just to eat or drink here.", "date": "2016-07-08 21:06:17"}, {"review_id": "FbIgPwkyoJIQFgehs-3_VA", "user_id": "wJgtf18VKKZq9A6ZQUybQw", "business_id": "HCCg-rVnHQ2FI6lHs_LvUQ", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "Before hitting up the Scottsdale Civic Plaza for a Sunday A'fair, we stopped at Daily Dose for brunch. It is a popular place as realized by our 30min wait time and the group of people putting their name down for a table. We hung outside near the patio and admired all of the food they were bringing out. \n\nAfter we were seated, we perused the menu and I decided on the California club on a pretzel roll. I have to say that I'm not a fan of cucumber water, but that's a minor issue. Everyone's food came out and it looked really good. My sandwich was average, I thought the pretzel roll overwhelmed the flavor of the sandwich, and I ended up adding hot sauce to add some taste to everything. This is a really cute place though (much bigger than the outside lets on), and I would definitely give it a second try.", "date": "2012-02-12 21:16:30"}, {"review_id": "inIyz0spR1gQpdfokovfjg", "user_id": "0z6YVu82jHtJAEK8sas0SQ", "business_id": "x8UvTkKx9WApRsMxQ3ZPtQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "We recently won a gift certificate to the Crown and Dragon pub via Twitter, a midtown bar located just past Yonge and Davenport that is well-known for its delicious variety of chicken wings! We sat on their patio this past weekend and enjoyed a casual lunch before a stroll through Toronto's Summerhill neighbourhood.\n\nCrown and DragonThe Good: The small Yonge Street patio had the perfect amount of shade as we sat enjoying our Dragon Caesars ($7.25), an extra spicy cocktail mixed with their signature Dragon's Breath wing sauce. Their wings are half price after 5pm both Tuesday and Thursday nights, as well as all day on Sundays. We got a pound of their Smokin' Gun wings ($10.95 regular price), a sweet and smokey version of buffalo wing sauce, and they were cooked perfectly.\n\nThe spicy spinach dip ($9.95) wasn't too fiery, and tasted amazing with a side of chips and pita. We were stuck between deep fried pickles ($8.95) and jalapeño poppers ($6.99) but decided to go with the latter, which were very similar-if not the same-as the ones in the frozen section of the grocery store. But, I do love the grocery store kind and they were about the same price!\n\nThe Bad: The interior space of The Crown and Dragon is totally outdated. For this upscale area of Toronto it seems kind of run-down, but there's a sort of endearing homey charm to the atmosphere which almost functions as a sort of redeeming quality. The prices also seem a bit high considering the atmosphere.\n\nOverall: The Crown and Dragon is the sort of place that I will probably go back to have a beer with a friend in the summer, when the patio is open. The service was friendly and well-paced, it was an extremely laid back and casual atmosphere, and the drinks are just slightly cheaper compared with many similar venues in the area (take Spirits at Church and Bloor for instance). The food is pretty good and comparable to Jack Astor's, and the wings specials make it worth going back.\n\nThe Crowd: Around noon on a sunny Sunday, there were a handful of other people, mostly mid to late 20-somethings sitting outside with mid-day beers and caesars.\n\nSee their menu for pricing here.\n\n890 Yonge Street\n416-927-7976\n\nAnd don't forget to check out the Crown and Dragon Twitter account, they give away a $25 gift certificate once a month to one their followers!", "date": "2014-06-04 18:12:12"}, {"review_id": "q6p3IDGyC505ZtXWhtXEew", "user_id": "XNPwLVwHPyrOaEQA_sI1wg", "business_id": "3l54GTr8-E3XPbIxnF_sAA", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "This does not happen often that I completely disagree with the rating of the \"masses\" but I really struggled to see what's so great about this spot. I have been in the past to a number of spots specializing in throwing literally anything on a burger (peanut butter, chocolate, sardines, etc) and attracting a crowd just because of that. My genuine impression of Rehab was no different.\n\nThe decor is junk yard meets a restaurant, but has some recurring themes to it and tries to be badass with the bikes and all. It reminded me a bit of the theme at the Vortex in Atlanta, just not satanic. Stuff like that does not get me excited, but perhaps some people enjoy it. I'll just skip that and go straight to the one darn thing that matters, the food.\n\nOnion Rings were mediocre, but huge. The Fish burger was quite disappointing, the fish itself was tasteless, but the burger was huge. So just picture getting something huge that you aren't really excited about eating. I've had better ingredient quality at airport restaurants. The pretzel bun was kind of cool and the only reason I'd give this spot more than 2 stars. I presume the idea is to eat this thing like an animal, as there was literally no way to fit it in the mouth. I was fine with that. My coworker had one of the beef burgers and was also rather disappointed by the meat quality. If you do come here, I'd suggest doing it more for a beer instead of food. If you want a damn good burger, hit up Relish Bistro at the Phoenician.", "date": "2017-07-24 04:10:03"}, {"review_id": "ACWbLcy86NAH48h3vBb3uQ", "user_id": "TTsVCE6N46eW4xu5rx6KXA", "business_id": "mB3iWJvo7l3ZVwgHpyD78A", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "In the past I have always been very happy with their service but the last few times I find it going downhill. They never call me when my car is done so I have to keep trying to reach them every few hours to find out when I can come by.", "date": "2014-08-05 16:40:09"}, {"review_id": "IY1-e8bFweAvWfZt-01Yaw", "user_id": "qd16czwFUVHICKF7A4qWsQ", "business_id": "SaGyztBfvEHdDbfq8DYMQg", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "The sushi sucks here.  It's expensive and small portions for fishy tasty rolls.\n\nTOtally not worth it.  Don't go there for sushi!  They couldn't even cut the pieces of hamachi consistently.  \n\nThe only thing this place is good for is their hibachi recession special.\n\nIt's pretty good deal and you get a show.  The guys who do the grill\n\nreally put on a show and it was fun.  The food is hibachi same flavor and\n\nsauce whether you go to benihana or here.\n\nI got the steak and shrimp.  The steak was melt in my mouth good and the shrimp was good.\n\nThe scallops were bleh.\n\nMahi Mahi was ok but, I'm a steak eater.  \n\nGo after 8PM for their recession special hibachi.  It's the only thing that worth going for", "date": "2011-03-05 00:39:04"}, {"review_id": "O1Kv8P2HKsYK1W_JcnFt3Q", "user_id": "FZ7fbELJJXS1pELNtQHTwg", "business_id": "STtrEGylaYOXoXQFLP5OAQ", "stars": 3.0, "useful": 3, "funny": 1, "cool": 2, "text": "I had a friend, another Jamaican, with a couple of hours layover in Phoenix so I picked him up and headed to this restaurant as it seemed the closest to the airport. The staff was very friendly and we didn't have to wait too long for service. I have to admit this small establishment was just about on of the fanciest  of the Jamaican restaurants I have visited in north america. This doesn't usually bode well with me because, from my personal experience, the fancier the restaurant, the more they stray from the authenticity of the cuisine by trying to please the american palate.\nWe eschewed the nouvelle cuisine menu items obvious there to please that crowd and  ordered the Escovitch Fish and Jerk Chicken since my favourite \"ox-tail\" was nowhere on the menu and that is the dish most jamaicans use to test the excellence of our restaurants. I guess it doesn't ring well in a fancy place. Anyway, as a Kingstonian, I am used to going to a beach area where they cook up the best escovitch fish, corned with country pepper (habanero) and onions and dripping with grease but just finger licking good. That was not the case here but it was a darn righ better that I could have whipped up in my kitchen at home. I think most americans will probably enjoy it but I will wait until I am back home or at a greasy spoon in Brooklyn or one of the many Florida cities with large jamaican communities. The jerk chicken was also nothing like you would get back home but exotic enough for vacationers to the island needing a bit of nostalgia. The rice and peas was missing something. I am not sure what exactly but suspect it didn't have any coconut milk or not enough. Anyway, I have other jamaican friends who have enjoyed other dishes here so I have not given up yet and plan to return and sample a few other dishes. I have been craving breadfruit, roast or friend so I hope I wont be disappointed.", "date": "2011-03-04 10:17:31"}, {"review_id": "IhvzP97h0am2Bo3v_Uib3g", "user_id": "MCRBroYJz6VVeF88T-tk4g", "business_id": "tXJkGjBkGOZHWAcCmlzS6w", "stars": 3.0, "useful": 3, "funny": 2, "cool": 2, "text": "I'm not very experienced with places to go to for dinner in Little Italy, so I relied on  the ratings of Yelp and other sites. They led me to Valerio's, and I must say that I was very pleased with the food. My dish was tasty and the price was comparable, if not better than, similar restaurants nearby. The rest of the experience was a little lackluster. \n\nThis is a small establishment. I'm talking a total of 12 tables, so you might want to plan ahead. I booked a table a few days in advance via OpenTable. Even on a Sunday evening, it was filled. The ambience is superb. This is a cozy place for a date night or a more upscale dinner. I wouldn't feel comfortable here in anything less than khakis and a button down.  \n\nStarting off, we were seated right as we came in, so they were true to the reservation time. We ordered drinks and were given bread, but it's like they lost track of us for a while from then on.  They eventually swapped our server and another woman took care of us. After about a half hour of sitting with only bread and first round of drinks, they took our food order.  \n\nThe food was phenomenal. Even though they have \"first\" and \"second\" plates, it's not necessary to have one of each.  It's not listed on the menu, but the \"second plate\" came with potatoes and vegetables to my surprise. More food is always better, so I was happy to see that when it came out. Definitely try the chicken and mushrooms. The white cream sauce was far superior than the red sauce of the other dish I tried. I'm salivating just thinking of it again.  \n\nA couple things that detracted from the whole experience...One being that the restroom could use an update. It was cold on a December evening and had the ceiling panels shifted and stained with what looked like water damage. Also, when it came time for the bill, I only received a \"Customer Copy\" which I filled out as I normally would the \"Restaurant's Copy.\" It didn't click with me until afterwards, but I realized this could be dangerous and I continued to check my credit card statement for the charge. It eventually went through with the correct tip I had designated so no harm overall.", "date": "2016-12-12 02:13:34"}, {"review_id": "7sgGcLzWkh8vr9A5NC5gAA", "user_id": "xVeBZdXIsrLvBwHQQVFmtw", "business_id": "hxUxeY8DG9lhyjCVo_s-pw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's just kinda ehh, the beer is kind of bland. It's odd that there's a Plato's closet attached to it. The patio seating is beautiful, inside the brewery is gorgeous as well. Food is kind of mediocre but I would recommend the poutine, it's actually pretty successful. \n\nI had tried one of the light flights and the beers all tasted the same, the chairs are extremely heavy as well.", "date": "2018-05-05 01:00:34"}, {"review_id": "zKoWYbq2VTHvmpNkf2f5Qg", "user_id": "U4INQZOPSUaj8hMjLlZ3KA", "business_id": "Jjwa-WCK73efAwVZRksWSw", "stars": 3.0, "useful": 6, "funny": 3, "cool": 3, "text": "Recently generating some buzz on South Rainbow north of Oakey it was for dinner on Wednesday evening that two guests entered POTs, the owner and one employee immediately emerging from the back as another party followed and explaining the concept as \"Authentic Egyptian Cuisine,\" a novelty to the Las Vegas market despite several other restaurants presenting various dishes originating in the Middle East.\n\nBolstered by good word of mouth since opening in February, owner Iman an affable sort who hangs out in the dining room asking guests their impressions and offering details about POTs' concept, it is from a limited number of dishes featured on an overhead menu that guests make their selections before paying at the counter, prices including $7 Fries and small containers of various Spreads for $8.50 decidedly steep based on Ingredients, though there is no doubt of the kitchen or staff's commitment to serving a quality product.\n\nPleasant in terms of décor, a bookshelf featuring various knick-knacks set next to two couches while steel chairs and light bulbs suspended from rope add to the ambiance, it was shortly after spending nearly $50 including tax and tip that first items arrived, the Egyptian Fries blistering hot and crispy beneath spices including Cumin, Sesame and Mint while fried Sweet Potatoes were served room temperature and more subtly spiced but excellent in housemade Ketchup brightened by Citrus.\n\nOffering no Meat on the menu, most items either naturally Vegan or possible to prepare as such, it was while eating Fries and sipping a thin Shake with mild sweetness that two Pitas arrived next, one called Taamia and described as Egyptian Falafel well prepared but marred in its flavor by too much Mint while Cauliflower \"Shawarma\" fared better in terms of taste with an even lighter and virtually oilless texture.\n\nFinally served Dessert prior to finishing Pitas, a minor issue only since one included Ice Cream, it was here that POTs suggestion of \"by mixing the familiar with the unfamiliar, we produce a taste like NO Other\" rang most truthful, a dish called Mahlabeya offering the texture of Panna Cotta beneath Apricot Jello studded in dried Fruits while the Brownies were much like many similar Sundaes except that the Chocolate contained salty Tahini and bits of melted Halwa which rendered it sticky and sweeter in parts, much like Salty Caramel but without the Butter or Milk thus making for one delicious Vegan treat.\n\nTHREE AND A HALF STARS:  Unquestionably a niche Restaurant, fast-casual concepts featuring healthier options a continuing trend that should be embraced, POTs adds something new to The Valley and does so with honesty and passion, but considering the simplicity of their Ingredients prices trend a little higher than need be while such a brief menu does little to demand return visits save for those with specific dietary needs.", "date": "2018-06-30 12:17:02"}, {"review_id": "bqo_qrIfhktBQn3riaGB_g", "user_id": "SP6GSx5TNVuY48Z-gi8VqA", "business_id": "JyxHvtj-syke7m9rbza7mA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time with a friend for lunch. The food was good, however the service was extremely slow. Also I was shocked when the server notified me they were unable to make a cucumber salad because they had no more cucumbers. A bit odd for a sushi restaurant especially when cucumbers are incorporated in multiple different types of rolls. Personally I will not return.", "date": "2018-02-18 05:48:27"}, {"review_id": "2W4_7003xPkUwXkGvxqV7w", "user_id": "KVShxUV_XFuoF30ttAeoNw", "business_id": "eSENXDnnNSo-MLLkWJQ8Vg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "Petty expensive for ordinary street tacos. Our server was friendly, but service was slow and disorganized.  Half of the many salsas at the bar were empty. Not a well run operation. Food had good flavor, but for the price I am sure there are better options. Will not be back.", "date": "2016-02-17 00:41:57"}, {"review_id": "ivJm8Bu2v8aR8Exhtmgj4w", "user_id": "eAJ3Ip0vh-zuk_BmcmchYA", "business_id": "JQOmOqfoJgNOdFDQrBRmBw", "stars": 3.0, "useful": 10, "funny": 5, "cool": 5, "text": "If you're in a time bind, this restaurant seems to achieve getting your pho out quickly and with great taste. There's a lot of flavor in their broth and they make it so easy to add Sriracha, hoisin sauce, and chili sauce to your heart's content!\n\nI love how some other customers compare this restaurant to Saigon Kitchen. It's different. This place specializes entirely in pho so of course that's what the focus is. They keep their menu simple. Did you want chicken, beef, or shrimp? Those are your main choices with the pho here. (Saigon is upscale and trying to provide a different \"spin\" on traditional Vietnamese food in general, not just pho. They offer salmon belly pho, and pho with tendon, tripe and Vietnamese meatballs which are more southern Vietnamese fare. Plus they offer other dishes like Pork Banh Mi or non traditional \"Shaken beef.\") \n\nSometimes, I just want pho, and now that I know I can come here for a quick and easy lunch with great food, this will be one of my regular stops. Sure I wish there were some more unique pho offerings like tripe or those Viet meatballs but why add it if it's not as popular with their main audience? \n\nI ordered the mini beef pho combo #3. You order at the counter and they cart you your food. I didn't realize my combo came with a shrimp spring roll and two egg rolls and some greens. They don't mess around with portions. For $10, you can get pretty full but not uncomfortably. It's \"just right.\" I might try the shrimp one next time!\n\nIt's a pretty tight squeeze in this place unless you sit in a booth. It's not like we planned on spending hours where anyway so it really didn't matter. Come check this place out!", "date": "2016-11-29 03:03:55"}, {"review_id": "uV0lmSvT1wVZ7NVaZAfvJg", "user_id": "cPd5M0RSDmHxrqf_WYPi4A", "business_id": "i1Xkm22_96GNVVOXSUoL0A", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I found The Captain's Boil on Instagram and thought they offered an interesting and different concept. It was quite the experience and it was lots of fun to eat with your hands and manage the gloves and the bib and the slippery beer bottle.\n\nMy boyfriend and I tried the shrimp in Cajun sauce and the mussels in garlic sauce. The thing is, you have to tackle a pound of a very distinct and powerful flavour, I got a bit tired at the end. The fries helped, but then, it was Cajun fries so in the end everything tasted Cajun, and after a while the heat gets to you (or at least it did to me).\n\nThe experience was very cool, and the food was just OK. I think I'm fine with doing this just once. But yea, I would recommend people to try it.\n\nWe had to wait for maybe half an hour to get seated, but I had heard worse so we were mentally prepared for that.", "date": "2016-01-22 17:11:40"}, {"review_id": "DACpJ8HWUQ0XCPwYnvW1uQ", "user_id": "dmF_RNlXyiY5KhsaBVvScQ", "business_id": "p3qjmdZZFEMOTWJjmdTa3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I would say this is a good place to check out at least once, just for the novelty of it.  Yes, it's a unique take on ice cream and it's interesting to watch how they make it but I don't see myself going back anytime soon...partly because of the wait time but also because taste-wise I didn't find it to be anything special.  It's not bad by any means but I'd rather go next door to kekou for gelato :p\n\nWe tried the peppermint oreo and coffee flavours.  Both were good, no complaints.  The peppermint oreo had a creamier texture than the coffee, which was less milky tasting and more icy..if that makes sense.  I'd recommend the peppermint oreo if you're a fan of mint choco chip ice cream. \n\nAll the girls working there were super friendly.  It can't be easy making those ice cream rolls all day so kudos to them!  I definitely think they could improve their assembly process and tweak their layout to speed things up a bit (e.g. have one person designated to do the toppings as opposed to having the rollers do both jobs; better use of space underneath counters - maybe an extra refrigeration unit for ice cream bases for quicker access, etc.)  \nGiven that they're still a very new business, I'm sure they'll streamline everything once they work out the kinks.", "date": "2016-06-06 03:04:31"}, {"review_id": "Q-dsAZaQnoRJchwax0aSEw", "user_id": "Tbtwg1yUebLGln06qmXcgA", "business_id": "KBNksbA7qyFPoLO-GPmYmA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "12/22 Purchased a gift for my daughter. Service was ok; I probably would have spent more but I had an Order Taker not a Jewery Specialist.", "date": "2016-12-25 10:29:29"}, {"review_id": "gQjvdh9OrsOMpSwjxA3aTw", "user_id": "lZIf54sn5mTH1zUTmiTRYw", "business_id": "tSzIHI6ioblP1WEQAQNbhw", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I have mixed feelings for this restaurant. \n\nThe first time I went there the service was terrible, the waitress was more concerned with talking to the cooks than getting my order filled in a timely manner. If they were able more busy at that moment I wouldn't mind as much, but at the time I was the ONLY one there. \n\nThe second time, there were two waitresses and a little bit more people, however the girls were still too busy with gossiping in the corner, but they were more effective with the service, I guess it helped I was sitting at the actual sushi bar that time. \n\nThe sushi itself is mediocre at best, I just moved to Madison and have a little pet project to try all the sushi restaurants in town to try to find my favorite. \n\nFrom my experience a Boston Roll consists of shrimp, avocado, and mayo. Their's apparently is just salmon and avocado. The only thing I found close was the Hidden Tiger Roll on their daily special roll that had eel in it. Reading through their menu it all seemed very plain and not following any of the recipe for the \"traditional\" rolls I've seen at other sushi restaurants. Also, the taste of the rolls themselves are rather bland.", "date": "2013-05-18 01:21:04"}, {"review_id": "9huuGYqtUgxkFFD4HupnAg", "user_id": "5HmK6riLkciM0Xxo1ycNTg", "business_id": "6t98--hqg8suYkm_37re8w", "stars": 3.0, "useful": 2, "funny": 0, "cool": 3, "text": "I really wanted to like this place, so I feel bad I can't give it more stars. Honestly, 3 is a stretch, but I so badly want this place to be good that I might even give it another try. I was introduced to their food at the Devour food festival this year. Their kimchee tostada and ramen broth was on point, so I had high expectations coming here. Sadly, it didn't make the mark. Maybe it's wishful thinking, but I'm guessing the place was just having a bad night. First round of drinks came out quickly, but once the place filled up, service got shaky. We waited for a pretty long time and when food came out, we were served way before our friends' plates arrived.\n\nIt wasn't all bad, my bonal negroni was perfect- nicely balanced with a big ice cube (which I love).\n\nThe dump truck salad was a nice mix of veggies and tepary beans (which you never see on menus- nice touch!). Unfortunately, the soy-citrus salad was lacking both soy and citrus flavoring. It just tasted like the salad was tossed in oil. \n\nWe ordered the mushroom lettuce wraps, but were given the pork belly instead. The waiter apologized and eventually brought us the right order. The slices of mushroom were covered in a very thick soy glaze. The sunamono salad was good, but there wasn't much of it. The lettuce we were meant to wrap it in was actually gross- brown on the edges and wilted- the kind I would throw straight into the compost pile at home. Fail.\n\nWe ordered the tantanmen ramen bowl The fried tofu balls, which we ordered to replace the ground pork was the best part. It came with a few mustard greens and bamboo shoots. The promised soft egg was missing- boo. I did not like the flavor of the broth and didn't want more than one bite. This is definitely not the same broth they served at the food festival.\n\nI would have given up on this place completely, despite the fab cocktail, but our server made me want to rethink that decision. After my girlfriend (who weirdly loves the color yellow, dogs, and North Korea) commented how much she loved the poster of Kim Jong-un hanging in the bathroom, he gave her one. Super nice gesture... and it was a a cool poster.\n\nWould definitely return for a negroni on the patio, but not sure on the food.", "date": "2017-04-01 16:21:12"}, {"review_id": "oPkKMdYDO9J8ZYH0EiLxDA", "user_id": "RcYS7nH-LQBCJ0bloyWk_g", "business_id": "BBFg2FmyimjiR27jO0dpQg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food is good and reasonable priced but the cashiers have no personality and can't take orders. We have eaten here twice. First experience go to counter to order no greeting from cashier and added chicken nuggets to meal that we never received. Second experience ask for order to go got home and see they forgot an order of fries we placed. Called to let them know and they stated I never ordered them. Clearly we know what we ordered.", "date": "2016-07-09 01:49:22"}, {"review_id": "uYO7TlAblpoHkRBvObBC-A", "user_id": "BOijsp9rwVGS4ScmOMf9bg", "business_id": "RXESkOgqAYGoujYTqy2KNg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was definitely an interesting place.  When I first walked in I walked in on the bar side (entrance) but the coffee portion had its own entrance or you can walk through the back.  \n\nIt reminded me of an old school English bar that was repurposed with a lot more small tables and surprisingly loud given that there was me a lot of talk.  \n\nIt was very casual, latte was decent.  Everyone has their jackets on inside sitting and working or reading--a bit chilly but otherwise a great place to work on something.", "date": "2016-10-21 12:46:33"}, {"review_id": "QX6EiXKzPn5BIgsEu-zqdA", "user_id": "G-6X-llgA_qAxGxocykHzQ", "business_id": "zA6gnF5aPBGoOm6uIbKt-A", "stars": 3.0, "useful": 4, "funny": 0, "cool": 1, "text": "** Review for Summerlicious Dinner 2017 **\n\nThis is the first time Yuzu No Hana offered a Summerlicious menu so me and a group of friends decided to give it a try. Unfortunately, despite the great taste and delightful presentation, we were left hungry after our $28 3-course dinner.\n\nEnvironment:\nThe restaurant is steps away from the King/University St. Andrew subway station, really convenient spot. The restaurant is divided into 3 floors, with the most bottom floor being the washroom, the 2nd floor the main dining spot, and top floor the private party room, which our party got to use because there were about 20 of us. \nThe private party room is really nice and since it's the only dining area on the top floor, you can enjoy a quiet meal without disturbance from the guests. However, I'm not sure if there is any elevator for those who have trouble climbing the stairs. \n\nFood: \nI got the Tuna Tartare for appetizer, Sushi Platter for main, and the Matcha Tiramisu for dessert. \nTuna Tartare tasted pretty good, I liked the miso/soya sauce that they used and it wasn't overly salty, but the portion was a lot smaller if you were to pay full price for the regular dish. \nSushi Platter contained 13 pieces of Nigiri Sushi, and they were made the traditional style with wasabi in between the rice and the fish. The fish tasted fresh, no watery/soggy texture, but not exactly enough for dinner. \nMatcha Tiramisu was also very small. It wasn't like your typical tiramisu in the sense contained no coffee liquor, and the cream was made with matcha flavour. I liked it, but I also wished that we had more of it. \n\nService:\nOur servers were professional at accommodating our big group and they got all our food correct. They mostly left us alone while we ate each course and would come by to pick up the dishes before the next course was served. \n\nOverall, I found that the food just wasn't enough for dinner, so we basically had to go grab some cheap eats after, which was unfortunate, considering $28 before tax and the 18% gratuity wasn't exactly cheap for dinner.", "date": "2017-08-01 19:03:11"}, {"review_id": "_hZ2n0X2Wk0vQLkSwyANtw", "user_id": "dOFyIGbyfB69VB4pnoKqQA", "business_id": "9uS0tzGl3Vw4WYVooQ73AQ", "stars": 3.0, "useful": 3, "funny": 1, "cool": 2, "text": "This is where I get all my prescriptions filled. They do get busy and I've had to wait in line for more than 10 minutes a few times. I try to go when I don't think they'll be too busy so usually after 8 pm. The pharmacy staff is always nice. They do have a drive-thru which I've never used and I've always wondered if going though the drive-thru would be faster than going inside and waiting in line.\n\nI honestly don't buy any of my toiletry items from here as I think their prices are higher than Walmart.", "date": "2012-08-29 05:18:06"}, {"review_id": "FOMZkYSE7T2nS1y_tpm1qg", "user_id": "bFl0Cg7anF3yVN6dcX2Tbw", "business_id": "KwKkNTxYGyo4H6pKZ6usSA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The bookshelf pegs arrived a little over a week after the bookshelf did, and the deliveryman installed the shelves for me. Later, a team of two guys attached a mirror to my dresser that I originally wanted to keep separate, but later changed my mind. I'm not sure why they sent out two separate parties to complete two small tasks on the same day, but whatever, it got done. It was a little confusing because one party called me to confirm a time and the other party called my dad, although I had been scheduling and accepting all deliveries. Not a problem, though.\n\nAfter everything was settled, I received a handwritten thank-you note in the mail from one of the two salespeople we worked with. Overall, the organization is not great, but the furniture and associates are high quality.", "date": "2009-09-04 02:20:50"}, {"review_id": "AYWnwHAax9wH8DKW8MCWaQ", "user_id": "gvuvcjAVl1ElyXTgU80VRg", "business_id": "T-wer_1iIXs692gYrTriDg", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "After hearing so much about the korean taco truck in LA i was so excited to find out that we had one in Las Vegas.  I was around the neighborhood running errands and decided to check this place out since I live on the other side of the town.  \n\nIt was literally 112 outside and thank god there was no line.  I tried the beef, tofu and egg tacos and also ordered their \"not so fries\".  I gota say one thing, they are definitely different tacos.  I couldn't get a strong grasp on whether I truly liked them or not.  The Korean type slaw they threw on top of the tacos were a bit sweet and had a strange taste to it.  The tortillas like everyone else said were flour and not as hot and soft as they should be.  The fries were tasty but also a bit on the salty side.  \n\nOverall, its a cool place to try out but I probably wont be coming back here for a while since it didn't blow my mind.  I was probably too excited on the idea and then the food let me down a bit.", "date": "2010-07-25 09:44:02"}, {"review_id": "KjRjE75GBU_a1THxngjIww", "user_id": "Erw46-4d-QIzmj1ULQE0YA", "business_id": "T-1A_7-XHCv8XDXaMIlefA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food here is overall decent and fast. Pho or bun or the rice dishes are all solid picks. Food comes out fast and the servers are quick and efficient. Pricing is about average. Good choice if you are in the Vaughan Mills area.", "date": "2015-05-20 23:20:57"}]