[{"review_id": "M7kxoRDnbGdGmPmmGmGnog", "user_id": "LdYJlllsD2fPkBhycioj3Q", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 5.0, "useful": 6, "funny": 0, "cool": 2, "text": "XS IS SERIOUSLLLLYYY MY FAVORITE CLUB IN VEGAS SO FAR!! :D\n\nEvery time I make a Vegas trip, I always have to save a day for XS :D.\n\nFirst time in Vegas: XS, Sunday night, David Guetta was performing\nMy 3 girlfriends and I were on the guest list so we went into a separate line (I always feel like such a princess when I'm in Vegas haha!) Once we got into the club, I was so amazed with everything! We sat down and guys were already approaching us with cranberry volka and red bull volka. Yummmm! I'm not going to lie, but that stripper pole is amazing!! Especially because it got really crowded that night because it was the Sunday of labor day weekend. It was so crowded that I was not able to walk anywhere so my friends and I danced at the stripper pole area. These guys approached us to join their VIP table and of course we said yes. :). I had an amazing time! XS always treats me right!\n\nSecond time in Vegas: Friday night, April 5th, 2013. David Guetta was also performing.\nIt was a lot less crowded this time. I was able to get onto the dance floor to see David Guetta up close! It was a wonderful experience. :). \n\nWhat I really like about XS is the pool area. I love how they open the pool so we can soak our feet in it. Come on girls! Being able to take off your heels and soaking them in water feels so good! \n\nXS usually only have an all girls guest list, so make sure your guy friends buy presale tickets to skip the crazy long line! \n\nOh XS also gives girls on the guest list a free complimentary drink! :D", "date": "2013-04-20 07:00:51"}, {"review_id": "cdZ3dIPvKoQ6qcKCkAPGUA", "user_id": "USG1wkzku03asNV8TQZetw", "business_id": "Wg4jlAgOUB51aX1c3ex9GQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "When I walked in, I saw many tables were occupied, including sushi bar. This is a good sign. We were offered to the table on the patio. Luckily the weather was already cooled off at night.\n\nThe service is nice and the food came out very fast even though the restaurant was packed.\n\nI love their pork Katsu curry. The rice is perfectly cooked. The pork Katsu is perfectly deep fried and has great texture. The curry is the best one I ever have. It is simple but complex in flavor. The pickle helps put all the flavor together.\n\nWe ordered some nigiri and rolls. The scallop nigiri is so good. The scallop is firm and dry. It is hard to find other place that can prepare the scallop like this. Thumb up!\n\nThe plum and shiso roll is interesting. It is tasty and refreshing. The tsubugai shellfish nigiri is also good. It is so crunchy good.\n\nWe were full so we got matcha marron cake to go. The tiny cake with red bean, cream, and match cream on top is so delicious.\n\nI like their indoor water fountain, and they have many Tanuki in different size around the restaurant.", "date": "2018-10-02 19:56:17"}, {"review_id": "FtmVAUnuQmmq9Zcz31NptA", "user_id": "r_DOwFXtp1IVVcUXwKxn4w", "business_id": "ppHkkuDvvH8g1Enz6F8OJA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is by far the best breakfast place around!\n\nThis a smaller restaurant where you seat yourself at a variety of home style tables and are greeted by ever-changing paintings on the wall created by a local artist. The waitstaff here are young, as described in other posts, but we have always found them to be hard at work, always asking us what we need, making sure to get us our drinks quickly, and greeting customers as they come in. They even get to know their customers, and know regular drink and food orders. \n\nAs for the food - well it is EXCELLENT! Now, I have only had breakfast here, but I have never had a bad meal. The home fries are Amazing, and are not full of grease or salt like you might get from larger chains. Everything is cooked fresh to order so most meals can be adjusted to your needs and since there are so many choices you can really create your own meal beyond what their menu has. The food also comes out super quick, considering there's only one or two cooks at a time, and everything is always delicious. \n\nMy husband and I go here at least once a month, and we will continue to frequent this little shop as long as we live in Vegas. Some personal food recommendations - The Bacon sandwich is a go to for us, and if you want something to satisfy your sweet tooth, definitely opt in for their whipped cream on your pancakes as it is rich and creamy and very yummy. \n\nThis restaurant is worthy of its 5-star rating from me!", "date": "2017-07-03 23:18:56"}]