[{"review_id": "qcX6wg-vdwWak9kNmV36-g", "user_id": "1ztYFOERtalhfTDwg5xjxg", "business_id": "kCatAFdvOhpdeV5UZK-7Fw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Stayed from 1/7/2012 to 1/15/2012 (not the first time, & not by my choice - it was business and it was closest to the Convention Center). NEVER AGAIN.\n\nFirst morning, standing in ankle deep water in the shower stall (my first stay here back in 2006 this happened EVERY OTHER DAY). Grout in the shower stall was over abundant with mold, and NEVER cleaned.\nThe toilet handle had to be held down for more than five seconds to flush correctly.\nNow, I am somewhat hairy (not as hairy as a Bigfoot, but it does come off in the shower), and for four out of the eight days, I found my own hair on the floor and walls of the shower stall. So much for a daily cleaning. At least five out of seven days, my room wasn't cleaned until nearly five o'clock....\n\nKeep in mind that I SUPPOSEDLY had VIP status (we booked a block of 10 rooms, and they dropped half the bill on my AMEX card).\n\nOn the first morning of the convention, I noticed that my iron was missing, so I called the front desk for a replacement. After an hour of waiting for it to arrive, I had to leave or I would have missed the opening of our booth (we were exhibiting at CES). So I show up in a wrinkled shirt my first day. I was NOT happy.\n\nMany more problems occured that also appeared in 2006, and I will not even go into the fact that they ended up being paid for a room twice for five out of eight days (not my room, or money, so...).\n\nNEEDLESS TO SAY, I WILL NEVER STAY AT THIS HOTEL AGAIN, AND I WILL NOT RECOMMEND THIS TO ANYONE COMING TO VEGAS.\n\nAND THEY STOLE THE CHANGE I HAD BEEN BUILDING UP FOR FIVE DAYS!\nI do understand that most hotels look at money left on the desk as a \"tip\", but the better hotels have envelopes for tips, and also have more honest employees!\n\nWhy did they wait until my last night to seal from me? I guess that laptop was too big to hide, huh?", "date": "2012-01-18 23:55:02"}]