[{"review_id": "KXjJIh9tymLNT0LISpYElQ", "user_id": "JaZsPYHY8t6t67l9_AQwlQ", "business_id": "XpnkPS-56dYTdjwC8RRLuw", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "Came for lunch. Service was horrible. It took thirty minutes for a salad and half of a sandwich. And they didn't even get the food right.", "date": "2017-10-16 19:52:38"}, {"review_id": "qcX6wg-vdwWak9kNmV36-g", "user_id": "1ztYFOERtalhfTDwg5xjxg", "business_id": "kCatAFdvOhpdeV5UZK-7Fw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Stayed from 1/7/2012 to 1/15/2012 (not the first time, & not by my choice - it was business and it was closest to the Convention Center). NEVER AGAIN.\n\nFirst morning, standing in ankle deep water in the shower stall (my first stay here back in 2006 this happened EVERY OTHER DAY). Grout in the shower stall was over abundant with mold, and NEVER cleaned.\nThe toilet handle had to be held down for more than five seconds to flush correctly.\nNow, I am somewhat hairy (not as hairy as a Bigfoot, but it does come off in the shower), and for four out of the eight days, I found my own hair on the floor and walls of the shower stall. So much for a daily cleaning. At least five out of seven days, my room wasn't cleaned until nearly five o'clock....\n\nKeep in mind that I SUPPOSEDLY had VIP status (we booked a block of 10 rooms, and they dropped half the bill on my AMEX card).\n\nOn the first morning of the convention, I noticed that my iron was missing, so I called the front desk for a replacement. After an hour of waiting for it to arrive, I had to leave or I would have missed the opening of our booth (we were exhibiting at CES). So I show up in a wrinkled shirt my first day. I was NOT happy.\n\nMany more problems occured that also appeared in 2006, and I will not even go into the fact that they ended up being paid for a room twice for five out of eight days (not my room, or money, so...).\n\nNEEDLESS TO SAY, I WILL NEVER STAY AT THIS HOTEL AGAIN, AND I WILL NOT RECOMMEND THIS TO ANYONE COMING TO VEGAS.\n\nAND THEY STOLE THE CHANGE I HAD BEEN BUILDING UP FOR FIVE DAYS!\nI do understand that most hotels look at money left on the desk as a \"tip\", but the better hotels have envelopes for tips, and also have more honest employees!\n\nWhy did they wait until my last night to seal from me? I guess that laptop was too big to hide, huh?", "date": "2012-01-18 23:55:02"}, {"review_id": "tDgdgGw0H3Gscvyd2V5vGw", "user_id": "8FOUAEfQrGdIlggmURL1Bw", "business_id": "_6Brh4UGrsnakkBKT1H_Qw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "6 of us went there before the Browns game to check out the east bank of the flats. We got there before the rush so one would think food and drinks would be easy to come by. Our first round came pretty quickly (highly recommend the sweet baby Jesus) but it stopped after that. For being there two hours we managed to get two drinks a piece, took over an out to get a stuffed pretzel and some dip and never got our sandwiches. We ended up canceling our food orders and settling for some overpriced stadium dogs. I truly think our server hated his job and didn't give two s&@\": about his tables. I only say this because the three tables around us came after us, got all their food and left. I'll give this place a chance again because I liked the atmosphere but the service was horrible!!", "date": "2015-11-02 12:38:53"}, {"review_id": "6ZpRHPAPoaB4qShzMesZOA", "user_id": "6xFDdAyVNWgoglBZZvAOCg", "business_id": "ADhhGFi5ojSQS2uxMWOA_Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Got my nails done on Saturday,  three days later they are already chipping. Gel mani!!!!  Poor quality products and not very experienced stuff.", "date": "2016-12-01 00:25:26"}, {"review_id": "B8FskbcnxMaW6hHm6dpWsg", "user_id": "e5O_lm2Mov6kHOka8wgvOA", "business_id": "caGXS6ubNTlv91ZZyoirjQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 2, "text": "All I heard when I first moved to Pittsburgh is how GREAT Primanti brothers is. Well I have eaten and two locations and they have the worst sandwiches I have eaten. EVER!\nWhile no one can deny that french fries on a sandwich is awesome, I think we can all agree that the stale non-toasted bread and runny coleslaw make this sandwich taste like I am eating ass. \nPrimanti brothers is a Pittsburgh staple, and Pittsburghers love \"their\" stuff, but  this is one place they should let die out.", "date": "2008-10-12 19:18:53"}, {"review_id": "GNcXxs0UTqozlvAjhlsARg", "user_id": "4qyy_D9QSrRcGIrUekjXBw", "business_id": "ztCmuPxfKf3_L3QjUCYMHQ", "stars": 1.0, "useful": 5, "funny": 2, "cool": 0, "text": "Ford AUTONATION is TERRIBLE!  How is it reasonable to charge a LONG one customer for a \"hole\" in a cars computer code??  Our vehicle has a remote start, unfortunately the remote start malfunctioned- leaving my husband stranded in Phoenix for a few hours.  Not only did it take 4 days to get his vehicle back, the technician then explained there was a computer programming error that Ford was not aware of....  Until NOW.  It's not the $300 we spent to have it reprogrammed, it's the fact that Ford now knows what the error is and will be prepared when this happens to the next customer.\nI have always been a strong supporter of Ford, but seeing the lack of regard for their customers time and inconvenience, we will look elsewhere when purchasing our next new vehicle next month.  \nLastly, when the car was in the service center, it was returned to us with a different iPhone cord.  Now we have a broken cord and what appears to be a poorly manufactured car.  I hope this saves someone some trouble in the future.\nUPDATE: 6/12/17- My husband spoke with the manager, who initially offered to assist due to a previous message that was sent...  The \"manager\" offered NO help, just your typical \"it is what it is\" response.  No courtesy for LONGTIME customers?  Why would we stay loyal to Ford with service like this?  Might have a great product, but with no customer service, we will be shopping elsewhere for our next vehicle (scheduled for August 2017- great job AUTONATION Ford of Scottsdale).", "date": "2017-06-13 03:25:38"}, {"review_id": "NPC2Y_O60o5j741lAUKIYg", "user_id": "lRGZOg5fsvrALY6XhIi0ew", "business_id": "WOrI7MlX3CgEVk98y7Gnug", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Einstein botched a catering order for me badly.  I left with nothing close to what I was ordered and I was still charged for the full amount two weeks later.  They left me late for a business meeting and they are far from reliable.  I have called twice now and still have no resolution.  Their online ordering is a scam!!!!!  Be careful.", "date": "2016-09-22 19:19:01"}, {"review_id": "6S2koCaQbF1lAsDm2KVDRQ", "user_id": "VC-6vVCks_31CFRCQVTCxA", "business_id": "eaouKYDPD6EfzVedMIK1jw", "stars": 1.0, "useful": 3, "funny": 1, "cool": 1, "text": "If a Home Warranty company assigns All Desert Appliance for a service call request another company to come out. They are in the business of collecting service fee . Use anyone else you will end up frustrated and out your service fee,", "date": "2017-03-10 20:33:48"}, {"review_id": "fFtJX7De0OZBwWtwauWjzg", "user_id": "ibeb2OxOucjw8hYzTIQFIw", "business_id": "Ki9N8VBWvEs3FOpAjeNWFA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was not impressed at all this food is overpriced and it's not very good.  I won't be going back it was a huge letdown for me.", "date": "2016-04-30 22:55:42"}, {"review_id": "zprcRQ1I-1JQzbCiGhhHAQ", "user_id": "cyHNYS0QlUMpJjr17zyWfw", "business_id": "B2sXObmKYlksY-S8B_j7vQ", "stars": 1.0, "useful": 3, "funny": 1, "cool": 0, "text": "As a former outbound sales agent, this company is nearing scam territory.  All of my leads were years old and when the team wasn't able to produce, we were all laid off.\n\nOr was that due to the point I made an HR claim of sexual harassment a few weeks earlier...we'll never know.  Very poorly ran company with zero regard for employee security.  Don't be fooled.  The long time employees are running the show.  No one is moving up in this small office.", "date": "2017-12-11 21:29:32"}, {"review_id": "brH0f7H0WrMsdF9AWDTZKw", "user_id": "6UwwPxkdYWEZe11f1csNxA", "business_id": "1PFj0yJ0EzwQXIOsIT2y3w", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I've been here quite a few times and there's always bee one problem but this was horrendous.\n\nWaited 30 min for my drink to arrive.  The food actually came out first.  I asked about it,  they then brought two, one had alcohol in it and one didn't.   Menu say \"1.00 off all drafts.\" They didn't tell us until they brought the bill that Guinness and Stella were not included.  What part of all means there are exclusions.  Horrendous service.\n\nThis was just my experience as I was with several other and everyone had an issue", "date": "2018-04-21 18:24:10"}, {"review_id": "F28hupyLk3xU0lX--yljDQ", "user_id": "vxqUWyf5W-hgHs1N3GtE3w", "business_id": "tj1IM_2-ks08bk0JZP95DQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "It is FunkFest weekend and we all wanted something to eat different from the normal Waffle House. We tried this place since we are from out of town. This was the worst experience with food that I have ever had. We had to seat ourselves which was no problem but the waitstaff just walked by us. It was about 3 people on the staff that walked by until my friend got up to talk to someone. When she went to talk to someone that acted like she was bothering them but they would be over. She asked again and then an extremely apologetic young lady (Riana) came to take our order. Tyler a tall gentleman with a buzz cut and a long haired young lady Lauren were asked why they didn't help me and they just shrugged Riana off. These 2 people were extremely rude and off of that I would not back. Riana was the best under the circumstances since these 2 wait stay were not helping her with tables at all. Late night this is not the place for you. This place left a bad taste in my mouth and we have one at home and I am not sure about trying that one", "date": "2017-08-13 11:36:14"}, {"review_id": "ZtsaXIpmrwD6aXpNTBBIxQ", "user_id": "qkQGYZIS2BEHI2YnuUV03w", "business_id": "bPcqucuuClxYrIM8xWoArg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was pretty good but I was totally put off when they charged $12.95 for a kids plain cheese pizza! It was the most expensive item on our receipt. I wish the waiter would have given us a heads up. Left feeling cheated. I would not come back.", "date": "2014-07-05 20:33:26"}, {"review_id": "Ya-0gxswwRAnK3nASbVm-w", "user_id": "DpAk34vPISjIGYlBUyAdPw", "business_id": "LrxDRg8SQdgHMoz3TSAYFg", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "The customer service is absolutely horrendous. They don't acknowledge you as you enter and the food isn't all that. The owners of the restaurant are really rude. They also own that Asian Market on Rainbow as well. They need to be closed down. I'd rather drive the extra mile to get tastier food and better customer service.", "date": "2015-06-27 00:11:59"}, {"review_id": "_kQaq37NofD0cSwvnBulAw", "user_id": "Z4a9QmzKt7dB4Ju59yQOMA", "business_id": "1SE9f6TEV5XhnTuuK01xwA", "stars": 1.0, "useful": 3, "funny": 1, "cool": 1, "text": "I will never go to this location again! \n\nIt was my boyfriend's birthday so I decided to surprise him with his favorite Wing Stop. Because I wanted to get home early I ordered online so I wouldn't have to wait that long.\n\nI waited for about 10 minutes and thought I would grab a bottled IBC root beer. The cashier did not know how to ring it up so he had to call over another staff. I saw them stare at the register and finally rang up a root beer for 3.75. He ws really rude and had no idea what he was doing. \n\nI guess I have to go to Trop for wings!", "date": "2016-10-20 18:53:56"}, {"review_id": "2FQz4cnPsT05tPl0CKjSmw", "user_id": "5Kz8qinhMCV7ihuVaI6RzA", "business_id": "3l54GTr8-E3XPbIxnF_sAA", "stars": 1.0, "useful": 1, "funny": 1, "cool": 1, "text": "Good burgers but rude service. Overall not very responsive and didn't seem to want to serve our table because we were here with a big group.", "date": "2016-09-24 03:22:47"}, {"review_id": "vayaLYkFQC29aeeo84LpiQ", "user_id": "Rj_fgyUUVFltBKSXs6hIyQ", "business_id": "qcTCKAJEG7hideQ56I-vAg", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Where do I start. Do your research on these folks. I have lived in Hidden Canyon Village 3940 Scott Robinson Blvd, for over 3 years with no issues. I pay my rent, maintain my apartment, and keep a very low profile. The staff is rude and can never give you a direct answer. They take their time with repairs; you have to make at least 3 request before it actually gets done. In June they put a note on my door stating that my January rent was short by $450.  Right, WTH. Mind you, anytime you are short or late they absolutely will not accept a partial payment; Under no circumstances. I have never had any issues paying my rent and do not why they waited 5 months to notify me they lost my payment and now telling me I need to put a trace on the money order. CourtHouse here I come.", "date": "2017-10-09 19:23:59"}, {"review_id": "NNwldRkkqssaZq0xyy0rWg", "user_id": "US4ZURMdkiK9_7P5JGlSFA", "business_id": "1i1RPmTmwQmSmv2Pua0s3A", "stars": 1.0, "useful": 13, "funny": 3, "cool": 0, "text": "STAY AWAY!\nI went with my wife to discuss the use of bioidenticals for perimenopausal symptoms. We let him know up front that we were on a budget and he does not accept insurance. $400 for the 1st visit, along with a few bottles of herbs and a small bottle of bioidenticals along with a lab slip for tests. End total was over $500. (So much for a budget).  The follow up appt was $200, and a prescription for more bioidenticals. The instructions were to \"listen\" to your body to see how much you need. Ok, 50mg? 500mg?  Take with her period, stop?  There are 5 rights a patient has when it comes to medications and the physician is there to oversee this. All we received was muscle testing. We were told twice (once on two separate occasions) that buying the bioidenticals directly from their office was cheaper than going to a compounding pharmacy. (Still no actual prescribing guidelines).  When I picked up the bottles, (another 200+) there was a compounding label on the bottle. I called the pharmacy for a price quote and was HALF of what we were charged. Also, it appears all the positive comments are made from his wife. She really shouldn't use her initials for a log in. Total scam operation. Went to Valhalla office instead. Receiving comprehensive care for MUCH less with actual supervision and endpoint, not an endless money cycle. Don't make the same mistake we did. This shattered our trust we were hoping for going to a physician that supposedly specializes in complimentary medicine.  Looking into filing complaint with the Nevada medical board.", "date": "2014-04-09 05:21:33"}, {"review_id": "v48uSmxpGcUX_iyxSOGipQ", "user_id": "bmodzaYpm87_7G18DA1X1A", "business_id": "QpPyuxHVVJ6BtXd-FoCjgw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Worst show ever.  It is so FAKE .   They call 29 volunteers to by hypnotized but about 7 of them are their staff.  Then after some bs they asked thirteen real ones to leave and only the 7 fake ones to be 'controlled' by the hypnosis host. And then they do silly acts that is all pre planned so stupid", "date": "2015-12-30 00:21:31"}, {"review_id": "1hlwwQUGC6TTZw0z9LhqFw", "user_id": "NgwfRzl4g4Owj28eUiDRuQ", "business_id": "qkyCuFJF2Uboh6n2Lmuwlg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Worst bahn mi I've ever had! So much grizzle, I had to take all the meat out. So much mayo I couldn't even enjoy the veggies. Yuck! And all the while, they were mopping the floor around me. Overall a very unpleasant experience.", "date": "2017-02-05 14:28:48"}, {"review_id": "fd3jI1I9v6sm0TzbLi9nUQ", "user_id": "cxXhMx6EgjlYdS7R_Br_zg", "business_id": "E3Jl6fjOj6FKio9pV2f-dA", "stars": 1.0, "useful": 4, "funny": 0, "cool": 0, "text": "After several years of being hounded for feces tests during vacinations (and declining my cat was fine) I came to need blood tests for medication. Once diagnosed the vet clinic insisted we have blood tests every 6 months otherwise they would withold the medication. 200 bucks a pop.or 400 bucks a year.  Exthorting funds for what became very clear totally unnessesary testing. Hey i get it, they are running a business.\n\nTesting your pet when something is obviously wrong makes sense. When everything  is A-Okay? \n\nTaking our pet and our money elsewhere.", "date": "2014-05-01 18:51:36"}, {"review_id": "QWYgA2madO3yd5gxe24fzw", "user_id": "fBc2s2EJckPnP779-iupUw", "business_id": "_B3jnaQVtDXqydea1y92fQ", "stars": 1.0, "useful": 4, "funny": 2, "cool": 2, "text": "Kraft Mac and cheese. Seriously. And don't come with a large party. They have no clue how to handle it. I really am in shock how poor this service was.", "date": "2017-08-14 04:16:40"}, {"review_id": "PzQZnkqtetDawMOyNxzuXg", "user_id": "Sbr1yT0LPvLu3Aeo-4fIHg", "business_id": "CmQ0BCNQbvjhItvsaAXNUQ", "stars": 1.0, "useful": 0, "funny": 3, "cool": 0, "text": "Good Lord what a hot mess this guy is. When he shows up he is awesome.  . .not a bit of poop left on the ground (but isn't that their job?) The problem lies in getting him to show up. His \"car problems\" outnumber my \"dog ate my homework\" high school problems ten fold.\n\nThen, when he decides he's going to come to work, he'll text you at ELEVEN FREAKING o'clock at night. Seriously? Do you text YOUR boss in the middle of the night to let him know you'll be at work the next day?\n\nEnough. Seriously -- I've had enough. This is yet another Las Vegas classic and, after almost 15 years of dealing with this crap, I am DONE. Either do what you say you will  do or FU$% off. Thankfully, there are a multitude of dog sh$% pickup services from which to choose. \"Skip,\" (which isn't even your name) you lose.", "date": "2015-04-23 06:12:56"}, {"review_id": "btYo90XQz6N_FZeDoYjuGQ", "user_id": "hBmJs49zYcXdV4wo8F5iiA", "business_id": "E67gGK8yOn9kkNzx8FzQKA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This review is for takeout. I'm a lover of BWW and this location is right by my work so me & my coworkers order out of here almost every week. Customer service is usually just okay, better when you actually go in, sit down and eat, especially in the bar. Today I placed 3 separate orders over the phone. When I arrived, they forgot part of the first order so I had to wait there for them to make it, in the middle of my work day. When I got back to work, we found I was shorted a ranch that I had paid for, and my coworker found that his wing order was short about 5 wings so we called in and spoke with a helpful manager, Daniel, who offered to remake the order. \n\nMy coworker went back to the BWW to pick up his order and, when he asked for the ranch that they had forgotten, they refused to give it to him because it wasn't on that receipt.  Lol  are you kidding me? He mentioned it was on a separate order and they really wouldn't give him one side of ranch valued under a dollar. At this point it became laughably bad to just about everyone in our office. \n\nThere are plenty of other BWW locations around the valley with awesome servers & hosts who treat customers as they should be treated, unlike this one. If you feel like wings but don't want to waste your time & money at this location, just go to the one on Durange since they're always great.", "date": "2015-10-29 22:26:14"}, {"review_id": "wzmlcBcJDOHhePuLGcyWuw", "user_id": "JDoohfuUxDVAt7GEUSrr8w", "business_id": "-kG0N8sBhBotMbu0KVSPaw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Horrible experience here with UNITED!! No service counter! Delays, cancellations re-bookings and more delays! I will NOT be using UNITED again!", "date": "2015-06-16 16:49:57"}, {"review_id": "-nn3gVvBGoW7_DTJyzXeHw", "user_id": "g-LMS-EVn0jj3Ex4fV9RUw", "business_id": "-UK943ZzWTP63hRRgSrhWQ", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "Ordered the Grecco, the YB Special Stuffed plus the Steak and Frank. Wouldn't call it gourmet at all. Was salty, poor quality and not sure when ham became steak.   Pizza 73 is better.", "date": "2014-12-29 00:16:45"}, {"review_id": "-3kAZMkCzUgn6WOo4MJiig", "user_id": "Yhb22z0hGp0LZL7-lWvZYQ", "business_id": "oudIKQI8HjqJqiF9pnMmQw", "stars": 1.0, "useful": 1, "funny": 2, "cool": 2, "text": "My friend and I went there today and I liked that it wasn't too loud or quiet. However after placing my order I noticed a cockroach crawling by my foot and not just a regular roach a big ass one! So we left. I'm sure the food is good but we were totally grossed out by the roach.", "date": "2014-11-22 23:36:52"}, {"review_id": "etwTO8PScvNdxDj9wnrheA", "user_id": "SGLeYqBkVSqhgIG1wixiTQ", "business_id": "lXpYSMyEujoky4djEJlBSg", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "Used the online order app, it's 20 minutes past from when they said it would be ready(been waiting 50 min total) bartender greeted me saying I don't check my emails so I just got it.... Thanks dip crap. The food will suck as bad as the service! Do not recommend!", "date": "2016-05-12 05:00:58"}, {"review_id": "6OwZI5gUkXqyaowrMcEvQw", "user_id": "NVxyabXgswcLcF1J33vrmw", "business_id": "Rk82QHtWp268GM93qWj3dQ", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "We have been a fairly regular customer at this place for a while. Over our last 3 visits, their service quality and food have deteriorated significantly. Today's visit was the last straw. We sat at our table waiting for basic drink orders to happen for about 10 minutes. Then our food in general arrived much after other larger groups who had come after us. To make things worse, the Kali Mirch ka paneer was completely under-seasoned. They put some undercooked paneer to pass for a tandoor dish with some sprinkled chat masala. We have had this same dish here before and it was my wife's favorite. This was basically nothing like it. Then their spring dosa which I ordered had undercooked cabbage with large pieces of carrots, completely skipped the part where these vegetables have to be finely chopped before stuffing them. Again, no seasoning or salt either in the stuffing for this. \n\nMy favorite at this place used to be Mirchi Ka Salan, however after the last debacle of breads and food orders, I was hoping for a simple south indian meal thinking they cannot goof it up. I guess I was wrong.\n\nI don't think I will go back.", "date": "2012-07-29 03:03:00"}, {"review_id": "GGrk0SIt1dAHyuppQofinw", "user_id": "KcFxhQFcVlr4urPTsJAVXw", "business_id": "YPavuOh2XsnRbLfl0DH2lQ", "stars": 1.0, "useful": 19, "funny": 11, "cool": 0, "text": "As I sit and WAIT after being told \"Don't stand at the door!\" by a grumpy \"hostess\"(?) THE moment I walked through it... I feel compelled to start writing my review as I pray that the food is even worth the 45 minute wait, after also being told by two people we could order drinks only to be told we in fact had to make our way back to the hostess stand,  order AND pay for drinks up front, THEN to be told \"well just wait for your table so it'll be easier for YOU to get drinks\"...\n\n We are finally (called party of 5 although we specifically said 6!) AND were refused addition of 1 person (five minutes after we walked in, unless we didn't mind being bumped to the bottom of the list?!?) \n\nClearly by now, if I wasn't with 5 other folks I'd run for the hills... long story short, the food took over 30 mins, my drink came out with no ice (jack n pepsi) after my friend warned me to remove my straw as it had been excessively groped by a server... the waitress was clearly rushing and not focusing on a quality interaction despite our wait. \n\nI asked a gent if the grumpy lady up front was the owner and he said \"No, but I'm the manager\" and listened to a very succinct review of what we experienced during our first impressions of the Place.  I let him know we were all just visiting town and were just hopeful that the food would be \"on point.\" \n\nI toyed with the idea of trying the classic chicken n waffles (breast) because all great cooks know, a true culinary lover KNOWS how to make a juicy breast... instead I tried the #9- two thighs and a waffle.... only to be amazed that even the \"foolproof\" dark meat wasn't handled with care... soggy skin, lackluster-holiday-inn-style waffle... We were ALL ready for the check. \n\nManager Joseph brought a fresh jack n pepsi for me, and the massive waste of food we left over is available for viewing in my \"AFTER\" photos attached to this review. .. \n\nHey LOLo, if I wanted to pay for bad service I'd check out this place called \"Dicks\" where apparently some good (albeit vulgar) jargon is tossed at you on purpose... but I'd bet they could make a better plate of chicken n waffles even if they had their petrified grandpappy working the deep fat fryer in the back.... Too honest? Perhaps... but sadly this EXACTLY was what we experienced... Now I'm seriously going to question all four-star reviews I read in Yelp PHX, and that just makes me sad on a whole different level. Adios.", "date": "2015-02-08 04:58:56"}, {"review_id": "VtcWZ6yoJu2taSCTmndTPQ", "user_id": "xUOWVDFSsUhg6zZzpbhwLw", "business_id": "U62f1Ty-NYh7jtH3Yb8tmQ", "stars": 1.0, "useful": 7, "funny": 0, "cool": 0, "text": "I have shopped at Smith's at Rancho & Charleston for over 30 years.  Recently, I have had several occasions when the food purchased had passed their expiration dates by weeks or in one case 2+ months.  My practice has been to check dates on everything.  But, today was the FINAL STRAW.  The cart that I grabbed was absolutely FILTHY.  I took a picture and then talked to Chris, operations assistant manager.  He told me that they would take cart out of service.  But, it went right back in the mix and someone took it to shop with.\nThis store has continually gone down hill.  Sadly, no other store is close but I guess a drive is in order.  This store services Rancho Circle, Rancho BelAir, Rancho Nevada Estates and Scotch 80's, some very prestigious neighborhoods.  If corporate doesn't do something, this store is a disgrace to their name.", "date": "2016-05-01 20:36:34"}, {"review_id": "GDd7JzCPZjqd0nii1gJMYg", "user_id": "PfqrinaLIG5sxuI642bGqA", "business_id": "n0SSApg8pIMu9uWr7IvxcQ", "stars": 1.0, "useful": 4, "funny": 1, "cool": 0, "text": "Oh where can I even start with how horrible this place is!  I rented from this location in March 2016 and it was a mistake...for every six customers the two other rental companies were turning over on either side of Fox (with two employees), Fox was turning over just ONE customer (with three employees)...if you do the math, that just doesn't add up...\n\nI had forgotten about this and made the mistake of attempting to rent from them again this past week (April 7)...the same horribly slow turn-over was encountered and this time I was denied rental because I only had a debit card and didn't have two forms of ID!  (Completely contradictory to what was required in 2016)\n\nSo after all that waiting, I had to go to another company...Alamo!  Who I HIGHLY recommend!  They heard about my experience and not only gave me a great rate, rented to me with my debit card and one available picture ID, they threw in free gas!  They didn't have to do that, but did.\n\nFox=HORRIBLE\n\nAlamo=AWESOME!", "date": "2017-04-12 23:06:13"}, {"review_id": "T8qhR1TfbF4Kxf-wore5DQ", "user_id": "G7Vv83DRiEvFpIY5TVhVUw", "business_id": "1pytOeO_PhT4EVpk2MXQBA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Simple five (5) item order.  Had someone sick that had not eaten in a couple days and wanted a burrito.  Guess what, got 4 items- no burrito.  Was not busy and was not slow this time.  TB made a little extra on that order - will not go back.  A very good reason for no more min wage increases.  If you cannot count, should be back in school.", "date": "2018-08-01 19:08:51"}, {"review_id": "NCuDL4WeztN2uJfZxM1CLg", "user_id": "W9uPXFxpha9dgNmSm783hQ", "business_id": "OaM2Bjeo2Ftt84ruTrzPNQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Way below average.  They forgot half my order. The wings were small and not meaty. The sauces were not tasty.  We couldn't even tell which sauce was which after tasting them. The prices were decent for wings, but not these wings. Don't think people who gave this restaurant a good review have ever had a wing before.  Best part of the meal was the coleslaw. Maybe that's what they should rename the restaurant.", "date": "2012-06-14 02:17:52"}, {"review_id": "FT8auTDCWGX30xUNyoIXFQ", "user_id": "aEAAP7_ekQj6jS9iSNbdTg", "business_id": "qnql60YyttH_nMfufiHHtw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I live down the road and went here during the weekly lunch hour and had the gyro special with fries, a drink, and an order of falafel. I give them 1 star because middle eastern cuisine is by far my favorite, even with mediocre food I can be satisfied enough to finish my meal, but I did not finish any of what I wasted $14 on. Everything tasted sour, old, and/or poorly seasoned. The falafel were overcooked and too garlicky, typically I'm a garlic fiend, but it was bitter burned garlic that I could taste. The tahini tasted like spoiled yogurt. I'm not sure what part of the gyro was bad but it tasted sour as well the meat was flavorless and the tzatziki again tasted like sour yogurt with a ton of onion powder and dill. I was not impressed. I had three bites of everything except the fries and called it quits. The guy taking my order was also rushing me so much that I could barely get the words out of my mouth before he was trying to grab my card, and I almost forgot that I was craving falafel in the first place.  The french fries were good, so for that they get the one star. If anyone can recommend a decent or really good middle eastern restaurant in the area I would  appreciate it, I am still getting to know the Phoenix area!", "date": "2015-11-13 18:29:56"}, {"review_id": "Pb74z9NBDPrP1l18eHkfkA", "user_id": "o4L-zqYBqVXGnLZva4DXfg", "business_id": "DN0b4Un8--Uf6SEWLeh0UA", "stars": 1.0, "useful": 86, "funny": 18, "cool": 8, "text": "service was decent but the food was bad and over priced. at least my water was cold.the paninI was over chrunchy and soggy at the same time. should have just went to Mcdonald", "date": "2015-06-02 06:45:23"}, {"review_id": "qDqws4Dvp0aIKoTou4HZUg", "user_id": "srKfRJciEukIvZazLQadbQ", "business_id": "FTlDoGvZ2KFdjDKxvHA8cg", "stars": 1.0, "useful": 36, "funny": 0, "cool": 0, "text": "This is not a real company - it is a bait-and-switch scam. \n\nThis company offers a \"free sample\" of their chocolate. 14 days later, they charge your card $35 for the a few tiny squares of chocolate that you already paid $5 for (\"shipping and handling\") - which arrive melted and taste horrific. I've literally never had worse chocolate in my life. \n\nCustomer service claims that this additional $35 is the \"full retail price\" of the free sample they sent.", "date": "2017-10-09 09:12:52"}, {"review_id": "gZW49miTVHU2_MzoFwM58Q", "user_id": "L_Q42H4NK06wO-tGHggAUg", "business_id": "GcJjbY0FNGY1azZ5iFvGIQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Sure, the food was alright. But the service was horrible. We had to repeat multiple times to the waitresses that we needed water and when we asked for our bill we spent a good fifteen minutes waiting for the debit machine when the restaurant was dead. Never coming back AGAIN.", "date": "2014-01-10 02:42:27"}, {"review_id": "NE22nl1TgNX_qab4Jggpkw", "user_id": "Abkzk1xQCfWW4LzSsyEXqQ", "business_id": "BLIJ-p5wYuAhw6Pp6mh6mw", "stars": 1.0, "useful": 0, "funny": 3, "cool": 1, "text": "No toothbrush.\n\nStayed here midweek while in Vegas for work. It was my 7-8th time in Vegas in the lat 2 years and first at Planet Hollywood. I had the resort package or whatever. for 3 days it came out to roughly $400. The room was spacious, but that's about all that it has going for it. \n\nFirst off, the self-parking is way to far from the hotel, even for Vegas. Yes, there is Valet, but that still no excuse. \n\nThe decor looks cheap and lazy. The elevator doors are way too fast and close on literally everyone.\n\nThe wifi is slow and actually tracks your data, as  result I was unable to log in to my works VPN, or even play video games.\n\nI call it in and got put on the line with IT, who basically said everything looked fine. and they didn't see any issues with tracking my data.\n\nThen, I ordered chicken wings to my room. They weren't good, but I didn't care because I was starving. The guy hands me the bill and it had gratuity included. So I tip the difference in the amount I would have tipped and included gratuity..\n\nThe dude looks at it and goes: \"So you're only tipping me three dollars?\" \nI go: \" Gratuity is added\"\nHim, sarcastically: \"I know, enjoy your stay at Planet Hollywood\"\n\nK.\n\nSo I brought a toothbrush and toothpaste travel kit from the last hotel I stayed at.. Somehow my toothbrush snapped and so I call the front desk for a dental kit. The inform me rather rudely that they don't provide toothbrushes. What kind of hotel doesnt provide toothbrushes. To make things worse, the cleaning people saw the snapped brush i had and threw it away... along with toothpaste I had left.\n\n\"Enjoy your stay at Planet Hollywood\"\n\nThere are tons of hotels to choose from in Vegas, at reasonable prices. The vast majority actually care bout the comfort of their residents, unlike Planet Hollywood. No reason to subject yourself to a mediocre experience.", "date": "2017-08-04 23:01:23"}, {"review_id": "PRZqAFkBygg2WMJ_6juFsA", "user_id": "4JTRX06GrMAxEI6kO1hpgQ", "business_id": "u73Cv9yp_gTGNhBvECSJGA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Luis is so rude tho i don't know why he is dealing with his costumer like that.\nI'm not gonna eat in this please any more just because of him.", "date": "2016-12-11 11:26:19"}, {"review_id": "PACRtWwlVR265VFJ9Jz72A", "user_id": "X95fBiEfCzfendXROeHVbw", "business_id": "UESdOMLsXn_7WcwOZt7I3A", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I won't waste my time and money on this place - horrible food and kinda dirty and smelly", "date": "2008-10-02 20:04:32"}, {"review_id": "N4iPsb_y5lZ_wVi7ptSLMw", "user_id": "D6lEZE8ryCNpYOTD3wSJtA", "business_id": "Q9PNRAxvh5YDOxnajHDZUg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I like Wendy's food, but this location has bad service. Unorganized and restaurant not well kept. I keep going back expecting a change, but get the same.", "date": "2015-07-01 16:40:57"}, {"review_id": "mq1jjyg1Atwc5RNc4Sbkdg", "user_id": "7JuEIJ7JtrmCarZntn3ikA", "business_id": "IbG2bgOTAGayL6T8VVePGQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "under cooked chicken sandwich. busy is not an excuse for under cooked food.", "date": "2016-04-03 18:22:38"}, {"review_id": "5ITODgUp25CM2odwDhQADg", "user_id": "PRYs7r8c49e3Kuh4Sbt6iA", "business_id": "2A1wvIFdKQZZe-vtTO7olQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "It was a 45 min wait. Pizza was too salty. No veggie pizza, had to order reg pie & had to pay $2 xtra for each toppings.  Our 1 pie cost us $24", "date": "2011-11-13 18:40:17"}, {"review_id": "tpPE8zndddw_cL63hOei9g", "user_id": "FmtnXwc_eyvpIv1Q1-bVCQ", "business_id": "YaTlfyPieOXwHH16wzieFg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This location is a mess... I avoid dining in as much as possible. But this is literally 5 minutes away from my house and if I'm hungry for some nachos... I will come here... I'll just order out though. Haha!\n\nThe cleanliness of this place is not up to par. The staff is usually miserable and grumpy. They're ALWAYS in a rush... So I take my time ordering. I hate feeling rushed! The staff obviously has issues with each other. The cashier was telling one of the dish washers to cut some veggies up. Dishwasher responded \"it's not in my job description\". The cashier was visibly irritated. I mean, c'mon... The very slightest ounce of professionalism goes such a long way. They need to get it together.", "date": "2016-06-06 08:06:17"}, {"review_id": "AIxslnrqRkmAETcvJhE1SQ", "user_id": "rfFco6lZ59398G8rXgvkEw", "business_id": "A-IqLvBfU5Gr_b9HVLETTw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "When my boyfriend and I were down with the flu, we ordered some food here through Eat24. I got a chicken noodle soup and he got the seafood calzone. When I unpacked the food and tried a sip of my soup, I found that it was cold and had bubbles in it, as if there was soap in it. I couldn't really taste anything, but my boyfriend said it smelled like dishwater. To say the least, I was disappointed in my soup. When my boyfriend cut into his calzone, he said the cheese was barely melted. We thought it was undercooked and touched the outside. It was cold, as if it was sitting out in the open for a long time. He tried to take a bite, but the dough was barely even cooked and the contents of the seafood calzone was cold and tasted sour.\nThis was our first time ordering from here and it was such a sad experience to have, since our food was inedible. I heard this place was good and had great calzones and tasty soup, but what we received was the complete opposite from the praise I've heard about this place.", "date": "2014-06-05 09:02:57"}, {"review_id": "yw05yyMRSjCOGYkmT6dZ9Q", "user_id": "85G7_8WosHH9x97ju72O7g", "business_id": "BDDIpeEK8gVdhiglbjEyrw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Horrible service! This place is incredibly unorganized, with very poor management. Waitress ignored us for 15 min, drinks took an additional 10 more minutes then our order was messed up. My daughter did not receive her food and the waitresses excuse for it was that it was sent to another table on accident, meanwhile that table had already left, due to how long it was taking for food to get out. I had to flag down the manager who did not care to make anything better, she seemed irritated that I asked for them to remake my daughter's food. She never apologized or even offered to take it off of the bill. I would steer clear of this location until corporate manages to clean it up.", "date": "2016-04-17 22:53:49"}, {"review_id": "3naFQueLuebM1H7-cKRUTw", "user_id": "iBA8Ba9DNkquJQ3wUsjQcA", "business_id": "L-ysL4aU0jsq-cEaAE_7cA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Poorly organized and overwhelmingly large and intimidating, you will also receive very poor service from some of the staff (Randi and Judy are particularly rude). Pay is very poor for most material and they are overstocked with a lot of very mainstream titles that make browsing a chore (they clearly don't know or manage their stock very well and make very poor and indiscriminate buying decisions).", "date": "2015-07-22 03:08:09"}, {"review_id": "eIvEN034RRAC7bmLvJT1ew", "user_id": "gcLrrb0lBYMPY04ANoZotQ", "business_id": "oF2XS1nvcjnntEl7g8NltA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "In my opinion Best Buy does not care about people in wheelchairs. Sorry I cannot shop there anymore. I been treated like dirt.", "date": "2014-11-21 20:21:59"}, {"review_id": "jx5AvQ1W3XWQ6TcW30gIYQ", "user_id": "mz-PEIOOEXDEcuQlxL_mgw", "business_id": "3lRFcrfR3IrSAQJtrnn80A", "stars": 1.0, "useful": 3, "funny": 0, "cool": 1, "text": "Ayer estuve en este restaurante, yo no lo conocía y el cual ya no tiene ese nombre, hoy por hoy se llama: El Salvador 503, en donde fui super mal atendida como nunca, por la encargada del lugar, una mujer déspota con unas uñas tan asquerosas para alguien que trabaja directamente con servicio de comida....Primero llame para hacer mi pedido, y me respondió una nueva empleada, yo sin saberlo le ordené, me dío el precio y dijo que en 45 min. Me lo tendrían sentí mucho pero igual llegué pasado ese tiempo.\nCuando llegue la administradora se tardó como 25 min. En cobrarle a otro cliente, según por problemas con su registradora,  al fin cuándo me atendió \"ME ESTABA COBRANDO EL DOBLE DEL PRECIO\"..... alegaba que tres pupusas del pedido eran más caras por ser de quezo, le dije que me las quitara, despues me dice que todo mi pedido me lo cambiarían por pupusas más pequeñas que las que ya me habían echado,  ya que la empleada era nueva y no habia podido hacer bien el pedido, las cuales tenía que esperar otros 45 minutos más, y eso si quería esperar, sino que no las llevara.....WOWWWWWW y Qué con mi tiempo? Más de 1hora  perdida, y mi hijito de 3 años con mucha hambre en ese momento, por eso NO se lo recomiendo,  por el pésimo servicio de la encargada!", "date": "2015-08-02 22:28:00"}, {"review_id": "vUTmiuOYKNeK8VhHXbEYPg", "user_id": "LZ6IVvfitr_eFGxaFmND-A", "business_id": "piGQNN6ECbSC0agHhvoVeg", "stars": 1.0, "useful": 3, "funny": 2, "cool": 1, "text": "The sweet guy that worked on my toes was super nice and did a good job, BUT....I could not get over the unsterile nail clippers. He literally had a little basket with all his pedi utensils sitting there like nothing, GUARANTEED they haven't been sterilized in who knows along. Sorry, but no. Never again.", "date": "2018-02-27 04:24:39"}, {"review_id": "kYvsvyewAqhImhr2xi-2_Q", "user_id": "d4f5jrvJq9Pwm85iZGI7Jg", "business_id": "c7rY9O3qbGuhDKN0_AKqTA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Had a crown that came off my tooth. They had to reshape my tooth for a NEW crown. After the shot me up with numbing meds, THEY GAVE me BELLS PALSY (google bells palsy) by injecting me in the wrong place. I had to sit there for an hour so they can monitor my blood pressure. The look on the dentist face said it all. I could tell he screwed up. Then, they said it would be malpractice if he kept going. So, nothing was done. I refused to reschedule. The lady at the front desk (manager?) Kept asking me if everything was explained to me which really made me think they screwed up big time. \n\nMy new dentist said I didn't even need a new crown and just cemented my current crown back.", "date": "2018-09-07 19:03:16"}, {"review_id": "_ZhJKGQ5gqH1j9qVDtWmFQ", "user_id": "39jof84HrLedzeQyp3U7Dw", "business_id": "dtQJ1z76RnWWKNo-aQgHyw", "stars": 1.0, "useful": 7, "funny": 0, "cool": 0, "text": "I have visited this practice twice and I don't think I will go back.  From scheduling, to patient care they are lacking professionalism.  \n\nI had an appointment and was kept waiting for a long while (this is to see the PA, mind you, not an MD).  \n\nThe receptionist told me they were just cleaning a room and they would come for me.  After another long while (at this point, it is after noon), no one had come to get me and the receptionist had gone to lunch.\n\nI ended up leaving because I had to get back to work.  I called later and asked them to refund my co-pay to my CC.  They, of course, collected my co-pay and made sure I had insurance right away.", "date": "2016-10-06 23:24:12"}, {"review_id": "qUfFioQfZ5XkESI0kQR-qQ", "user_id": "3jTmjIHczuzPSg1CtkU66w", "business_id": "YAJzBGvqT3dT_qAg6u8E1A", "stars": 1.0, "useful": 3, "funny": 2, "cool": 0, "text": "Not my favorite.  I've been in twice now and each time I was really uninspired with the food I ordered.  It's pretty standard bar food but there was no wow factor.  The second time I went in was a total bummer.  I was strugglin' that day and just needed something delicious.  I ordered the nachos which arrived cold, as in the artificial cheese (like snack booth style) was COLD.  The server didn't really seem to care which didn't really help make matters any better.  Weak Sauce.", "date": "2010-06-02 22:20:55"}, {"review_id": "vo7roJpbvuMtS7S15te48w", "user_id": "mMdQvwWGrNeqPs3xARHezQ", "business_id": "jtQARsP6P-LbkyjbO1qNGg", "stars": 1.0, "useful": 3, "funny": 1, "cool": 1, "text": "I was hoping they would be better than the one on LV blvd. NOT. the peach cobbler was totally burned.  don't even know why they bothered to sell that to anybody. the mac and cheese as usual is over cooked. i tried. i can't.", "date": "2013-01-14 01:22:56"}, {"review_id": "cn9HjZnLvjNW1oVvVNFmgw", "user_id": "eYjq231DkLwmaF_4x8zang", "business_id": "zhc2S7yhYfbKTM-c08E1bA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Only gave them one star because you can't give them zero. Went there this morning for breakfast, never actually got any food. After waiting for ten minutes without anyone acknowledging we were seated I asked if someone was going to take our order. The guy kind of nodded.  After another five minutes I was done.  We left and went to Reuben's down the street. Very good food and good service. They wanted my money I guess.", "date": "2014-08-02 20:03:40"}, {"review_id": "XSwY7Dn0RSaZag4K23_Qdg", "user_id": "V09eTSY_o7BrtDcZg24cnA", "business_id": "HSdqe27QEUJqB2gFo84keA", "stars": 1.0, "useful": 3, "funny": 1, "cool": 0, "text": "This place is a joke when you apply online for a car and you get that your approved and you get a call from a sales person that everything looks great. When you go into this dealer let me tell you it's different story after you give them the paper work they want to see. I was disappointed with this so called #1  dealer in Vegas with there joke of a staff and managers they have. And don't buy into the story that your a VIP customer because after buying my first car from them you don't get nada when you try to buy another. So buyer beware of this place and question them on the phone before they waste your time for hours. And if your trading in a car becarful of the older gentlemen that appraises your car he scraped the bottom of our car parking it back into a parking space after test driving it and everyone in the dealership turned around to look at him. I would rate this place no stars if I could Towbin Dodge is a joke and just do your homework before buying from this place. The way they treated my husband as a veteran was very disappointing.", "date": "2017-07-24 06:56:58"}, {"review_id": "XDgWjEDLAtSTSsMGWaZhkA", "user_id": "OOi_k-lMHsVwmkosRHvXQA", "business_id": "eQCYur0033RkZdh5VjbF8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for drinks with friends I havent seen in a while so I was looking forward to it.  Got seated on the patio which is pretty nice, not the best I've seen in Toronto but not bad.  Decent size.  Ordered a mojito which was very watered down.  Ordered a salad which was nothing to it, definitely expected more. When I asked the waitress for more dressing (because it was so bland I needed more flavor) she brought me cesaer dressing and before I realized it was not the same dressing as the one I had, I poured it on my salad.  Gross salad had to go back, new one took so long to come that my friends were already done eating their food and I ended up eating my salad alone.  We sat and chatted for no more than 45 mins and in that time the waitress came by AT LEAST 4 times to ask us if we wanted anything else, did we want our bill?  I would completely understand if the restaurant was FULL and as we were not ordering anything else and just chatting at this point but half the patio was empty.  All the tables directly around us were vacant.  I would not go back here.  Overpriced for stuff I would expect at a restaurant with a much lesser reputation to uphold, and the staff have no manners.  WAAAAAY OVERATED.", "date": "2012-07-25 15:04:00"}, {"review_id": "ChXIQFG_8_5FSA9aXG7Aaw", "user_id": "caBZoHObHBukDjl4jfmh3A", "business_id": "g6pfgToSG0Y1_Pax-4HvoQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'd just like to echo the other folks here--don't rent with this company.\n\nIt's your typical college slumlord operation; the apartments are in very poor condition, and the staff will treat you terribly. They have no qualms about browbeating you into forgoing your rights as a tenant.\n\nIf you did rent with them and have the inevitable problems, you can get help from the Tenant Resource Center on Willy Street.", "date": "2015-12-30 22:48:30"}, {"review_id": "OwvSYizydT8WBK-lXy40qg", "user_id": "pn6pWPHcKFV4OZbCEsni6g", "business_id": "CSXhYcVHTN5Tvr1Sg2na1g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "In a nutshell, these guys suck. I don't know if it's limited to this location or if it's just the company in general, but I am given a hard time and lied to about pricing every time I have had to use them. They have unfortunately been the most convenient option over the past year, which is why I have used them a handful of times. After my most recent experience, however, I don't care how convenient they are, they are scumbags. Do yourself a favor and go anywhere else for a rental car.", "date": "2017-12-10 15:54:33"}, {"review_id": "CgWO8fAPCFaZJFamENfpBA", "user_id": "qH7aqt6U_h-QM0Qy3svxcw", "business_id": "xYN24hoauaQ8pJ0lXx_CLA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I brought a cocktail dress for cleaning that had a spill. I pointed it out to the clerk when I dropped off the dress. When I picked up the dress, they had over treated the stain, which created a hole in the dress ruining it.  The clerk took my information for the owner who refused to speak with me and said I ruined my own dress and they are not at fault.", "date": "2018-06-13 15:44:58"}, {"review_id": "sdbyCHlR2KzX4UYXzESYJQ", "user_id": "dfWzNW1W7d4564pSnnty9Q", "business_id": "bB9JPvR2d-I1jxSVlqN2DQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a very bad cafe in replacement of Dufflet! We went there on the weekend to grab a sandwich and I didn't have high expectations. The sandwiches were terrible and the croissants were not crispy at all. The turkey on the turkey croissant tasted fake. The lemonade was watered down and not sweet. Would not recommend and I would not return. :(", "date": "2018-05-05 19:43:42"}, {"review_id": "1mWZOiIQcgSzoZ9lNIzaGw", "user_id": "tSvTFFRjR1vQ84AMDtYoqQ", "business_id": "WKz2Jmmt1B_VbHlAbfQNzQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very disappointed was looking froward to a nice dinner at 8:10 pm on Sunday night only to be told once I walked in the door they were closed. This is the second time this has happened to my wife and I at Fresh Wasabi.\nThey closed an hour earlier  than their posted sing on the door or web site. I guess they don't need the business (they are not cheep). I will not take a third strike nor go back. Better call before you go!", "date": "2015-08-03 03:43:32"}, {"review_id": "23xktDvHwDRhBN_fCP2gFA", "user_id": "IYsSVYkztP6udpMEnUvUFA", "business_id": "w3lvOCY1MyiVLHa8JXcklg", "stars": 1.0, "useful": 5, "funny": 1, "cool": 1, "text": "Had AC technician \"Kris\"come to my home today to assess upstairs AC that hadn't been working for 2 days, only for him have to a bad attitude about servicing the unit and to be condescending to me! He acted like he wasn't getting paid and implied I was ignorant for calling in for service. He was completely unprofessional! I called their office to complain and spoke with Cynthia about him but who knows if he will get reprimanded or not? You would think since he's representing A&R  complete service corp. his customer service skills would be at least average...", "date": "2015-07-09 00:04:04"}, {"review_id": "hKbpLG9Kx4KtUyxQUuBL6g", "user_id": "dhO5w6vodwj8y3BNEfLhzQ", "business_id": "VWUr0a1LCklb597Jl8tElA", "stars": 1.0, "useful": 6, "funny": 0, "cool": 0, "text": "Diamond resorts and the rest of the time share companies are a scam.  They do not tell you that there is no way to get rid of it if you choose to sell it at a later time.  There is no resale value and it is not worth heiring it to your family.  Beware if you choose to buy one, you will be paying maintenance dues for life and have no control of that cost going up all the time.", "date": "2012-09-19 03:22:55"}, {"review_id": "3J2PcVTYt2iPGLwxC-xPrA", "user_id": "1gyEG0uOjaXrltr7pdEoeg", "business_id": "hcryG9RkmK9oCELYLHukiQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I stopped at the one on three degree road about a week ago I place my order there was a kid standing there with his fingers buried in his shoe scratching his foot walk back and started making the pizza didn't bother to wash his hands I walked out will never go there again", "date": "2015-07-11 18:26:02"}, {"review_id": "jntIKFv5oxTADk-q38XlHA", "user_id": "xuQ9mC-ANK6ikwXzaXSCAw", "business_id": "sYfHxCqHpIX2HnDhw0JRAA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not impressed with the chef! Threw pepper in my drink. Not very personable. Food was good.", "date": "2014-12-27 07:05:34"}, {"review_id": "dbMctdUTSg_Qf4xCVxvbHQ", "user_id": "VEOD6Y-w1UoRnxzJZjTI1g", "business_id": "BLIJ-p5wYuAhw6Pp6mh6mw", "stars": 1.0, "useful": 5, "funny": 1, "cool": 2, "text": "STAY AWAY!!\n\nHere are my issues with this place:\n- Super long line to check in on a random Wednesday.  There was only 1 person working at the desk and made no effort to get backup even after people were lined up for an hour.\n- NO PHONE RECEPTION IN MY ROOM.  \n- NO WIRELESS INTERNET IN MY ROOM.  When I called about this the front desk said they didn't have good internet router connections in the wing I was in.\n\nSin City Comedy show is boring, not funny and a waste of money.\n\nYou can see the remnants of the old Aladdin motif.  They should have left it as Aladdin hotel and invested in wireless routers more employee training.", "date": "2013-11-27 06:38:09"}, {"review_id": "Wcex5LczxwpeEa4pwF4fwA", "user_id": "JMVJKa0Xvr_5QxWp5ACXhw", "business_id": "xGXtoeQAggLP9646N4Iwnw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Vasta went down hill since the 90's....... They need to attract a different kind of crowd They need to change things up a lot.......  If you want any idea's hit me up I could give your business many ideas how to flip your business around. Hit me up tiffanyshousekeeping@yahoo.com", "date": "2015-01-10 02:53:49"}, {"review_id": "4tWci1uIQ1G3Jx_TV8kz5Q", "user_id": "G-wP2ymAZD2HJ6WVbslEiA", "business_id": "Xzz33WOKzbUAsVnjzGKLQg", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "If I could give this place negative stars I would give them a negative 5. I am not here to talk about the actual company but their Pharmacy.\n\nFor the last 4 months one of my medications has been delayed at least a week every month, some months more. I call in to get it filled, they don't have it in stock and supposedly order it. I have found out a couple of the months they never ordered it so when I call the day they say there are going to have it. The realize it was never ordered. \n\nOn another occasion they kept saying they need doctor approval, when I contact my insurance and doctor they have on file that they have doctor approval till July 2017. After I contact the pharmacy and they look into it they finally say I can get my medication, but since they don't have it in stock they have to order it. I was dealing with them for 4 days and not once did they think to look to see if they have it in stock, yet again delaying my medication.\n\nI was there one night and a man was getting a refill and he said his pills looked different and they found out they gave him 80mg NOT 8mg. I am glad nothing happened to that man but that is a huge difference.\n\nI know you are thinking why not go to another pharmacy? Well certain medications won't be accepted at other locations unless I am already and established patient. Trust me I have tried. \n\nSo after getting off the phone with the pharmacy mgr, Moana, I have now come to the fact I have to call in the morning to get my medication filled and ordered if need be. THEN if they have to order it I have to call before 3pm to make sure that it is on their list to order so I know it is being ordered.\n\nLike I said STAY AWAY from here. The reps there seem like they don't care about their customers.", "date": "2016-12-28 19:31:37"}, {"review_id": "8kik3S1mDLGpKQxevMiaiw", "user_id": "7L8utEpYiVj3pNNjZkQaLQ", "business_id": "uW6UHfONAmm8QttPkbMewQ", "stars": 1.0, "useful": 0, "funny": 2, "cool": 0, "text": "I went with my group of guys and my boyfriend and as soon as we walked in the decor was very nice. It took a bit longer than expected for the server to take our drink order. When we received our menus I noticed the prices to be a way higher than the usual Hawaiian style joint. The menu was plain and had no pictures and the descriptions leave you wondering if it's going to be worth it or not. \n\nMy dudes ordered the Loco Moco and I ordered the mix plate with my boyfriend. My rice was a few hours old. My third bite into it I found a mustache hair or small black hair. I was disgusted because none of my dude friends have black hair, we are all blondes from California, so we can't be a suspect. I was disgusted not only because the hair wasn't on the top of my food, it was in the middle meaning it was mixed and cooked into the rice. That is extremely unprofessional for a kitchen staff. They have strict rules and regulations out here especially with the tourism out here. The manager came and said he has 3 restaurants 2 in Hawaii and this \"hair in the food\" issue has never occurred. I find it hard to believe as a former manager for Pizza Hut  and to never find any random item in food. The manager kept trying to get me to order something else from the menu but my stomach was in complete turmoil from this situation I only could drink my fruit punch, which the only good side was the free refills. \n\nI came up to the manager and told him that I am going to just walk out and drop this issue and I left without paying because I don't feel my health is worth the price of the meal. He will be hearing form the health department soon.\n\n\nJust please be careful people and check your food before you put it in your mouth.", "date": "2012-11-21 21:23:02"}, {"review_id": "62L7VJM3LTOUJeGmK4m6Pw", "user_id": "0BoO48jZw2kjJjwgwIjbLw", "business_id": "hRZadfm7OEOzk0qjuk8BXg", "stars": 1.0, "useful": 1, "funny": 3, "cool": 0, "text": "Ate there last night. Two of the four dinners made where wrong even as they brought back what should have been corrected it was wrong. The whole dinner was a disaster  on top of that the correct thing would have been to offer a desert or something. We are not the types that look to get comps or bitch about service but it was bad.  Two of ate while the others had to sit there. Once they received their dinner we had to do the same.  \nWell all I can say that's another one off the list. I will stick to El Segundo on the strip", "date": "2014-03-23 02:29:51"}, {"review_id": "xMq-qARLMxXnlPS64hlUbQ", "user_id": "3kTrXSiAVUdAbyBGt4Deew", "business_id": "2aUMzqnDN9TTv43D_8npaA", "stars": 1.0, "useful": 0, "funny": 3, "cool": 1, "text": "Well you've really out done yourself this time Great Clips on 44th & Thomas. Thanks for the usual shitty hair cut. This time the \"professional stylist\" cut my hair with the wrong size clippers, but I guess I should expect that from one of the worst run franchises in America. Thanks assholes!", "date": "2012-10-24 02:05:15"}, {"review_id": "8XtwS718CLj4dF1j4xb68w", "user_id": "yW2Gn_SBeo4ZsfrXcxpfrw", "business_id": "vCjX7hK0Aq1d8KcrhwwxTw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Rude manager, we were watching t v at the waiting room and he came in and changed the channel without asking us if we were watching. Never coming back here and will never recommend this place.", "date": "2016-07-10 20:50:35"}, {"review_id": "BV_pfeEp-BkImpZTDjhAhg", "user_id": "rgpujz37EJkfZQ6Oh73BDw", "business_id": "qEJ4vFcDBozHYUQXHKMW3g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Almost the worst care providers I've ever experienced. I had a dr's appointment on 8/8 and didn't get follow up on further testing that was ordered unless I called for updates. Went in with an issue that took a month for them to call me and finally tell me that my tests came back normal and referred me to my OBGyn for additional follow up.", "date": "2018-09-09 15:58:37"}, {"review_id": "zBtqC4ik456QfLuQnUAe1Q", "user_id": "rD8xIp2JNbKw8w_RG-LSsw", "business_id": "aD-YA02i2xAqLBDon1tzIQ", "stars": 1.0, "useful": 5, "funny": 2, "cool": 2, "text": "If you feel like waiting, receiving poor service, and over paying for food you should try this place! The portions were small, too small. In fact, we actually left there to go eat somewhere else! \n\nWe had a reservation and still waited 20 minutes to be seated and it was only downhill from there. It took 5 min. before our waiter even came over and greeted us, and it was at least 10 min. before he came back to ask for our drink order. The drinks were ok, but overpriced. \n\nWhen he finally made it back to take our dinner order we were starving. I ordered the pasta and my boyfriend got the steak. Definitely not what either of us expected, especially for the price we were paying. His entree was small and would have left anyone wanting more. While my pasta was slightly more filling, I too was not satisfied. We finished dinner feeling broke and hungry. \n\nAll those combined = not worth trying. Save your money, time, and appetite. Head next door to delux instead, you'll be much happier you did!", "date": "2011-08-11 04:14:52"}, {"review_id": "SDJCka1o4JmJquNQxvKl6Q", "user_id": "YLOA9Gi18DCxMDNDSfey_g", "business_id": "TkEMlu88OZn9TKZyeY9CJg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Sad to say that we won't be back. We went for our anniversary and it was our first time going to a Mastro's.  Everyone that recommended this place to us raved about the whole experience. My husband and I were so excited to try it out. Our server was average at best. We had to ask for our check after he passed by our table several times. We won't be going back.", "date": "2018-08-19 21:40:12"}, {"review_id": "NbH3JX3qDe60vFTHb6IqPw", "user_id": "hDXnVKG2SkQjGi38RPU9Hw", "business_id": "0yAmI1Af1gdkQ4gnHlE7eQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "It has been two times where the employees at this location have been rude to me. The first time my mom wanted the stuff she was buying on boxes because it was Christmas and the lady who was taking care of us looked annoyed and the second time was today one of the girls just looked at me up and down and roll her eyes at me. So I do not recommend this location plus, they hardly have anything.", "date": "2015-08-04 05:30:36"}, {"review_id": "omD73xuZZ6g-n40hn0J2-w", "user_id": "WjmRylvv8qQK38-csZtqQQ", "business_id": "BN6-gHm2ZMkZoGT8VZaiRw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This has been the worst furniture experience i have ever had or heard of. I have been waiting for a year to get my couch fixed. No one returns calls and everyone gives you the same run around. I will never buy from this company and i will warn everyone not to buy. It's cheaply made and if you buy the extended warranty it's a waste of money because they say a part is ordered with no known delivery date. I can't get my couch replaced because the part has been on order... but no know delivery date. Walker furniture informed me they no longer work with the manufacture of my couch so they don't know if they will get the part in. So what am i just to wait? I spent thousands on a couch that has been broken and its no one's responsibility to fix or replace. Even though i bought the extended warranty. This whole thing is a joke! At Couch Care Elizabeth, Caroline and manager Norman have zero customer service. Not one calls back or follows up and I was given 5 different order dates for my parts. Then was told they don't know when it will be in and can't replace it because the part is ordered. At walker furniture Blue promised to get me an answer on 7/31 about the expected date or to have an answer about replacing my couch and call me back the same day. 2 days go by I call her and she says she had a project she had to finish and didn't have an answer but would get one and call me back same day. 2 days go by I call her again and LM. No call back. Today I call and give the customer service lady my name I was put on hold and then sent to a general mailbox. I call back today and was told Blue is working on this and will call me back tomorrow... Surprise Surprise no call back. I now called Couch care and got the same run around. Part is ordered no idea when it will be here. Norman the manager is busy of course but he doesn't return calls anyways. Now I have left a message for Andy, Normans supervisor because surprise he's not available to talk. I hope someone sees this and actually can get my couch replaced.", "date": "2018-08-08 18:42:30"}, {"review_id": "H9ytsUaTcSnCTygqs_fq9Q", "user_id": "m86K8AIFyzfg6PhP8moc4Q", "business_id": "8BgufTquUG2G5ZRddInrTA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Extremely rude employees!  They made fun of the lady in front of me until she was on the verge of tears, for absolutely no reason! She didn't even say anything.  They made fun of her ethnicity (Asian) then started treating her like she was dumb.  When one of them were ringing me up, he said \"what do you want? I thought you were with her\"  implying that we were together because we were both of Asian decent. The one ringing me up threw the receipt at me then kept saying \"God bless you\" in a really condescending way.", "date": "2012-05-10 04:11:19"}, {"review_id": "-sUHCraWGwIM5Zy4fLFy3Q", "user_id": "fx6mvZPXDtkYIamMHhJ_aw", "business_id": "DqORaQfDFHCFIiG4g3d1-g", "stars": 1.0, "useful": 6, "funny": 1, "cool": 0, "text": "I DO NOT recommend this AYCE sushi restaurant. I pretty much called the Toronto public health on them. \n\nService is rude And don't even know what the sushi maki rolls are called. They hardly understand what I was asking for. I got serviced tap water then when I ask to change to tea the tea tasted like old tea. While I was eating I noticed two bugs on the ball just crawling away which was so gross. The food came but the salmon didn't look and taste right so I left all the sushi that didn't taste right to me. The food isn't great. The food all taste like it's been left out for a long time or it's just old. I got one bill for 72 dollars then another lady comes up to me and says that their charging me more because we didn't finish the food that tasted not fresh. So I paid. Once I got home I regret I paid at all. I had a stomach ache for 3 hours. I did get food poisoning and so did two of my other friends that dined with me. I called public health and they told me others have complained about food poisoning as well. \n\nJust don't risk the chance of getting food poisoning.", "date": "2014-08-05 05:00:48"}, {"review_id": "vpN6Cleq_OR1uGFYARdWbw", "user_id": "mqu-vGUzjx9uPVP14KBQBA", "business_id": "2AWznkiQwU7kEJ-fQtSvGA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "They are charging $43 for what ends up being a 5 minute chiropractic adjustment.  They advertise it as 15 minutes in duration, but they actually just work on your for 5 minutes.  Flat out cash grab.  I am definitely sure you can find a better chiropractor in the downtown area elsewhere.", "date": "2015-11-12 19:11:47"}, {"review_id": "tM_hkxMiaSlfOZHPwYH9Yw", "user_id": "b3Ig_ghh5HE_EkPBghptkQ", "business_id": "g-VYySAKLlEZt8AqtdMzMw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Won't be coming back to this location! The guys immediately try to upsale the washes, probably because I'm a female, and assume I'll take whatever they recommend. When I decide I don't want their most expensive wash, they immediately do whatever possible to get you in and out as quickly as possible. I've had numerous problems with the washes and having leftover spots on the inside and outside of my car. They argued with me telling me it was just my car, and they were hard water spots. My car isn't even a year old and has absolutely no cosmetic damages to it. I always leave this location upset and angry about something. I guess it's time to find a new place to get my car washed.", "date": "2014-03-21 01:47:40"}, {"review_id": "1TlCJcXVxd86-q0fQdg27g", "user_id": "bTTZzC8RvTxTOeGMvJ5icQ", "business_id": "YnrJNjZsLIhvldYHtkxKrA", "stars": 1.0, "useful": 3, "funny": 4, "cool": 1, "text": "I enjoy sushi and everything that makes sushi good sushi: the freshness, the flavor, the texture, and even the people that serve it to you.  I can't give half a star so one star will be my rating. Here, let me tell you why. I'll take a different approach and make a list just in case an employee there reads this and decides to help the restaurant out.\n\n1) Service with a smile:  It only takes 1 bad seed to ruin the whole crop. I've been here a few times because my friends enjoy this place (?), but the service here just doesn't fit any other sushi restaurant I've EVER been to. It says \"60 minute limit\" on their menu. They really must stick to the T on this one because after 60 minutes, they just ignore you and forget what you ordered.\n\n2) Flava-flaaaav!:  Hit or miss when it comes to the freshness of their fish.  Sometimes it's on, sometimes it's off.  Whenever I ordered my AYCE anywhere else, I get half orders (4 pieces instead of 8) just because I want to taste everything.  It's a recession, but it ain't worth giving someone the stomach flu or worst!\n\n3) HGTV: Watch it! Give the place a face lift with some paint or decorations. Some traditional Japanese lamps are always decorative. When my friends and I eat here, we're like 20 deep. We get the tables in the middle of restaurant put together and they're uneven and we're on display for everyone to see. I'm charging for pictures next time.\n\nHope this helps everyone. This isn't a review to knock the place but to give it some constructive criticism because face it. This is Las Vegas and everyone deserves good food with good service. We live in a DESERT, people! ;) Happy eating!", "date": "2010-10-21 06:57:52"}, {"review_id": "FZu6lvUo5639wdHUuxhFew", "user_id": "lyiYbPCwpLFBwwayvXMkbA", "business_id": "ZCe93zAkxr2KOBU1NT0lmg", "stars": 1.0, "useful": 0, "funny": 2, "cool": 0, "text": "There is nothing \"authentic\" about this place. The presentation is very nice but the taste is definitely not true. The people of Sonora...we don't use shredded cheese. Puro queso fresco.  If only that was the only set back. The enchilada sauce tasted straight out of the can. The black beans were so dry & stale. The chips were good, the salsa was not. Again, it was as if they opened a jar of Pace Picante & just poured it out. Hostess girls were a bit rude but waitress was totally nice & asked sufficiently if we needed anything. Her service was great. If you read the \"Tia Rita\" story, you know there's foul play at hand. Don't believe the hype. Its embarrassing they claim Sonoran authenticity.", "date": "2017-11-25 03:54:24"}, {"review_id": "PP6uUtFnFJG7SlabPF2HrA", "user_id": "XhuDpd83sub5eR_ouBuzTw", "business_id": "DqORaQfDFHCFIiG4g3d1-g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Very low quality sushi, I don't think I've ever had worse sushi in all of Toronto and that's not an exaggeration (grocery store sushi was better than what I was served earlier today). Definitely didn't expect anything fancy with this being a buffet, but the sushi rolls were 80% rice which was mushed together and flavourless. Even the miso soup was very watered down. To top it off I got food poisoning, which looking back should have been expected after eating at a place like this. Avoid at all costs!", "date": "2018-01-28 22:00:25"}, {"review_id": "Y5fFj_zLwV_mjYHt2p6wag", "user_id": "eyvl9CohZK3FZB74OY_hYw", "business_id": "d5iTt4hp4R8YZJj6K7X_mQ", "stars": 1.0, "useful": 9, "funny": 0, "cool": 1, "text": "My experience with Dr.Hurwitz was horrible. The staff was pleasant but not the Dr. When me and my finance walked into his office, he did not get up and greet us nor did he properly introduce himself. I did not feel our presence was welcomed. He just began asking me background information questions. It was apparent that he wasn't trying to get to know me. He was extremely sarcastic, like when he asked me what did I for a living and I explained to him that I help people in Crisis and where my work location was. He was like \"Oh there is definitely a lot of crisis in that area.\"  I was unsure what he meant by this, I took this as he was passing judgement on the population that resides in that area because that I said help people all over Allegheny County who are experiencing crisis's.  What really put the nail in the coffin was at the end of consultation, we are proceeding out of his office when he turns to me and says don't have anymore children. I was extremely offended about this. 1. I have never birth any children, 2. He was judging me by the way my body looked. 3. What if I was a woman who was trying to have children but I had suffered miscarriages. I honestly felt he was trying to turn me off intentionally, I truly was surprised that this individual with such prestige was so insensitive and rude.", "date": "2017-11-14 14:23:21"}, {"review_id": "d-mvLxGuEb2dq8Y1FeUAqw", "user_id": "rv6X1P5gvYFULMAfYALQ_A", "business_id": "prItzs_hMVptn34LxBDN7Q", "stars": 1.0, "useful": 0, "funny": 2, "cool": 0, "text": "I recently went to this Bank of America branch to address the concern that I have with Bank of America in general and the way that they are continuously charging fees\n\nI walked in and the person at the front who greets the customers stayed on the phone the entire time while I was waiting to be seen by either a teller or a personal banker which ever one could solve my problem.  I waited for him to finish up his phone call, during that period of time he was joking and laughing with the person on the phone and not talking business,  so right away I could tell that this is going to be a waste of time. I should've walked out right there but I was stupid and stayed around.\n\nNext I was seated with a personal banker who had a dual appointment with Bank of America and Merrill Lynch.\n\nI gave him my ATM card and asked that he look up my accounts. I have three checking accounts with Bank of America and one savings.  I wanted to see if there was a way I could still keep one of my smaller checking account even though I wasn't going to have a minimum $1500 in that account at all times.  I was experiencing an $18 per month fee which would basically make the account pointless because I was going to be paying more in fees than I was getting out of it.  I keep that checkbook in my bag to pay simple league fees for shooting.  Even though it's been years since I was in college, Bank of America made simple modifications in the past and changed this small account over to campus edge checking.  I find out it has done away with that now because they just want more fees.  Don't make enough money and they want to squeeze their customers more?\n\nThe only thing that this guy wanted to do was help me move my brokerage accounts and my profit-sharing and 401(k) over from Wells Fargo. I told him that I just wanted to avoid the $18 per month checking account fee on this 16 year old account THEN he had to get up and go talk to a branch manager. He came back he said that he and the branch manager talked about it because I don't have direct deposit or the minimum amount that they wanted that there was no way that they can help me.  It was basically ridiculous and Bank of America sucks for charging continuous fees for a customer that they have had since the 1990s.  If it wasn't so much trouble for me to change banks I would do it then I'd have to figure out a way to notify all of the companies that I have making automatic debits from my other checking accounts.  I'm half tempted to do it if this keeps up I think I will.", "date": "2013-12-18 20:54:32"}, {"review_id": "0_fNvdGYZd6bDRCaN1m8Pw", "user_id": "GgM-q7ycJlzSMXWDBMtc_A", "business_id": "EV1jAj7NFNmNIqOnwZ4Acw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I HAD been a long time customer(spend a Fri or Sat there every week religiously), had a horrible experience of being ignored by a bartender while he supplied his friends with free beer and flirting with females at the bar. Manager said he would call  me, never did!!!! Last weekend, my wife and i were in the area and i said \"hell its remodeled ,lets check it out again\"....walked in ,packed as always ....stood for about 30mins and i noticed a couple was paying their tab at a booth. Once they got up ,i went and sat down...the waitress came over and says \"the table is for them\" pointing at a couple that had JUST walked in, i told her the table was empty and i sat first and i had been standing for 30mins plus. She told me she was gonna wait on me and was going to call security, i got extremely upset and instead of causing a scene ,i took my wife and left. NEVER EVER will i go back to this establishment ,and i suggest you look elsewhere for your nightlife, this place has horrible horrendous service! #nevergoingback", "date": "2017-11-12 03:36:46"}, {"review_id": "yckvfQnbrHikc0w0N6oFng", "user_id": "K5GMYI6aWSdB_l1h5Onu-Q", "business_id": "UHAmYeo4aPzlNHbf_fqdUA", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I sit within  the wall of Chuck's and can see potential.. lots of potential... however the food has a far way to go.  Our small group of two made an order of calamari to be followed with a 10 Oz peppercorn steak with Fries for my wife and I chose something a bit lighter with a steak salad.  First let's start off with the calamari.  If you wanted want to call Costo freshly frozen calamari that was deep fried then seemingly hastily thrown onto some tomato based sauce restaurant quality we may have a difference of opinion.  I was hungry and didn't care that it tasted like prechewed 5 cent bubble gum from when I was a kid.  But moving along.  The main event... my steak salad first... the steak wasn't half bad.. cooked to order (medium) and delicately sliced and plated on a salad bonanza... however after looking closely, I realized that this salad was seemingly the exact composition of the prepackaged salad I can by at Sobey's.... coincidence... possibly.... my wife on the other hand had a very different experience.  Her 10 ounce peppercorn steak which was ordered as medium well was essentially still mooing at her during the first cut and oozing juices.  That and also the peppercorn sauce that was advertised was actually HP sauce with random peppercorns.  We eventually had to flag down a waitress to have them refire the steak, where they asked my wife to place her steak on a separate plate rather then take the entire plate away to correct the issue.  Upon return, the steak was correct however the waitress promptly removed the remaining plate and food from my wife to replace it with the steak alone... no sides...  at this point I think we both had our fill.  Chuck's has an OK atmosphere and staff are definately trying but the food has a lot to be desired when there are so many other options on the other side of the highway.", "date": "2016-03-25 01:55:11"}, {"review_id": "nYlcF_XDOiKTsqZR6mHIVw", "user_id": "-83s33R6DAJKlc6C5Wqzwg", "business_id": "o80WsixApYT1enf3AH6N2Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This restaurant looks very clean. The plaza that it is located in has been renovated and looks a thousand times better than it did previously. It contains limited seating inside; also it has separate in and out doors which seem rather annoying to me. As for the food it was disgusting and I'll never eat chicken and joy again.", "date": "2018-06-15 02:00:46"}, {"review_id": "NQyl1XzCHoevjlRIkcukWg", "user_id": "f0-jls14TN2sXhjLHkEc0A", "business_id": "xAG04HVxelFsDrQY-Te0xg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I will never buy firm thus store again. Firstly the Samsung Experience People couldn't help me and couldn't even get their software up to reboot my tablet. ....tgen when they did they couldn't figure  out why my tablet was stuck on the boot up......horrible people who don't know a thing about their products. I am in the store now and no person to be found to give me back my tablet....called fir the best But Manager and he is nowhere to be found either.....WTF.....horrible customer service from everyone....never will I buy from Samsung or Best Buy again.....hope their happy losing a customer for life.", "date": "2014-12-10 21:12:38"}, {"review_id": "_vjWr02r7nrJFYx63pGeiA", "user_id": "V-c5nf88nxc2tdMDvQBy5g", "business_id": "meG2hlQPCfeZ-JdvoG297g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Highly disappointed.\nPrior to ordering online I called to ask about their eclair, the lady confirmed me that it was a chocolate filled eclair.\nWhich when I got it wasn't.\nMy fries were cold, tasted old.\nAnd when I called back to tell them about my disappointment about my dessert, the guy sounded really \"bothered\" by my comment and said he couldn't do nothing about it because the owner wasn't there and when I asked him to get my number down he \"did it\" (who knows) and then hung up on me, no goodnight no nothing.\nSo now I ate cold old fries, and spent money on an eclair I won't eat.\nThat was a fail!!!!", "date": "2017-02-25 05:12:08"}, {"review_id": "mXIdELaFRuCzxIYpqeZPgA", "user_id": "2KVqIrpS9LCCwqy2O0bttw", "business_id": "rVgbF-_nZSeiCQQcCH810A", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Worst bank ever. Standing in line for 30 mins or more most of the time. No sense of urgency at all. There is always 2 tellers working with a line out to the door. Awful.", "date": "2015-12-14 22:12:59"}, {"review_id": "7UB_w0oj2pgEpQz97_ednQ", "user_id": "jBkrOY68c8JylXLGwMJ3oA", "business_id": "PM9_-eotWntTW7tLBCsScw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I went to this restaurant yesterday and paid two meals with drinks. When I arrived at the salad bar I was dismayed to find pasta smeared on the serving tray. I dug through the whole pile and didn't find a single clean one. I then looked at the plates and began to pick them up in every stack of plates and they were ALL greasy, had food on them and smudges of black oil of some kind on them. My hands were greasy just picking them up.\n\nI called for the manager and demanded my money back immediately and requested that she have all the plates and trays washed. The help and manager started picking through looking for an occasional clean-ish plate. When I saw this happening I told the manager that I would call the health department if she didn't remove all the dishes immediately.\n\nMy concern though is that all the food dishes may have been contaminated in the same manner. If you got sick there let me know.", "date": "2010-02-05 17:23:46"}, {"review_id": "5gqI9-mWQR4S8ftDYM8Fsw", "user_id": "iWRaGUlQzLhtJ_pvchqAyw", "business_id": "OGFBCNUHJ-182MbnV6NTvQ", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "My husband and I arrived at the Joint for a Santana concert two Saturdays ago only to find out the concert had been cancelled two months prior.  We received no notice that the concert had been cancelled.  Our tickets had been purchased in person and there was no request for information in case of cancellation.\n\nOur money was refunded but considering we had planned our entire trip around this concert we were not too pleased.  We were offered discount meal coupons (too late we ate right before) and awful drink coupons for well drinks in the worst bar in the casino.\n\nWe never heard why the concert was cancelled  but we won't be paying to see Santana or heading back to the Joint.", "date": "2009-09-09 01:25:09"}, {"review_id": "N7fbNYHtr5IDHQMkVKsxvw", "user_id": "k0HLHuKvusYC0x_jZEWntw", "business_id": "Wg4jlAgOUB51aX1c3ex9GQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "If I could give this restaurant less than one star I would. The service was extremely slow and the food was disgusting. The sushi was warm. The rolls were not rolled properly. They kept falling apart which made them difficult to eat. I had to stop eating because I was afraid I was going to get sick.", "date": "2017-08-03 20:03:12"}, {"review_id": "1be8XLP7TSIueZWpYATt2w", "user_id": "Zoec9wehLFa8CV1JnCCVug", "business_id": "pimxVJg4rJORyIe6lPv6cA", "stars": 1.0, "useful": 9, "funny": 1, "cool": 0, "text": "Disappointing experience. I guess this is what you get if you go there with Groupon coupon.  Everything is rushed. No base coat for manicure and pedicure. No attention how long you are exposed to UV light as I had a Shellac treatment, wondering if the spa is certified for Shallac at all. Top coat only for the manicure. Flip flops are reused by the customers. Instrument to cut cuticles was taken out of a drawer and sprayed in front of me with some disinfectant. One of my fingers anyway ended bleeding although I requested to push the cuticles for the manicure. And I can continue ....... I booked my second Groupon appointment, but I'm not going. There are better places in Montreal to pamper yourself, with or without coupons.", "date": "2013-09-15 13:52:03"}, {"review_id": "nvzi_-C6deNysEPnjfWJYA", "user_id": "lQrwpRSQ_lrcVy-e5MeYJA", "business_id": "H8RPjZJMrDC7nNcx2S6nHQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I just moved to ARIZONA from So Cal. I bought a home, and needed to furnish a bedroom. I decided to shop at Living Spaces in Scottsdale. \nThey advertise being able to deliver same day, even on line. All that is required, is you order before 4 pm.\nI made my purchase on a Thursday, and was told my items wouldn't be available till the following Monday. I didn't think too much of it because I was in no real hurry. \nWhen Monday came, my furniture was delivered at approximately 9:30 am. After the installers were here for about one half hour, I was told that the bed was missing a part necessary for assembly, and left. They said they would contact customer service. \nI call customer service myself in frustration, because I noticed the installers didn't deliver the mattress. \nThe customer service lady told me she had been contacted by her installers, and someone would be at my home by midnight at the latest to deliver the missing parts, and assemble the bed. I also told her that the mattress wasn't delivered. She said I'd have it also by midnight. \nI reminded her that her company boasts about being able to deliver same day, and asked her to account for that. She couldn't. She did waive the $100.00 delivery fee. \nAbout an hour later, the same installers arrived with my mattress. They said they forgot!\nI'm an early to bed, early to rise kind of guy. Not only can't I go anywhere all day. I can't go to sleep when I want to. \nDon't get me wrong, $100.00 is not bad, I just think my time is worth more.  \nIf you should go to Living Spaces, make sure you press them to live up to their claims. It's theirs, and as far as I'm concern, they will live up to it!\nThe delivery arrived at about 7:30 pm. They had the parts needed to complete the bed. After about 10 minutes, one of the men asked me if I had any tools. I provided him with a cordless drill, and the job was done. Approximately 10 minutes after that, the head guy told me that the bed needed to have a solid base, because this \"Kennedy\" bed does not require a box spring. He said the Four 4 \"slats\" the bed came with were too far apart, and the mattress would ripple in time with the slats in place. He went on to advise me that if it were him, he would require a solid base, such as ply wood. As a result, he said he would not be able to install the mattress. The two men returned my tools and departed. \nI called customer service, and told them my dilemma. After explaining my situation, I was told that I needed a \"bunkie board\", at a cost of $70.00. Additionally, I was told it would not be available till Saturday. \nAfter a lot of complaining, the cost was reduced to $35.00, then free. \nAgain. If you shop there make sure they have everything in place, in stock before you pay them.\nI forget to mention, the night stand I ordered, never came with the four posts that hold a shelf up. I called customer service, and told them I was missing them. They assured me they would be sent, via UPS. It's approximately 4 weeks later. Still haven't received them. Another wild promise. I had to go the hardware store, and buy them myself.", "date": "2014-07-21 19:32:17"}, {"review_id": "YO4F_5CGiEEFjkoJEiaCQA", "user_id": "xn_S4mtDjJbtRNKlYbt4PQ", "business_id": "p9wsRYjSo4yIb14ijaNEnA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have friends who love this place, and the food can be good. But my personal interactions with them have been not so great :(", "date": "2012-04-11 05:01:36"}]