[{"review_id": "-3OrxTWurMbpI4b9W3-nwA", "user_id": "iJLT9YMdRzsnL6iLwZW1tg", "business_id": "82TLb6WP9VOyi_l24XHThA", "stars": 2.0, "useful": 1, "funny": 1, "cool": 1, "text": "At first glance, this Target looks really cool! Located in the Steelyard Commons, it has a unique architectural design and lots of spanning windows and doors in the front. However, I was quickly disappointed upon entering the store.\n\nWhen you walk in, you see lots of bins filled with random odds and ends. It's such a mess and so unappealing that I wouldn't be surprised if some people just turn around and leave. Some areas are organized, but the majority of the store seems to have no order whatsoever. There is a nice Starbucks inside the store with a large seating area and windows, which would be a cool spot to hang out or take a break from shopping if the customer service wasn't so horrible there. The filthy bathroom at this Target is what really put me over the edge. Every single stall was trashed. Overflowing toilets, paper and garbage everywhere, flies buzzing around, just completely disgusting! I promptly left after encountering the bathroom situation.\n\nNot one of the better Targets I've been to. I wouldn't recommend it if you are turned off by messy and disorganized stores. To be honest though, the entire Steelyard Commons Plaza and all of its stores seem to be declining in quality.", "date": "2018-06-04 15:12:50"}, {"review_id": "jJwJYf7jCiNBw3OkcFHOtA", "user_id": "LXQRqJ_IVaJ0G4GkrFyEkQ", "business_id": "WbJ1LRQdOuYYlRLyTkuuxw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I went there last night for our 17th anniversary. For $18 I was looking forward to the buttermilk chicken and it was AWFUL  wasn't no flavor and it wasn't crispy at all. For $18 you get a chicken breast and two sides and I was expecting a lot more for that price. I must admit the fries and macaroni and cheese was great and that's about it.  Too much hype for that place.", "date": "2018-01-28 16:03:06"}, {"review_id": "p6rf0sj0qwVQUh-wzuHUkQ", "user_id": "dlLc_CdnKKj6V8KwP9d5tw", "business_id": "cOJ1uIVIHCiefUyWG2wDfw", "stars": 2.0, "useful": 2, "funny": 2, "cool": 0, "text": "Horrible! Horrible! You would think a spot like this would be amazing, let alone it was pretty hidden/dark spot of Las Vegas. The outside looked like the place was closed. We continued to go inside and it was empty on a late Friday night. Ambiance was cute though. This is a WARNING! You get a free cocktail/drink when you check in on Yelp. They had their holiday special cocktail drink and lets just say luckily it was free because it tasted terrible! it was either too sweet or tasted like medicine. Obviously the bartender did not know how to mix drinks at all. They messed up my friends \"red headed slut\" drink the bartender had added Redbull and my friend had to coach the waiter to tell the bartender to never ever have Redbull in a red headed slut. The only thing i enjoy was the Seared Salmon.. to me it was great. To my group of friends they ordered the Bootlegger Strip Steak (dry even ordered it on Medium), \n'Speakeasy' Steak Sandwich (dry),  Shrimp and Lobster Roll (nothing special), Blind Pig Chopped (plain) and Stozzapretti Pasta (was okay).", "date": "2015-11-13 01:12:01"}, {"review_id": "nsxTah7J8DAil4vmtdiPUQ", "user_id": "Qh05Ot21Tr0Z6hjf4vgB7w", "business_id": "P4lfCI0WSaVoA2VFdsZRiQ", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "This was my fourth visit to Six Penn and my first with a less than satisfactory meal. My martini was good, the wedge salad was delicious but my entree and dessert were not so good. I had the Short ribs and substituted mashed potatoes for ravioli - mashed potatoes and veggies were good but the meat was very tough, not at all what you would expect for short ribs - chewy and very fatty. \nFor dessert I tried the chocolate truffle cake - it was very dry and tasted as if it had been around for a few days. The service was very good, our server was very attentive and friendly. My fellow diners enjoyed their entrees of trout and surf and turf (steak w/crab cake).", "date": "2014-01-27 16:15:34"}, {"review_id": "kHn0io4ROh8VAZiej_JNoQ", "user_id": "5TsBpJRvxCA54ELkQLIphg", "business_id": "Z8LsYdX-4wJxbi-x4GV3xA", "stars": 2.0, "useful": 9, "funny": 6, "cool": 1, "text": "20 years ago I probably would have gone with five stars, but its important that people understand what this is.  First of all, the scenery is wonderful.  I saw wild horses and eagles etc...  But I went on a hot Saturday afternoon, and the wildlife that I saw in the tubes was far more extreme than the wildlife that was on the banks and in the air.\n\nBeware if you bring kids.  I don't have any, so this is seldom a concern of mine but the swearing, cussing, crude behavior (everybody brags about just peeing where they stand) and just out and out \"trashy\" behavior would really turn off the average guy.  \n\nOne out of every 50 girls should be wearing the bikini's that are everywhere.  The other 49 should really just wear a normal suit.  Really ladies...there's nothing wrong with a normal bathing suit.  You don't need to compete.  We don't really need to see every one of the tatoos that you have.   But if you keep your eyes open you may see something rarer than a red-headed mockingbird.  There are some very attractive people hidden in the masses.  But some of them may still fool you and you'll realize its a disguise when they open their mouths and you hear \"Hey @$$H073...where's the M07&%FU3&I@G cooler at?\" Or any one of a number of profanities that really just kind ruin everything.\n\nPlus, its packed.  You can be wrapped up on the river with 50 other tubes on a Saturday.  And if you're not enjoying the company of the people around you, you're kinda stuck with them for a bit.  \n\nSo beware.  If you're all about being crude and pissing in the water and getting into a fight because some drunk guy didnt like the way that you looked in his direction, then its a great time.  I had a decent time.  I don't have problems with people and I live and let live.  But I wouldnt want to take my niece and nephew.\n\nThere's a time and a place for this kind of fun.  If its your kinda thing, do it.  Its a frat party on the river.  Just don't drink the water.", "date": "2012-07-24 18:33:37"}, {"review_id": "Vebw_rkzTR3R8bLIi1KpTg", "user_id": "c3mxglAXMXjfqDeC5IoR6Q", "business_id": "tQm5R5UsWBzxsOGLPjfLJQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Took almost two hours for delivery, spent 70 bucks on barely any food so I'm surprised the money is  two $$ signs. Because we barely got shit. Didn't even come with a side of rice or soup or salad. Nothing. And the sushi we ordered? Never again. Tiny as hell pieces, that were soggy and my husband and I tried a bite, had too throw them away, it was obviously old. Wasted money, and time on shitty barely any food, slow ass service. Thanks, not doing this place again. I'll get my sushi from frys, the grocery store next time, they are better tasting, more fresh, and bigger better pieces.", "date": "2017-04-04 23:57:08"}, {"review_id": "igWAX9_43yh2QGp5ocCnvQ", "user_id": "ifflfwmK6C7Fd7_7luevvQ", "business_id": "dhklnXf37sWL4uoOaWuc0A", "stars": 2.0, "useful": 10, "funny": 5, "cool": 0, "text": "I used to frequent this dive during undergrad, before the renovations and when it was \"less fancy\" so that should tell ya somethin. \n\nI've done and seen it all here: bar sanctioned drinking contests; thrown out for no apparent reason; couples getting their freak on the dance floor and all sort's of debauchery I don't care to rehash. Anyway last time I dropped in to meet someone I felt terribly out of place. \n\nThere's always been a rumour this place recycles draft beer which was reported by the Star years ago, resulting in a suspended liquor license for a few weeks. \n\nThis Brunny is a right of passage for the 1% of U of T students who like to party while the remainder prefer to study at Robarts Library till past 10:00 on a friday night. If you want \"Animal House\" this place is for you.", "date": "2014-01-10 18:51:46"}, {"review_id": "FRNPjK65sZQn1Ej4IynMbg", "user_id": "3_2GuB1VDraEpljRlGiOig", "business_id": "P6l-uuN3v4Z6WEAkSLV_ug", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I like this store for many reasons. They carry Boars Head in the deli, the best fresh bread and donuts abd a good meat department. So the shopping experience is good until you reach the checkout. They have a woman ringing customers who is just a nasty old bag who ruins the whole shopping experience. She acts like she's doing you a tremendous favor by ringing up your sale. She is always having a personal conversation with whoever may be hanging around so you are basically ignored when you first walk up to the checkout and then she will continue to talk while she's ringing the sale. Its the stores last chance to leave an impression on their customer and they fail miserably.. Baxk to Frys i guess..", "date": "2018-09-09 16:01:36"}, {"review_id": "P12PIf_kyEMQwCWQBlWEkA", "user_id": "l1kcUw3h7_61R6V_7Y6_1A", "business_id": "vl1aHp6pvnSmpoRQShWLjg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Still not impressed with this location..... Next time I will drive all the way across town to the green valley location because for some reason this location can't seem to get it together..... Called in ordered my regular and asked for the beef ribs to be extra burnt.... I get there to pick up an nobody seemed to be working the take out counter.... There was a woman ahead of me that said she had been waiting for over 10 min and still nobody had even acknowledged her so when I saw a waitress walking by I asked her if anyone was working the window she told me this on shell get someone and after another 6 min yes I checked my phone someone finally did show up...  Now, why should people that call in orders to go have to wait another 16 min or longer to pay for their order that is sitting ready waiting to go getting cold just waiting for it to be paid for???? I'm not impressed with the to go aspect of this store....", "date": "2017-02-03 22:15:15"}, {"review_id": "RWOIFQV9utWnJU2gY9-odA", "user_id": "krK3nPLQ27BdQ2q4mZm0HA", "business_id": "QlAPX3c0Vm2dU_w3puIAIw", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Did the restaurant change owners? The front desk is now in the back by the kitchen and the menus have been redone. The prices have gone up another $1-$2 per hotpot and the initial offerings of the starter plate is meager compared to what used to be offered in the past. I noticed the workers referring to the menu several times. \n\nI ordered the thai hot sour broth and it was mixed with the szechwan spicy broth. Pepper flakes filled the pot and I wasn't up to eating something spicy due to being sick from a cold. The buffet cart of sauces and noodles is still available. \n\nMy milk bubble tea came straight out of the fridge...yum...premade and soggy tapioca bubbles. \n\nWe were given an extra starter plate and had it taken away after the hot pot came out. That plate was placed back into the fridge!", "date": "2016-12-28 17:58:27"}, {"review_id": "Gw6Zw1CvDXFq3gGCyrVN4w", "user_id": "1SErVsW2wd6dazgH7XIzMg", "business_id": "2hZsf8KlYbwUPlo-ZKA85g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely a disappointing place to go. The subs were mediocrely made and the customer service was absolutely horrible. It's really hard to order food when and the person behind the counter does not know how to speak English. Usually that's not an issue as I can communicate fairly well but she was extremely rude about it. In conclusion never again.", "date": "2015-06-02 19:15:39"}, {"review_id": "_ZmN-5FXOUEyTNKlfDjPyQ", "user_id": "sVkbaPMRWAVvmX5P922ODQ", "business_id": "h23R_mGy3ZdKlOYj57bheQ", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "When I think of Westins, I think of business-classy, nice and modern. This hotel has a classic feel to it, but definitely not very updated. Unfortunately, it reminds me of the staid-ness of Pittsburgh too much.\n\nThe check-in desk was super slow during my stay there. I do like the fact that there's a Fish Market downstairs. I don't like the fact that it's the convention center hotel, so it can get pretty crowded. That said, it's within walking distance to the Strip, and Downtown, so you can't deny the convenience. Still, I think there are newer hotels that provide the same.", "date": "2010-02-06 06:14:06"}, {"review_id": "y310r4JEdWWW04qLUwrlCg", "user_id": "Q9e2ExgPQHGsFQ43f51U-w", "business_id": "XqnU7v40rpT-4O9b3deCag", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "My son and I wanted a good burger and Moxie's is amongst the best. Very busy however we were able to get a table. Waitress was very quick to give menus and take our drink order. We both ordered pop and our burgers arrived promptly by another server. We never saw the waitress again. No one came back and asked if we wanted anything else and then we waited for our bill. We waited some more  In total we waited for about 25 mins and finally asked the hostess to please get our bill. The food was fantastic but by far the worst service I have ever encountered.", "date": "2017-09-17 01:15:27"}, {"review_id": "o82r07oEZ-cWAX-r5tFmBQ", "user_id": "Qn5xtI3IXaZapsTk7Ku1NQ", "business_id": "5G6tkZu1h-M08tip2V_6oA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "To be honest,This is the best asian desserts I could find in downtown area. But there are many others in Scarborough which are way better. It offers a variety of desserts and the taste is more taiwanese than cantonese,so I assume it's a taiwanese dessert restaurant. I used to like it so much but it really disappoints me recently. I just found out some of their food are made by reheating. I have tried their Sweet Sago Cream with Coconut Milk, but the coconut mike tastes like water plus condensed milk. And Just a reminder, never try things other than desserts here....", "date": "2015-11-01 03:18:40"}, {"review_id": "qz0zFAY0UeDcG-42vKhf9g", "user_id": "UbkqCOncOPD85z1iEbTMPg", "business_id": "Y1B4tp8ZZzz_ISv16wkaNA", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "We have been to this Olive Garden several times and generally the food and service have been good.  Last night, however, was a different story.  The Chicken Alfredo was not creamy, but rather an oily mess and the Shrimp Primavera was so spicy that my husband could not finish it.  The server was OK, but seemed to be rushing us.  We still had about half our appetizers on our plates when she came by and said she would take the plates away forcing me to ask for a few extra minutes.  Then, instead of waiting for us to ask for our check, she just dropped it on the table when it was convenient for her.  We were with my son and his girlfriend and wanted to enjoy our time together, not be rushed .", "date": "2011-12-20 00:06:24"}, {"review_id": "-SDz73Wd3c4vT3mrU0ycVg", "user_id": "z86r3D_bX7Gxm-VguSgyrQ", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Over priced! $102 with tax for 2 people at dinner.\n\nVery limited options and food is average.\nSome food had been out so long it has a dry crust on the top and the desserts were pretty rubbish.\n\nThis place tries to be fancy - fancy and buffet don't go together. They need to up their game in the Las Vegas buffet world!", "date": "2017-09-14 01:01:20"}, {"review_id": "r_rakoc7aBIQszxL48bb8Q", "user_id": "SGel6ZoCrB6YNo1pS1KCHw", "business_id": "qDOmZGSjF22RaaUYnePZWg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place used to be the best! I have been going to this place for over 15 years but the quality of the food has diminished drastically. Nothing was fresh, over salted, the egg roll wasn't the same, and my soup was cold- not even warm. Not to mention I am extremely sick the next day, coincidence? Maybe not, but sadly I won't ever go back now.", "date": "2016-02-18 18:19:45"}, {"review_id": "pIvaLyUmdsgqS7SpAfq3Jg", "user_id": "c3ARt4Be0_BzmePHGoeLBA", "business_id": "Mjrkc3Uz_l6KF43g5_NYmg", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Very disappointed in the customer service.  Felt we had a bait and switch situation, was brought up to high management and all they said was \"you signed the contract and you have to abide by it\".  I was, also, very disappointed in the personal training.  I was given a list of workouts and all they did was stand over me and count.  I could have looked up some exercise online and I do know how to count.  This was, also, brought to management's attention and no actions were done to address this or even offer to change to another trainer.  I do like the various machines and the basic layout.  I hardly ever had to wait to use equipment to open up.  I have to say, though, not many people wipe down machine when they are done.  This even applies to the trainers.  Gross!  Another reviewer stated they went to the other  gym in the close vicinity, so did we.  It is a lot cheaper with more benefits, too.", "date": "2017-08-13 23:55:16"}, {"review_id": "TbPjR9JC6aZqhC8xBkL1eA", "user_id": "_cNECLpaFPgqSIsHDMu42w", "business_id": "50tjBMTlIbFBxjTRXAVZHQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "This used to be a great spot to grab coffee and go! Even if there was a line, it would move pretty quick. Lately however, their lines are outrageously long and they don't move! I'm not sure if there is new management or what but something isn't working and it needs to be corrected.", "date": "2017-09-04 04:01:29"}, {"review_id": "VD_Aqg5r90iwSTYnUmdfVg", "user_id": "Mi5HCdbBhYgzUl8NKidbmQ", "business_id": "p_XtmpNFVlUClWdjBVWKlw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Manager refused to allow me to get a better view of the animal, but most of them looked healthy.", "date": "2014-02-17 00:12:54"}, {"review_id": "ZDxfyQhOa4Yc5Ios6gaLmQ", "user_id": "lkvzrSbL8GJmMcSuG17gpg", "business_id": "35JjuQ6nsSNshtt5hyLUCQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was ok but the service was very slow and the music was too loud. It's a little over priced as well.", "date": "2012-01-19 13:28:05"}, {"review_id": "SFdTQa7zTtNRJMfkLI3MfQ", "user_id": "436L0E4hwLJGEFafQhtC6g", "business_id": "0QzCeORfF8EY34UODWRV9A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went here to the movie theater.   I wanted to see what all the hype was with the \"luxury\" seating.   \n\nWalking through the casino is a maze with signs that give the wrong directions.   Employees seem tired and short with customers.\n\nAt the theater:   The ticket counter opened just 5 minutes before my movie started .. I missed the upcoming attractions and was bummed.   I actually like to see what movies will be coming out shortly.\n\nThe concessions have become more like a fast food restaurant, offering everything from  pizza, hotdogs, hamburgers to popcorn, candy and even ice cream.  The prices are quite inflated, and you aren't allowed to bring in anything from the outside.   If you like to spend a lot for a pizza and beer, you'll love it.\n\nThe \"luxury\" includes a new menu of alcoholic drinks and leather recliners.   The recliners are comfortable, but can get warm to sit in for so long.\n\nI'm not a fan and won't be back.  The increased price for 'luxury' can cover an extra ticket at a theater that is friendly.", "date": "2017-05-05 01:28:40"}, {"review_id": "1RTAh-BMaUqWr-2BKEUoeg", "user_id": "VqPGYmAqzugiT_kV8Q1q2w", "business_id": "gOpOoZgrF2shRLCBBzO3Mw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I've been coming here for a few years, always loved the carne asada burritos but over the last few months the quality and consistency of the food has been fluctuating.  \n\nToday was the last time I'll go unfortunately.  I am very sensitive to liver and kidney flavors and there was definitely something wrong with the meat today.  Far worse than its been before.  I almost threw up because of the pungent taste.  \n\nWhy two stars?  Because maybe it was just bad meat today or cross contamination with some other meats.  Sorry Burrito Shack, I won't be coming back.", "date": "2015-12-14 15:31:40"}, {"review_id": "qGenqSYElRr-ebuUd6FKaQ", "user_id": "b9Oy1NqpKh7eIoJimA3FYg", "business_id": "Y6q0K1fJa0Hy1AK3y9BzIg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "The good: nice, new, modern looking casual restaurant. Very friendly staff.\n\nThe bad: only enough seating for 8 people. I'm not sure how you can have a successful quickserve restaurant like this with so little seating.  The food was not right - I ordered a combo plate with hamburger steak (tasty patty, but no gravy! what hawaiian hamburger steak comes with no gravy?) and chicken katsu (very odd; it had a thin batter coating instead of panko - so it was more like a chicken jun or something. and again, no sauce).  The mac salad wasn't right - by time I got home the heat and moisture in the take out box had reduced it to macaroni floating in a watery, milky colored puddle.\n\nI didn't try any, but the various sushiburrito rolls looked interesting (a lot of them had the cooked hawaiian bbq meats in them)", "date": "2018-03-29 19:54:41"}, {"review_id": "Kfic13g32bHFezdu7cc8aA", "user_id": "93rlPm_NXdz9XPRMIFi-Iw", "business_id": "p3qjmdZZFEMOTWJjmdTa3Q", "stars": 2.0, "useful": 5, "funny": 3, "cool": 0, "text": "No where to sit. So expensive. Not that picturesque. \n\nIt's a novelty sure but i definitely wouldnt go again. It was fun watching the nice staff make it though. They must have strong arms from making this. \n\nBut next time I'd rather get yummier ice cream for cheaper literally anywhere...", "date": "2017-04-02 23:04:32"}, {"review_id": "xENOm1geN9nQ0N0gKiubsQ", "user_id": "OCML1lNxRlJgNDUEbtGr7Q", "business_id": "YPavuOh2XsnRbLfl0DH2lQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "My friend raved about this place so I tried it when I was in the area. The service was sloooow. The food was just okay. And the music was too loud. I've never had chicken and waffles and was expecting something a little more unique that what I can prepare at home. Did I mention the service was slow?? I don't think I'd choose to go back here again on my own. Only if a friend begged me to.", "date": "2017-07-04 02:26:13"}, {"review_id": "sqcpHzqOhz1Dyeu3Oh2beg", "user_id": "DCgkqAc0s3t68hLj7fiVKQ", "business_id": "c5CWmwh0-WFIjn8_V2DECQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Left without ordering.  Waitress played with her hair, couldn't explain any beer on menu and was totally clueless. Beer menu printed extremely small print. No fountain drinks so if your the designated driver you are out of luck.  Dissatisfied", "date": "2017-02-02 01:15:22"}, {"review_id": "f0L1Gzcxet6LadXffXPZ3Q", "user_id": "UV4iIu0CqfIgLlpNLvt5ZA", "business_id": "5XX1w4WbwSlrACQ5vKuLDw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Walked into the place very hungry so everything should taste great. Not so fast. First it was a display of poor hygiene by waiter who had to rub his inner nose with his fingers. Next up the bathroom, the dirtiest, nastiest bathroom in north america. Food itself was nothing spectacular. Quite the ordinary fare. In short it fits well within the china town establishments, not necessarily targeted toward western customers.", "date": "2018-06-25 03:06:24"}, {"review_id": "4CO9FfMZkH107gs4dGwsBQ", "user_id": "X5whw8WcB8dVZGZ5vGnSLg", "business_id": "IZzJaZWvw-IUrOLkP09JRQ", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "I went to this place having heard that the one and only Michael Jackson (of beer connoisseur fame - not jackson 5/alleged child molestation fame) gave it high marks as one of the best places in Toronto to get Belgian beers. Apparently he didn't get out here much..\n\nTheir Belgian beer list ain't too thrilling. Its on a specialty beer board of about a dozen or so beers, not all of which are belgian, and they are all  bottled. To make matters worse, its annoyingly on the wall past the bar, so you have to walk into the dining area where people are eating dinner just to have a look at it. The list isn't good. None of the familiar favourites: no westmalle, no mort subite, no gulden draak, nothing. I had some wheat beer called whittererke or something and it was bland. And the beer is expensive at over $10.\n\nTo be fair, this place probably is better known for their scotch. It looks like a pretty impressive list (at least 75 different ones and probably more, with vintages/reserves), but i'm not at the scotch appreciation stage in my life yet so, whatever.\n\nI didn't eat any food there or sit on the back patio, but the whole place has kind of a restaurant vibe, not a bar/pub vibe. It smells like seafood in there, and I bet they have some good fish entrees.\n\nNot sure I will return here.", "date": "2010-06-10 01:41:27"}, {"review_id": "sQoGOCuKaQFyCuOh_j_fkg", "user_id": "XkJGRNb2aweqzbEK9JqzfA", "business_id": "ujNMgbk7n6Z0dtCxZkJgHQ", "stars": 2.0, "useful": 1, "funny": 1, "cool": 0, "text": "Hired 2 cleaners for 2 hours to clean an empty condo.  When I arrived about 3 days after the cleaning, the place looked pretty much the same as before, minus the alcohol, spare light bulbs and cleaning supplies the previous tenants left behind.  I was told that it was usual to take everything out of the cabinets for the new tenants.  How about 'if it is not yours, don't take it' policy?  Obviously, it was not garbage.  \n\nI gave 2 stars because they did clean the oven and the fridge and a few drawers, but other then that, I am not sure what else they did for 2 hours.  After walking around the newly cleaned condo with bare feet for 30 minutes, my feet were black!  They did offer to come back and clean again, but after their first performance, I figured it wasn't worth my time.  Never again.", "date": "2014-11-22 01:04:15"}, {"review_id": "hTOX8OHFDyVN2G-iZO8fig", "user_id": "2PVNGsabcd2ROIusoBeMDg", "business_id": "RTegy5CUBpMK65pr8UeDgA", "stars": 2.0, "useful": 5, "funny": 0, "cool": 0, "text": "It's a shame. Disappointed.  I wish they would stop changing the Happy Hour menu.\nIn my opinion, they used to have the best HH menu in all of AZ.  They have now changed it yet again, doubled in prices, and the selections were unworthy.\n  \nNot sure why they always try to fix what is not broken.\n\nPlease bring back the Chicken Drumettes with the honey bourbon sauce, the Artisan Grilled Cheese with the brie and fig jam, and The Prime Rib Dip which was to die for.", "date": "2014-03-27 00:40:05"}, {"review_id": "wXWOhqT-Jxm71nzWla8ESQ", "user_id": "Xan8SW434N5yZGcDUPCs9Q", "business_id": "UM07j7HtW-dhr8Gq3LQLxg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ok food - very expensive for the portions and busy - crazy busy on weekend - more a bar feel.. did not enjoy - live music sometimes outside - very loud", "date": "2015-09-06 05:54:42"}, {"review_id": "M8ofvbc45sLZNecAkU9KeQ", "user_id": "cOjYcnvZbBZpn0H7PfNeuA", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 2.0, "useful": 13, "funny": 12, "cool": 6, "text": "I like to start off by saying I haven't yelped in over a year, but my experience last weekend convinced me otherwise. Good job XS, I'm back on yelp.  \n\nThis place gets a lot of hype and rightfully so. The venue is what I call a hot girl-crazy paradox.  Since its inception, what's not to love about her? XS is sexy, gorgeous & attractive. Everyone wants to sample it... even if it means paying a premium price, but people (me included) tend to be blind-sighted when their smarter friends warn you otherwise. \n\nChilling in the room, reminiscing how awesome the previous nights were (side note: the wraparound balcony suite at the cosmopolitan deserves a well 10 star out of 5 review... but that's a different story), one of my best friend says, \"hey, we should all go to XS tonight, I'll buy 4 tickets online. Avicii will be there\". Yup, with house/trance being the mainstream these days, when you hear Avicii, Tiesto, or Gareth Emery... people like my friends automatically think it's going to be a good night. \n\nIt was 9:30pm. We did the usual XS protocols. Go in before rush hour to get the usual two stamps... 1) for being 21+ 2) the other for re-entry. I like to address the ladder stamp being the most important. With their low quality stamp ink pads, make sure you get a FULL stamp. Not 1/3... not even half...  not ... but a FULL stamp. Let me repeat that again... a FULL STAMP (like the ones you get at Disneyland)  \n\nLater that night in the re-entry way, the security claims that my stamp wasn't clear enough for the club and that I had to immediately go back to general admission to purchase a new ticket. At that moment, I had the hot girl-crazy paradox epiphany... the illusion glass of hotness suddenly shattered and my realization of XS began.\n\n \n1) XS's extra small dance floor\n2) XS's poor handle of crowd control\n3) XS's poor quality in bottle services \n4) XS's $19 red bull vodkas\n5) XS's poor judgment in the definition of Excess. \n\n\nLike a hot-crazy girl, if you haven't experienced XS yet, you have to try it. It's something everyone must do and say, \"yup... I done it\"; however, if the next time is going to be your 10th... stop while you're ahead. Keep the legendary memories behind you and don't let it get tainted with the XS it is now: overcrowded, overpriced and most of all... overhyped. \n\nI'm back Yelpers. I'm back.", "date": "2012-07-09 21:59:33"}, {"review_id": "QxckYKYjkUOzzQA7zPA4cw", "user_id": "ex4XYmJauI3kXvR3NVNckA", "business_id": "YC8Llp3jlgKh8b-czHedHg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time that we went to this show It was really good. Everything you expect and see in video clips. \nThe room wasn't full, we went with my friends that came out of town i had bought balcony tickets but they sat us in the back by the bar the usher with the name tag of Reyna asked us if we wanted to move closer to the stage where there were empty seats she said she could if we gave her $10 each which i thought was super weird i told her we didn't have cash just our cards \nShe moved the couple besides us closer to stage. \nNo one told us at the front that we can \"upgrade\" seats i just thought It was weird that she was asking for money and not where we got our tickets. \nRegardless of this mishap and super awkward experience \nI would recommend seeing this show. \nNext time I'll just ask for a manager in charge.", "date": "2018-01-25 19:09:14"}, {"review_id": "hFcSEBuo6zGCIuTpQvdSyA", "user_id": "zwhty_ZmxbHAHoDfMjNbag", "business_id": "Nu_NR4pAH3sKHIOq2TM2og", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "We wanted to grab something sorta-kinda healthy and fast and this Tropical Smoothie Cafe was the nearest option.  Not impressed by this location.  Only one staff member to take orders/make food/operate cash register/clean interior.  Granted, it wasn't busy when we dropped by (there were 3 other customers ahead of us), but what if the place got BUSY?  Disaster.  The floors were kind of dirty, the bathroom was not acceptable (weird smell inside and felt \"sticky\"--doorknobs/taps), and tabletops were hit and miss.  Our food was good, though, so that was a plus.  It is just unfortunate that so many other details were ignored due to understaffing and neglect.", "date": "2014-10-03 22:27:30"}, {"review_id": "Vi47Hrl_4Xn00S-nzVoQIQ", "user_id": "Xb4aKpOlHkp9dmgTa__Q4g", "business_id": "vCjX7hK0Aq1d8KcrhwwxTw", "stars": 2.0, "useful": 3, "funny": 3, "cool": 1, "text": "Never ever again.  I'll just drive to Terrible's in Summerlin.   The guys washing your car are to busy looking at babes and the inside was still dirty from dust storm.... I don't understand why you can't pump gas, pay with card and drive on thru wash... They make u wash, then say what you want pumped then sit and wait and pay after ... So weird and seriously was completely appalled that there was a dude that said excuse me Miss see the nicks in your windshield with summer coming and the weather changing youre going to need a new windshield ... For XYX$$$$ I can fix it in three mins.....ARE YOU KIDDING ME?  How many naïve men or women have been ripped off this way?!??   BONKERS ANNOYED!!!!", "date": "2015-05-20 19:02:52"}, {"review_id": "08qozDCATCK0X0pVU615xw", "user_id": "3k2r145akirQKCgWSr4ICQ", "business_id": "4ggOHxvlxnF0a00hDDVbnQ", "stars": 2.0, "useful": 5, "funny": 0, "cool": 0, "text": "My family visited on a Tuesday night; NOT busy yet impossible to get service! Server ordered wrong entree' for me AND my son and was upset we wanted it fixed right! Mine was entirely wrong; my son TRIED to eat the HOT wings he was given even though he ordered BBQ! Refills were non-existent. Too bad the food is pretty decent bar food for the $$$ but if you get bad service it is tough to consider going back when you have similiar restaurants locally that you can go to from where we live. I contacted Sunny Jim's but was ignored; so they have lost three customers with their lack of customer consideration.", "date": "2011-03-31 15:59:14"}, {"review_id": "wLWMszGxiwxoUbtZ46HmMw", "user_id": "-HBJ-PmgGFVWS5HlfTqsTA", "business_id": "4CeOssI4EQ8BnjpUM5wFzg", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "All I can say is we paid for all you can eat...canceled our orders halfway and left to go somewhere else. \n\nI mean there were some decent items but alot of time they were flavorless and poor quality. So if you want to just have a place to full yourself up, come here.", "date": "2014-07-05 03:34:31"}, {"review_id": "cVYRiMlWtCw9gTJ5nSjf0g", "user_id": "aQQola-wPiC8Y6Js_Z10hQ", "business_id": "Wj1yPG74S_vkCMspcSmH9g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this pub but the food is not great and everytime I go there they have karaoke which is annoying. Ban the karoke and i would give this place a 4/5", "date": "2012-08-30 02:56:51"}, {"review_id": "IXcakbDR9ne4s1v2mHM5IA", "user_id": "ExN5AOzJe9AqnSwf162uIw", "business_id": "UXDoc76N59G6p3RUH5S--w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "It wasn't the greatest food. They fried the onion rings with the fish. The prices was way too high.", "date": "2014-05-17 20:20:50"}, {"review_id": "pFli9fCiZqBYcbiwqC1Rsg", "user_id": "4ojeUId0geFF9uo7rTSFSA", "business_id": "Zvlj-r49ftG7FNCpxKoUiA", "stars": 2.0, "useful": 2, "funny": 1, "cool": 0, "text": "Had the ribs, with side of mac chz and beans. \n\nRibs were dry and flavorless\nMac and chz was old looking, dry and flavorless.\nBeans were from a can. I'm thinking Sysco. And equally terrible.\n\nIf all other restaurants in Bellevue burn down, and you've already tried cannibalism then go here and maybe a sandwich won't make you cry.\n\nThe bbq sauce was edible, hence the second star.", "date": "2015-07-22 02:57:09"}, {"review_id": "NUEikO75uCbQTmCmzobbKw", "user_id": "euA14iqdFArAWSmKtHOb5Q", "business_id": "j7_yOwPVGPrzsF6uNOngEg", "stars": 2.0, "useful": 1, "funny": 2, "cool": 1, "text": "I'm not one to complain... although every time I stop in while walking the dog, I am hassled... I usually leave him to sit outside, but each and every time the staff will comment on him being outside and will continually open the door petting him and encouraging him to come in...  one would assume that no dogs are allowed because of the food they sell within the store... I totally get it. It's their comments that make me feel unwelcome and uneasy because they'll go on and on and say things like... Omg is he going to run away?... Can he come in? Is he OKAY?!? ... Oh poor baby!! Come see this dog!... - Seriously, it's quite the spectacle. It's happened the last 10 times I've shopped there. They make me feel like I'm a bad dog owner... and I don't know why. Perhaps, I should mention the dog it tied up - What is this store's problem? \n\nToday, I decided to avoid all of this and bring the dog in and tie him to the door on the inside... to avoid the unwanted attention. Of course, the first thing out of their mouth is... Uh, sorry no dogs allowed. I then put him back outside and as soon as I'm at the cash register paying... again one of the other girls starts with... Omg is he going to run away? Awww why is he outside? ... \n\nI am pretty frustrated and am starting to think I should avoid this store all together. I wish I could simply pick up what I needed and leave. This store seems to have an unhealthy obsession with dogs. Is part of their interview process to be crazy dog fanatics? It's getting ridiculous.", "date": "2016-01-09 00:18:13"}, {"review_id": "5t3ufanPBMNrOgy8jmMd-g", "user_id": "6sOrsHBiRkeAQrg8Lrhuqw", "business_id": "HCCg-rVnHQ2FI6lHs_LvUQ", "stars": 2.0, "useful": 4, "funny": 0, "cool": 1, "text": "For the second go around (I had to go back to meet up with some people who chose this location before I could object), I gave Daily Dose a clean slate.  I went in expecting nothing and that's about what I was given...again.\n\nBelieve it or not, the staff was rolling silverware again in the same area as my first visit. Unbelievable.  At least this time there was a seat available outside...far away from the clanking.\n\nThe service:\nSince I am a server, I don't bash other servers' \"styles\", but let's just say, our service was weird, not bad, just weird. Lingering stares, awkward silences, you get the picture.  Also, I have been serving for a long time and I still write stuff down.  No, I don't think you're cool if you can remember everything a table orders.  Just guarantee my food gets there the way I ordered it.  This particular time my salad came out loaded with raw onions, which I very clearly asked to be omitted. (I'll let you guess if she was writing it down).\n\nThe food:\nI am ironically thankful for the fact that the onions were left on my salad.  Because if they weren't there, I would have had a plate of flavorless lettuce and feta cheese.  Come on people.  I tried a difficult breakfast dish the first time I went, so I figured I'd order a common Mediterranean salad, just to give them a \"sure thing\" attempt.  Wrong. Yuck. Was there even dressing on that?\n\nI'm gonna stop here before I continue beating a dead horse.", "date": "2010-04-07 07:12:38"}, {"review_id": "X0RT2y8D6Z-wWiolzMPHDw", "user_id": "ooLhJJqNmVBFxR2_ha0ELQ", "business_id": "vl1aHp6pvnSmpoRQShWLjg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "First the food and the wait staff were very good!\nBut for the second time - the hostess and seating system  for this Lucille's is the worst.  It doesn't help that the waiting area is exceptionally small but the way the hostess group handles the waiting guests is a joke.  We felt like we being hurdled like cattle in a small area with no communication with the guests from the staff. We had a Reservation and still had to  wait 20 minutes for our table.  NO communication about when we were to be seated.  Not only our party but many other guests were saying the same thing.  This has happened to us twice at this Lucilles - and as a result this will be our last visit.", "date": "2017-11-13 20:13:52"}, {"review_id": "jHwpTL_RcahX9R3GWYcWiw", "user_id": "Y3h1wUv0OCx8h0MZWscBiA", "business_id": "59OgPGGzKFYqwSG_U06kuA", "stars": 2.0, "useful": 3, "funny": 1, "cool": 1, "text": "This place has been open fro awhile now and I finally got to try it out. I was in the area with a friend of mine who constantly talked about how breat this places side dishes were. \n\nWhen we pulled up I was surprised to see the exterior of the building. Not so appealing from the outside, neither was the area it is in. The inside was much better but nothing like some of the places in LA this restaurant is based off of. \n\nThe waitress that day seemed a gloomy and unwelcoming with her blank expressions and straight to the point service. I would have enjoyed the service a bit more if she was a bit more  enthusiastic. It wasn't till the end of our meal when we engaged conversation with her that she cracked a smile. \n\nWe ordered the tofu stew, since this is their specialty. I got the kimchee beef and my friend got the mushroom and beef. I like that they have the stone pots for the rice since no one else here in AZ does it. The rice came out a bit on the wet side but I was so hungry at this point it didn't matter. The sides that were presented to us was not very exciting. I don't know what all the hype was about the sides, it was just like any other place but a lot less. We only got 4 sides and one of them being roasted seaweed. Come on now, anyone can cut that up and serve it, I want something that I can't do at home. The stew was ok at best and did have a good amount of meat which is good. \n\nAll in all the service was ok, could have been better if my water was ever refilled. The food was ok nothing too exciting. A good place to go if you live in the area but like most of us who do not, not worth the drive. Possibly a harsh review since there are only a few Korean places in town but wouldn't you think since there are only a handful here and for some reason they all do tofu stew and a specialty that one would get it right. or at least enough for AZ but not this one to say the least.", "date": "2009-04-09 17:09:01"}, {"review_id": "y-bOyuM2XqJpP_ARsyTwDg", "user_id": "YRcaNlwQ6XXPFDXWtuMGdA", "business_id": "eWPCHrPKJDZUqaHWv2EB3A", "stars": 2.0, "useful": 2, "funny": 3, "cool": 1, "text": "If you like drama with your grocery shopping experience this is the place to be.  About 40% of the time I go grocery shopping there is a customer yelling at a cashier, a customer yelling at a security guard, or a customer yelling at another customer.\n\nIts obvious most of the cashiers don't like their jobs and the stock guys aren't competent enough to answer basic questions about where stuff is in the store.\n\nIf this place wasn't across the street from my house I would never shop here.", "date": "2009-06-30 12:44:02"}, {"review_id": "nJm6NRO3AWH_PIGCeIiT8g", "user_id": "jcXpSa8zT1n_vKt040ANEw", "business_id": "dEAk-gE-5Q95a7p91gNn8A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 1, "text": "No clue how they have so many stars. Must be new to sushi or never been to the great places vegas has to offer. Sushi Neko and Jjanga are way better. These rolls basic and the nigiri is so so. We were referred but never again.  Good luck", "date": "2018-08-08 23:28:06"}, {"review_id": "pwWAmO4NX1vTeUyyZHGqsQ", "user_id": "WAgb4kQiYWepo2w5Xq3V2w", "business_id": "8-8btzuYZCqEVOPwk0YYfA", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Price is good but quality of food is okay at best. The restaurant is really loud but that's not why I'm rating them so low. They have a good selection of food but the meat is poor quality, my fiance had an upset stomach immediately after dinner and the server we had was EXTREMELY rude. I've never had such a rude server. I won't be returning...too many good restaurants in Vegas to waste my time at this place.", "date": "2018-08-28 05:54:26"}, {"review_id": "D3vIkWdjwCUSowxAXFe23A", "user_id": "erDsNElmvFke5Tf3bTApSA", "business_id": "MJlq5AuCkRjz31sKspxp1g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered chole bathura and dosa.everything is oily and taste is also not great.even we ordered some chocolate rolling ice cream which is also not good.will not visit this place again.", "date": "2017-09-16 19:47:00"}, {"review_id": "F18SrRzt7ecPG3dWruOE1Q", "user_id": "lQBZo8_mm80dbwI5bo5c_w", "business_id": "ctDi8gEBYcGOGTnlWeiKKA", "stars": 2.0, "useful": 2, "funny": 2, "cool": 1, "text": "I felt like the interior decorations and inside was kind of messy and could have some improvements. The color wasn't appealing to me and when I came in there were dirty plates and still pastry on the table that the server didn't clean up. She was the only one working and I had to wait a while until she was free to help me. I came here because I really wanted to try the strawberry cake . They ran out and I asked her when it will be available and she had no clue and she told me to check back whenever. I just settled for the creme puff which was like $3.79 for one. She was lazy to give me back exact change when I gave her a $20 so she only gave me $16 back. She just seem so unmotivated to be working. Lol i just saw their strawberry cake and wanted to try it but I guess I won't know when it will be available due to lack of the server here.", "date": "2018-03-27 04:07:23"}, {"review_id": "KKfd33ZLup2NfwRwAuVdQg", "user_id": "8SpZzWGcXZkpGHql5LIoFg", "business_id": "zq2ErX9lOpENLFYKlrSioQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was not my first time and nor was it my first bad experience at this place, so having said that I try to be very conscious of how I order my eggs at an Egg specialized place. I don't order it medium poached eggs when they are slammed or anything that's going to roll someone's eye back behind their head when they are busy. Well, it wasn't very busy and not so early that the cooks haven't had their morning eye openers (haha).  But it sucks when they bring you poached eggs that rivals imitation rubber  eggs, then the server says to you that this is a poached egg as if you didn't know what you were ordering. When it came back \"CORRECTED\" one egg was broken open and the other still little over-cooked. I figured one out of two eggs was still better and if I sent it back it would not have improved my experience there anymore. Would I go back, maybe but definitely not until the summers in phoenix gets colder then 60 degrees.", "date": "2009-09-05 15:57:35"}, {"review_id": "qNX87Uy6q-uDykPxiaMQ3Q", "user_id": "8j0vdMoZuUebibezihXBTA", "business_id": "-lrxtiCaTdCJ9h7uMndsUQ", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Still on the search for decent BBQ in this city, I ordered from Stacy's based on a recommendation from a friend.\n\nGreat smells as I pulled into the parking lot, so I was hopeful for great food. Ordered the pork ribs, okra, and sweet potato fries. The price for the ribs was great, prices for side dishes slightly high for quantity of food.\n\nFries: too sweet with the addition of cinnamon, burned, and dry.\nOkra: crispy on the outside, moist on the inside. Just slightly too salty.\nRibs: smoked and good texture: moist but not over cooked. Unfortunately they were swimming in sauce. The sauce was sweet and had a good flavor, I just didn't want my meat to be swimming in it.\n\nSince I called in my order I had a zero wait and was greeted politely at the pick up window. \n\nAlthough I only gave Stacy's 2 stars (mainly for the overcooked sweet potato fries and wayyyyy too much sauce on the meat), this rib place still rates higher than all the other places I have tried in Phoenix so far.", "date": "2013-05-18 02:14:24"}, {"review_id": "xlWq9MJjtKP3S_q3hpr_nw", "user_id": "RSwe_5BVM5bnjQMrdSb_fg", "business_id": "UidEFF1WpnU4duev4fjPlQ", "stars": 2.0, "useful": 3, "funny": 0, "cool": 1, "text": "*sigh* A bad experience. Did I upset the Food Gods? No idea but I sure did have hell of a lunch date! My date and I arrived at therapy around 2 o'clock to try the beautiful and delicious food we had previously discovered on Yelp. When we walked in we were immediately greeted and sat at a table. Our waiter was a beautiful young lady with dark brown hair that was also working the bar. She went over the menu with us because we were new customers, which I appreciate and took our drink and food order. The food literally took 30 to 45 minutes to cook because we had to leave right when the food came out to go pay for an additional hour for our parking. That was very inconvenient and a bit frustrating the fact that lunch was fairly empty but I guess that's what you get when you go to a restaurant that cooks fresh food. My partners ordered the famous burger and I settled for the red velvet waffle chicken sandwich. The host that greeted us at the door delivered our food. \n\n     My face frowned when I looked at my plate. The waffles were obviously very burnt inside and out having a black coating and a smoky smell. I immediately pulled out my phone and compared pictures on the same plate that other people had ordered on YELP & I noticed that everyone else is waffle was a bright red or bright pink color without the burnt glaze. My partner asked me, \"Are your waffles burnt??\". He waved down who seemed to be the manager on duty. Heavyset Caucasian male over to the table. I politely pointed at the waffles and asked to get a new batch because I received burnt waffles. I had already tried to scarf it down and cover it with mad syrup, but it did no justice. \n\n     What made me feel a certain type of way is the fact that the manager sat there and to my face explained that the waffles were not burnt and that they just come that way. The hell.... I don't know if he was trying to be funny or he was blatantly being an a****** looking me dead in my face telling me that these burnt rectangles are perfectly fine. I think he was trying to make me feel stupid!!! But he insisted on making a new batch for me. 7 - 10 minutes later I receive a new batch of red velvet waffles and just as the ones before had a charcoal coat. It. Tasted. Burnt and unappetising. I put all the waffles to the side and simply at the juicy chicken and left hungry. The bartender then came over to check on us. She asked his our food was, but before we could even answer she asked me \" Are those burnt???\" I shrugged and told her that the manager said they can't this way. She looked at the kitchen and said \"oh..\" And walked away with a scrunched face back to the bar. When we were done eating we never were given our check because our waiter, the bartender was busy. A birthday girl and her group came in and they ask wanted drinks. The manager is in the corner folding silverware and the host is upstairs, doing whatever. So we had to walk up to the bar to pay. We left no tip. \n\nI was jealous that my partner enjoyed his bomb ass burger and I had shitty food and questionable service considering I only eat at YELP 4-5/5 reviewed restaurants. I am willing to try this place again but I will come for dinner instead to avoid #1 Whoever the Chef was and #2 the manager. \n\nGood Luck", "date": "2016-01-24 02:43:19"}, {"review_id": "5eZEg5ZSD5Ik6u3PZEOGNA", "user_id": "0rOldmzos1vjkd0SmHbKZQ", "business_id": "3l54GTr8-E3XPbIxnF_sAA", "stars": 2.0, "useful": 0, "funny": 2, "cool": 0, "text": "Visited this establishment last night, my second visit. I had been here with an out of town friend over the holidays for cocktails but did not eat on that occasion. Last night we ordered burgers, my friend got the Chili Cheeseburger and french fries, I ordered the Hatch Green Chile Burger with fries, on a GF bun. It was really not tasty at all. I didn't even finish it. The fries were meh. My friend said his burger was ok but not the greatest chili burger he's had. I think this place really hopes you will down a couple of their tequila shooters from their extensive list so that you won't know how awful the burgers really are. Our server, although polite, was clearly paying more attention to other tables, from what we heard they sounded like regulars, or maybe friends of hers. The atmosphere is trendy and fun, too bad the food is not comparable.", "date": "2015-05-07 18:31:10"}, {"review_id": "XeaNsE38sA_Nepz41snbkg", "user_id": "yxY7_nq3_o6ryINw48YnsA", "business_id": "3dw6xhzG08htY5HcL2OjeA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excited to have a bar within walking distance. OMG! What a disappointment.\nIf you you like your tap beer served in a warm glass or your Cosmo served in a warm mason jar, you'll like this place.  I had to stop the bartendress to ask for a refill(twice) in a cool glass. This was during Happy Hour and the barkeeper was also taking out orders to the tables neglecting a FULL bar. Ridiculous.\nProbably no staff dress code. I have a problem with sloppy gym shorts on bartenders. I'm certainly not up on food server regs, but aren't servers with full beards required to wear a hairnet?\n So, the food.We ordered Happy Hour sliders and a Catfish Basket. Catfish was raw. Went back. Second attempt was good and the sliders were tasty. \nAnd to their credit, the Catfish Basket was comped.\nWill we try again? Haven't decided. Will try a beer some afternoon. Wonder if owner looks at these reviews? Won't recommend at this time.\n.", "date": "2017-04-01 20:41:09"}, {"review_id": "OG79o6VUJXouTLla9GnU6Q", "user_id": "KidcrznAVluLYfP0gMg9dQ", "business_id": "pL-QrHxQ0kHBDA1ZyOjGQw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "This used to be one of my favorite places for drinks, but now every order is a 20 min wait. I though Amazon was suppose to make orders quicker and more efficient? Guess it's time to find a new place for coffee and juice.", "date": "2018-03-01 19:19:58"}, {"review_id": "H1JokbjSwDEiAaj3BAxZSg", "user_id": "OqpC77kJBHJY9lodmvnJ-w", "business_id": "zgQHtqX0gqMw1nlBZl2VnQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "It was really crowded in there, waitors have bad manners, portions were small, no variety. Food tasted good but it wasn't worth the price. Highly suggest Kinton Ramen rather than here", "date": "2015-10-14 17:37:37"}, {"review_id": "1TfdpOpnMYX2QsQwd4C4-w", "user_id": "SWhH-Z4mGoevmgao7bmpVA", "business_id": "j4EVLpxUFavlTK74oYb1YA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am a young, single woman who knows nothing about cars.  Ever since I learned how to drive I have been warned by people over and over that car maintenance guys would try to take advantage of me because they know I don't know any better, but overall I would say I've mostly had the opposite experience: Generally people are willing to explain things, perfectly fine with writing things down for me or even talking to my dad on the phone if I ask them to explain it to him, and on several occasions I've even received free or discounted services.  I attribute this to getting good recommendations from people and having an idea of what I'm getting into before I have my car looked at.  \n\nAt Conrad's Macedonia, I felt sketched out as soon as I walked into the door and the man helping me was calling me \"dear\" like I was his pet.  An hour later I got a phone call letting me know that I \"needed\" and extra $1,000 of unexpected car maintenance.  The man was speaking so quickly there was no time to even ask questions, and finally I told him I needed a second opinion before going through with all of this extra maintenance.  Then he preceded to pair down the cost: \"ohh well you don't really need four new tires, just the front two, and I was quoting you for our premium tires, you could do something more economical...\" - dude get a life and you clearly can't be trusted.  I spoke with my dad who advised me on what I should actually get done and what could wait a year.  Def never coming back to Conrad's Macedonia.", "date": "2015-07-11 18:55:10"}, {"review_id": "Bzqi51AzknthaYjTgypNQg", "user_id": "pMefTWo6gMdx8WhYSA2u3w", "business_id": "miwB0RqT6IclCNuqVGbKOw", "stars": 2.0, "useful": 4, "funny": 2, "cool": 3, "text": "TLDR: The meat platters may be good, but the wraps are sub-par, but the chef/cook is very nice.  \n\nI found the waitresses to be a bit cold though.  I ordered something at the counter and I couldn't hear what they were saying and didn't seem happy to be there.  \n\nI ordered the falafel wrap and grilled veggie wrap.  I've had lots of Mediterranean food and I need it to meet downtown Toronto standards. While the total of two wraps was around $10, they weren't filling at all.  The falafel wrap only had two falafels and I had to ask them to put hummus on it.  I thought hummus was a standard for a falafel wrap. What's even stranger is that they put the hummus on after all the toppings.  That's just odd.  While the wrap looked big, I had to eat through at least 1/3 wrap before getting to the toppings.  \n\nThe grilled veggie wrap was also mostly bread and very little taste to it as well (and I don't even add salt to most of home made meals, I just add natural spices).  \n\nI went into the \"La Mill express\" section of the place and I figure two wraps should be easy enough to make.  It still took about 10-12 minutes.  Honestly, if the food was better and more filling (i.e. more nutrients instead of bread), I wouldn't mind at all, but when I basically end up eating bread with a side of veggies and two falafels for $10, it's kind of annoying.  The chef is very nice and he seemed overwhelmed though and I really want to give them 3 stars because he was so nice, but these wraps were just bad.\n\nVerdict: Might be good for meat eaters, but if you're a healthy plant based eater, don't bother.", "date": "2016-09-12 00:48:55"}, {"review_id": "A15Uxcxk85QpeOtWB8OtpA", "user_id": "YEaYdTrF2JVebGbPVe5K6Q", "business_id": "WoiOpMEcbAfOqNYXqDwm3Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am so disappointed. We just left. We got assorted pastries and macarons. They were absolutely beautifully looking, but were significantly lacking in flavor. \n\nWe visited another French bakery in Squirrel Hill a couple days ago and were craving more. Their macarons and chocolate croissants were life changing. We've been wanting more, but it's difficult to get to. We saw the good reviews on yelp and thought we'd give this place a try since we were passing by. \n\nThe macarons lacked flavor to the point of it being hard to distinguish what flavor each was. \n\nThe pastries seemed to either be over or under baked. None were just right. Some tasted eggy and had a rawish center while others left an unpleasant burnt taste in our mouths. \n\nNext time we want French pastries, we will make the drive to squirrel hill instead.", "date": "2017-11-11 19:40:48"}, {"review_id": "n0UmMtWkbGeSOrDs66tnZQ", "user_id": "C4KfHQbd-cP9SyvgJYNY1w", "business_id": "F4VS-6xnpDoNBRGPoLrtjA", "stars": 2.0, "useful": 4, "funny": 1, "cool": 2, "text": "Idk how I feel about this location . Tried to come in on a Monday at 8:30 pm when there were customers inside , we just parked right in front of the entrance when the only customers they had were leaving . The worker immediately locked the doors behind them and turned the open sign off. They clearly saw us pull up and saw me try to open the door because we examined the sign on the front door saying that it closes at 10 pm on a Monday . However they did not even acknowledge us on why they were doing this . Makes me think less of Novecento when I've had such great experiences at their other locations . I was really looking forward to this visit and don't see myself ever returning to this location . \n\nTwo stars cause the food is bomb , however this is for the rudeness I experienced today .", "date": "2014-07-22 03:36:56"}, {"review_id": "DKFaYT81DlEsWJ0c_LOWig", "user_id": "116AVKourTNRaX_b_2ar_Q", "business_id": "MTOirXmaG0JOc32HsnQwag", "stars": 2.0, "useful": 6, "funny": 7, "cool": 6, "text": "I think Cold Stone is overrated. The ice cream melts way to fast and gets all soupy, the Cold Stone employees never mix the ingredients very well and I always walk away thinking, \"...really? Did I just do that to myself again?\" \n\nThis location in particular is never clean, the bathrooms are a bit scary and they don't sing when you tip them. If you're in the area and you're looking for a cold treat skip on over to Fatburger (just next door) and get their chocolate shake!", "date": "2009-08-30 00:05:08"}, {"review_id": "UpB7GsgJcHyWEnr_ghz7sw", "user_id": "rNiXIpG4HapgxQ8HEkXRBQ", "business_id": "y7Js-07RF8d3N_AEtaw2VQ", "stars": 2.0, "useful": 0, "funny": 2, "cool": 0, "text": "Located downtown on the Fremont Street experience the Heart Attack Grill has had a lot of Media attention since its opening back in 2005. This hospital themed restaurant offers an experience you won't soon forget. From the nurses to the pill bottle vodka shots it stays on point 365 days a year. The service however is a bit uncomfortable with what feels like teenage girls in skimpy nurse outfits serving you. Of course the men will still look but it gets weirder when you realize you have the option to be spanked by these young girls. My thoughts on the food are pretty basic and extremely unhealthy. The menu includes the Quadruple Bypass Burger, Quintuple Bypass Burger, Sextuple Bypass Burger, Septuple Bypass Burger, and the Octuple Bypass Burger. These dishes range in weight from half a pound to four pounds of beef. Also on the menu are Flatliner Fries (cooked in pure lard) and the Coronary Dog, Lucky Strike no filter cigarettes, alcohol, Butterfat Milkshakes and full sugar Coca-Cola. For the money you're investing in this meal it is not really worth it for the plain tasting food. My opinion is the Heart Attack Grill is a place that's fun only to say that you've been. However this restaurant is not for the faint of heart. Their moto is \"Eat, Drink, and Smoke their way to Better Health\". But from the overpriced food, inappropriate theme and the fact they lure people over 350lb to come eat free. I think it's best to just keep your distance. Basically the Heart Attack Grill is what it is, a novelty tourist spot. Love, Bug", "date": "2017-04-03 20:53:54"}, {"review_id": "YeNQUoPGZi14_tT5h6hz2w", "user_id": "qQ4bfJmrfK0iWCZjl8cavQ", "business_id": "n9w8JmmmpZHVUaPY98gbZw", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "It's an average bakery, I guess they have more flavours in macarons but they are a little too sweet and does not have much flavour. It's has a cramped space, very small with a shelf for cookies for sale. I guess the decorated cakes were pretty neat.", "date": "2014-07-19 04:22:51"}, {"review_id": "LKXFUKYxx-mQqkhfaqAttA", "user_id": "6xNkxlKhTNLQHvpspZu_Vg", "business_id": "8dB4vwJ5IziF2lDKbx4G0Q", "stars": 2.0, "useful": 5, "funny": 0, "cool": 0, "text": "I took my kids to Kreative Kampus for the first and only time they'll ever be at a daycare facility. I probably have a bias because I've never tried another daycare. Registration was pretty easy and I was able to take then the next day which was huge since we unexpectedly had to start childcare. When I took them in the morning I was hesitant, but was reassured by seeing the facility and the teachers. Everything seemed like it might have worked out. I went to work and called to check on my kids a couple of times and the lady was really nice about giving me updates. When I picked them up, my heart sank and I felt like I was l was the worst mom in the world. My kids were filthy and there were SO many kids for one teacher. I was upset that I couldn't take my kids their own food; instead they are fed the same \"balanced diet\" (ha) as they have in public schools (where pizza counts as a vegetable and rice krispies are on the food pyramid). Needless to say, the kids didn't eat much the whole time they were there. \n\nOne day when I was getting there from work two staff members were having a conversation and one was repeatedly using profanity in front of me (how very unprofessional,  can't imagine what they talk about when the parents aren't around!)\n\nThe final straw was when I picked up my son and noticed he had dried blood in his nose. He told me on the way home that one of the kids hit him. I understand accidents happen with kids but it made me angry that I had to hear it from my son instead of one of the staff. Nobody seemed to care; I wonder if anyone even noticed?\n\nNeedless to say, my son still worries every morning and asks me please not to go to daycare and sometimes even cries about it in his sleep. He will never go back.\n\nAlas, they take drop ins and have reasonable prices and great hours. If it's an absolute necessity, your kids will be fed and survive. Don't expect much else.", "date": "2014-04-26 22:56:15"}, {"review_id": "u4zF2O0bBUZoxqRvEJVvFg", "user_id": "YA-caxALI4C-eCiSM97new", "business_id": "7mU3l5VjH1IxsXcxBxUblg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "A friend and I attended another terrific National Theater Live event at Southside Works, which sadly only had ten people in attendance (where is the intellectual theater loving crowd in this town? This is THE best theater event this town has!) and afterward, we decided to grab a bite. My friend suggested Emiliano's.\n\nThe staff was friendly right away, all of them, and the space is quite large, with a bar lined with TVs, all playing different things, happily, without sound, and the background music seemed to be some pretty modern, yet not Latin thug, Latino tunes. High ceilings and plenty of seating available. Atmosphere...generally pleasant.\n\nThe menu was a bit pricey for Mexican food. Like MUCH too pricey for Mexican food.\n\nThe server took our drink orders (Pepsi products - which meant a plain iced tea for me), and returned stealthily with a basket of chips and bowl of salsa.\n\nWe each ordered the 'Old School Chimichanga', which was one of the least expensive items on the menu, and one of the few things not containing things I don't like (onions, bell peppers, sauteed veggies, etc.).\n\nAs we chatted about life and the play we'd just seen, we started nibbling at the chips and salsa. The chips did not seem fresh, or house made...the kind of hard flavorless darker than usual tortillas. The salsa was clearly out of a can, with no bits of freshness involved at all. This may have been the first time I was involved with a basket of chips and a bowl of salsa that were still partially full when we left.\n\nThe Chimichanga arrived...pretty in presentation...cut in half, and artistically propped, over a bed of white creamy cheese, and with an upended bowl of very presidential orange 'spanish rice'. It came with a side of shredded lettuce, a dollop of sour cream, and a spoon full of pico de gallo.\n\nAbsolutely...nothing special. The contents of the Chimi were ground beef, rice and beans, and the fried burrito was topped with the creamy white cheese. The cheese gave the dish the most flavor. No spice, no real taste of seasoning. The cheese had made the crispy fried tortilla a little soggy. The rice was just orange and flavorless. The sour cream helped a little on the Chimi, but only a little. These simple Chimis were $11, on a Sunday at 12:30. Most everything else on the menu started at $15.\n\nThe iced tea was fine, and the server kept it filled. He was very friendly, and asked twice if everything was fine, the first time we hadn't bit in yet, the second, I didn't have the heart to tell him, with those big smiling brown eyes, that everything was great...except for the food.\n\nThis just felt like a big shiny chain, serving conveyor belt Mexican options, watered down for the 'gringos', with a bigger and shinier price tag.\n\nWith other options in the immediate neighborhood (La Palapa, hell, even Patron Grille) I wouldn't return here for a meal. The quality and price are nowhere near a match.", "date": "2018-09-30 19:10:07"}, {"review_id": "jwchLVmG54YecT_7807Sqg", "user_id": "JkwUcFUCPbJzMhb8OJ-uxg", "business_id": "RZWx7pIsINH6nVqW7ys9cg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service was a slow, I ordered fried chicken based on reviews  that stated it was so delicious, the chicken was extremely under seasoned, Mac and cheese and sweet potatoes were extremely goood.  It leads me to believe that different cooks are fixing the  food. I might give them another try in the future.", "date": "2017-11-13 04:33:51"}, {"review_id": "eu9FfpWQQfYYwpfU9byyyg", "user_id": "KBLW4RujERLotEYjU5LKew", "business_id": "qFZ7ReYNpjHuvSxOqXqHMg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered my sushi through uber eats. Delivery was very quick but the lasagna roll that I ordered tasted very salty and wasn't that great. I'll give this place another try though...", "date": "2017-06-01 19:33:45"}, {"review_id": "onCFg721126xj_-2pIe-1g", "user_id": "mCVe2b-x_mJTcornandg9A", "business_id": "8DPZWbP6gKaBsGoAFQkSaA", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "The food is more like 3* not bad for a fancy bar but nothing that makes you want to come back. But the place is noisy, even at 1:30pm with distorted music in the background. The kicker though is that for 7 of us we were told they would automatically apply 18% gratuity... So the server could not care less. We had to ask for waters, for drink refills and overall she was as unfriendly as it gets. Why bother earning your tip if you know you are getting 18% no matter what. So not really recommended.", "date": "2015-07-21 21:15:36"}, {"review_id": "GKrHTMU_DDjZlnKM1RxfyQ", "user_id": "S1otMSQqsBQO617d2NUXLw", "business_id": "FilJA40dzVeDCbbrZxTY2w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love eating fish and chips so i like trying different restaurants of fish and chips this one is not bad but not very satisfying as well the batter was too much and the fish inside doesn't have any taste the portion was big but most of it is batter the fries is big portion as well but it is soft. The tartar was sauce was very ample amount. Service was friendly but the lady didn't offer me anything. Location was near yonge street and there's school around so i dont know if it gets busy. But when i came around 2:30pm no one was there. Not planning to go back again soon.", "date": "2018-08-30 22:21:43"}, {"review_id": "8aPuQK27Mo_c0uGWbjJhow", "user_id": "xHhJ7w9DQ7TY_0fU0HgKng", "business_id": "Z7nGSKvjmHNRkXtoMxA3Jw", "stars": 2.0, "useful": 2, "funny": 1, "cool": 1, "text": "While driving by my wife and I decided to stop in and try them out.  We were seated in the booth right next to in fact looking into the kitchen; and that was after being moved once already because of the insanely loud birthday party.   Once adjusted to the new noise level our server told us she would be right back with our bread, 12 minutes later she said she just waiting on the bread to cook but did bring us our drinks.  The staff seemed very lethargic even the Manager had a personality of a bowl of cheerios. My chicken was ho hum and my wife's burger was very sloppy and actually fell apart in her hand and the meat had a very peculiar after taste.  Maybe we shouldn't go to a \"steak\" place for what we ordered but...  live and learn.", "date": "2010-12-13 13:11:55"}, {"review_id": "fyxEQMygZbVCo2CIGvcU4Q", "user_id": "9njllw5phaj35SG1KPqjaw", "business_id": "BDDIpeEK8gVdhiglbjEyrw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Completely see why they have a 2 star rating..service wasn't the worst I've ever had but had to wait 20-25 mins for a luke warm burger. Not a fan at all", "date": "2017-09-27 03:44:52"}, {"review_id": "U8oXQWmbemRKX0MlzpZ9gQ", "user_id": "mjh_Dvx_jIojEtc5pOKAEg", "business_id": "z5KWNSDvgv-4I62P8l8Ynw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoy the cold brew coffee here and have been coming here for a long time to study. Lately every time I come the music is way too loud. The atmosphere is more like a bar than a coffee shop because of it. It's tough to have a conversation with a friend because of the noise and tough to study as well. \n\nMost people expect a quiet and relaxed atmosphere when they go to a coffee shop. That used to be how this place was, but sadly not anymore. Luckily, the valley has an abundance of coffee shops and it wasn't too tough to find somewhere else to go for my daily study sessions. Great coffee though if you're just picking up a Togo cup", "date": "2018-09-30 15:12:56"}, {"review_id": "kMOmdMjK1FUackg9w1fbUA", "user_id": "Yx-hGOItB8WQgIrmEFujuQ", "business_id": "dimv16yFu0JXR1n1SAqedQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "One server, one cook, one guy making bread. Had a Groupon so didn't do the buffet. Ordered two dips and had to ask for more bread. Also had to flag down server to order drinks. A wait for our meals and not much meat that was dry and overcooked. Maybe dinner or the buffet is better but having been to that part of the world and had that food, I wasn't impressed enough to be back. My Groupon was for $40 so when I got my bill and it said a discount for less and the amount I figured I owed wasn't the same as what I was told, I asked the server. She said she couldn't help me because the owner did the bill and she couldn't fix it. Seriously? Not good!", "date": "2011-06-14 23:56:25"}, {"review_id": "L2mX2LmE8z8QosMlV-Uvgg", "user_id": "-t0_Z1vtmqtoEKLubD4ptQ", "business_id": "zl3Y1_DprpVzY3Izad4M-Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Eight Pepper Burger and fries were good, hot, well presented. Service is slow but reasonably friendly. Plenty of TVs for sports, some HD, some old CRTs. Decent beer selection and specials, but I found the glass smaller than expected. Smooth out the pace of service would be my main suggestion. Sort of surprised it didn't improve since my last visit in 2012.", "date": "2013-11-24 02:31:47"}, {"review_id": "WAMqL3rSd-7gga5FM1uXHg", "user_id": "SNvZa6klyynX-Evxi8rMxg", "business_id": "52sY8-9al5LJi475nNJkyQ", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "This is the most frustrating review for me so far. I attended the original Raising Cane's in Baton Rouge, LA, many times and I have visited several others. Unfortunately if I am comparing this location to the other locations than 2 stars is a stretch.\n \nThe sauce was good but for some reason seemed to taste different than the sauces at other locations.\n\nThe chicken was awful. I bought the Caniac, which is 6 pieces, and 4 of the 6 pieces were stale and hard to chew. I was there around 11am so there is no excuse for stale food.\n\nThe bread was also stale and very bland.\n\nHowever, the sweet tea was great. Since it is so hard to get quality sweet tea here in Arizona I was pleased to find it was as good as Louisiana sweet tea. I thought it was a 5, which made the experience a 2 for me.", "date": "2011-10-14 01:17:40"}, {"review_id": "NSgigY1b_Zrx1iUlMav2-Q", "user_id": "YNkbvkPhLMFlOFYH2PLMwA", "business_id": "Eg_M8eeu9SDEdbP7iUmVbQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 1, "text": "I will say that our server and the manager were quite nice. But that's about it for the compliments.\n\nI really really really wanted to write a good review -- because a lot of what we ate was delicious -- however, there's two reasons we won't go back: \n\n1) My mother had a large chunk of porcelain/ceramic in her food, which was scary enough, but the scarier part is that it didn't match anything in the restaurant. Makes you consider how fresh the food is... And you would think that her meal would be comped. Nope. A free dessert didn't make us feel better about what could have been a major dental emergency.\n\n2) From start to finish, we were there for almost two hours. Again, our server was great but service from the kitchen was super slow.", "date": "2018-01-04 17:54:39"}, {"review_id": "p02dXX1pV8RMtaz1tCByFA", "user_id": "mYs9BiEFNdpWA_iD9wBblg", "business_id": "dEVap-JebgvRYTEaCo1YVQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Produce section needs some help, on multiple occasions I've bought bananas and salad mix only to have throw them a way a few days later well before I should because they've already gone bad.  It doesn't matter what the expiration date is, it will already be soggy and browning.  Yet I can buy the same brand at Food Lion with no issues. \n\nThe on-site Pizza Hut also doesn't seem to know how to stock for a rush, the last time was this Friday when they were only doing pizzas on a request basis and you had to wait 10 minutes.  If I'm going to wait why not get real pizza?\n\nThe men's clothing section can be summed up with small selection and low quality, if you want decent professional wear go elsewhere.\n\nPrices are also higher just for the sake of being higher, I'll pay more for the specialty stuff but if my main staples are on average 25% cheaper at Food Lion that's where I'll go.  Target is down to once a month at most, just a better shopping experience at other places.", "date": "2014-08-05 11:09:12"}, {"review_id": "muJiOtfRoyB1K_VfRrY5UA", "user_id": "CkF4BmZD4TTG9I8CXgU8WQ", "business_id": "xtYiHTmunjfCN2sUaQxBjA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "long check in and check out lines , slow service. WiFi cost $15,and they scan your emails (when outlook complains on certificate  of the server that's a bad sign.\nlast but not least, no coffee machine in the rooms.", "date": "2017-01-07 18:47:07"}, {"review_id": "MN5iwm_exluKTpQiqaeOpw", "user_id": "wkL21ObcfI9B0QTZpGMdaA", "business_id": "M0pkmBUi_CI0qrzN7ee80Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "As a native of CLT, I can say I've visited multiple Amelie's locations, probably more than I'd care to admit & recommended it to many people over the years. I was ecstatic when they opened right across from my work in Uptown. Unfortunately, I have to say the quality of food & customer service at the this location has significantly declined. This morning was the fourth time in a row I was disappointed. My breakfast sandwich had the bare minimum of ingredients (so little cheese I actually had to check after a few bites) & also cold- it was not busy so not sure why. The other times I've visited lately, the sandwiches I had were subpar at best, one even had bacon that was pretty burnt- had to pick it off to eat. As far as customer service, the baristas are on their own time. After waiting 25 minutes the other night for a quick coffee, I had them change my order to tea & just ate the price difference, so I could just get a hot drink & go, as I had somewhere to be & couldn't continue to wait around. Perhaps they should focus on their job instead of chatting with other employees. This is not the quality I'm used to from Amelie's nor worth the price, which I hate to say. Amelie's, I'll always visit for your sweets but please work on maintaining the high quality of food & service that we've come to expect instead of expanding into new locations!", "date": "2018-01-05 13:10:25"}, {"review_id": "y22fYjBKxn10ObGIDLATsQ", "user_id": "PBSkpQxdUzx-4LyvEgX1KQ", "business_id": "Q7m8G4579-XYKV3LMW8V7g", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ambience: Solid A here. The lighting is dim, and makes for an intimate feel. Decor is simple with traditional Japanese and modern touches.\n\nService: It's an overall B to B-. The hostess and wait staff is friendly and just the right amount of attentive. Sushi chef was cold. I am so used to friendly, outgoing sushi chefs, so while he was by no means rude, his customer facing skills leave something to be desired.\n\nSushi: And of course the most important aspect of. Sushi restaurant. Unfortunately, this is a C to C+. As a frequent sushi nosher and lover or nigiri, I was more than a little disappointed. What I ordered: salmon, yellowtail belly, uni, and unagi. The unagi was the best of the 4. But honestly, it's pretty touch to mess up since its BBQ'd. Flavor was good, although the unagi sauce was cloyingly sweet. The salmon was second best. Standard. Not bad, but not great. Slightly flavorless. The yellowtail belly and uni were terrible. I was really looking forward to the buttery fattiness, but found it entirely flavorless and stale (the ends were hard which I've never experience with sushi). To be honest , I choked down the uni. Sad because it's one of my favorites to order. It had an odd metallic flavor that again, I've never experienced. Additionally, the nigiri itself was really sloppy. Most all fell apart as soon as I tried to pick them up with my chopsticks.\n\nWish I could have given it at least 3 stars, but the food quality is obviously a big factor. I've been here a few times, so this isn't based on a one time experience.", "date": "2016-01-24 06:40:55"}, {"review_id": "9H0CDY-96W9bA9oIHOxAAg", "user_id": "CJWUg301lhED1Ys6gOGqzw", "business_id": "2DmTw0k3bcXuHdAyxO_bkw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Please note: This review was from a visit last August that I didn't realize hadn't posted. I considered editing it, since it sounds harsh, but that was how I genuinely felt at the time.\n\nNo AC? In August? Are you kidding me? There should have been a sign before you walk in the store that says this, especially considering it had been out, by the server's own admission, for 2-3 days. This shows a complete lack of respect for their customers. For a frame of reference, I am always cold - and I was dying in there. And it wasn't just us - everyone was complaining about it. \n\nThe food was okay but definitely not good enough to overcome the sweltering heat. (It was actually cooler walking out to our car.)\n\nThe food alternates between fresh and healthy and cheap, store-bought crap. I had the portobello ciabatta sandwich, which was actually pretty good - light but satisfying with nice flavors. \n\nMy ex got the \"meat-lovers\" omelet. I am vegan, okay, but the (pitiful) amount of meat on this actually made me laugh out loud. \n\nAlso, they advertise as being \"vegan-friendly\", but they really aren't. Aside from the hummus appetizer, I think I had the only vegan thing on the menu. \n\nTheir red potatoes were pretty good. Their house salad was mediocre, at best, but their balsamic dressing was gross - it was literally oil and vinegar with no flavor.\n\nThey do have some fabulous tropical green tea, though. I'll give them that.", "date": "2014-07-04 01:08:12"}, {"review_id": "UrZjHjS8U4iZ13c-dIy76Q", "user_id": "6ZjWz9ZIEy76_rQATWmr0Q", "business_id": "SEH79jbg5Q8cCozCnhqMHA", "stars": 2.0, "useful": 7, "funny": 1, "cool": 1, "text": "I normally love this place, but for me the service drives a significant part of my rating especially when the food is consistently good. \n\nWe walked in with a large party for a special occasion. We made reservations, but apparently an error was made with the seating and they split our party up in to two tables. I politely said . . . This has happened before, and we pushed the additional tables together . . .  The server says loudly in my ear \"WE CANT DO THAT\"  Long story short . . . He was rude and he was not willing to accommodate any special requests (he wouldn't even ask the chef for modest dish changes). We work for one of the largest companies in the area (if not the largest), and we just happen to be the leadership team for that location . . . We used to frequent the restaurant, but I think that will change as everyone was annoyed at this waiter. \n\nTall, big guy, dark hair . . . I didn't ask his name again because he had such an attitude problem. \n\nMarcellinos, you have too good of a restaurant to allow that kind of behavior. I would recommend this restaurant as they make fresh pasta daily and have a nice diverse menu, but if you see a guy that looks like Penn from Penn and Teller without the ponytail . . . Ask for someone else.", "date": "2015-12-13 14:35:01"}, {"review_id": "hZv-eEvdZ1NpqHyV_7xnAQ", "user_id": "130yiaBsIJ7JnJsJqxgsow", "business_id": "vU0txPBYxOecrqEf5TWwrw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really wanted to like this place and the bagels were priced very reasonably but they just weren't that good. Very so-so overall", "date": "2018-06-13 08:22:35"}, {"review_id": "FGEpamLQ9LkOtSKtlquKQg", "user_id": "xPHPmGFANmcblhDfjkt5ig", "business_id": "zgQHtqX0gqMw1nlBZl2VnQ", "stars": 2.0, "useful": 3, "funny": 0, "cool": 1, "text": "Don't believe the hype.  \n\nChicken buns are amazing.  Pork and shiitake are good.\n\nRamen is meh.\n\nKimchi stew is meh.\n\nChicken wings are pretty good but I would prefer real Korean style wings.\n\nSake slushies are pretty good but others at my table were not fans.  They have a sour taste with a peppery finish.\n\nNot worth the hour wait that builds quickly.", "date": "2012-09-21 12:28:17"}, {"review_id": "3Z_85RPuwWTh2lyD4uTT0w", "user_id": "CR-ze9lR7fokp0fM8g5lYw", "business_id": "3vSYu180m7yhOD_qaQUCTw", "stars": 2.0, "useful": 2, "funny": 0, "cool": 1, "text": "Let me start off by saying that I have been to this Starbucks before and haven't ever had a problem...but my last visit was not what I was expecting.  I was over on this side of town and remembered that Starbucks was have a customer appreciation day today between 2PM and 5PM where you could get a BOGO Carmel Cream Latte, Peppermint Mocha Latte, or a Gingerbread man Latte.  I thought this would be a perfect time to utilize my gift card that I received from my Secret Santa so me and bf merrily go into the store.  Everyone knows that when Starbucks throws deals like this then there is going to be a crowd...this was expected.  We placed our orders (mine a Peppermint Moca and his the Carmel Cream Latte) and I used my gift card.  So we have a few people in line and I hear one of the women who work there tell another, \"Don't do it like that b/c you'll have cups lined up and just sitting here\" then she walks to the back to wash some of the utensils.  Well she must didn't care what she told her b/c she must have kept doing exactly what she was doing before...making drinks out of order.  There was a couple in front of us and she handed the female her coffee and instead of making the one for the man she was with she makes my bf his coffee.  Well quite naturally the man picks up the coffee thinking it's his, even went so far as to place a cozy on the cup, and once he had turned the coffee several times and read what it was he then realized that it wasn't his.  By this time she had made mine (still the guy is waiting on his drink).  I took mine, picked up the one that the guy had and asked her to remake this one.  \"Why\" she says with a slight attitude.  I gave it right back to her and if you have read any of my other reviews you will know that I do not like my food or drink to be breathed over/picked up by strangers...and this is what I told her.  So she starts making another coffee (I'm thinking she's remaking the bf) but she's making a drink for someone who is farther down the line (still the guy in front of us is waiting and he's getting pissed off).  Then she makes my bf (so he gets his before the guy in front of us) and kinda shoves it to him.  I'm not saying that this place has bad service but this one server can make or break a place....", "date": "2012-12-21 16:57:39"}, {"review_id": "yS98xW9kUMt1yI5zxCYgKQ", "user_id": "d-jhwX9dYSkx31pjWK4V1A", "business_id": "g92QApwbpRQXXpDeXZLrwA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Young boy's haircut at Dolittle's just now. Told the stylist 'not too much off the top' and boy did she go to town.  Start short and go from there if there is a question!  The young girls up front had little to do other than gossip and ignore customers.", "date": "2017-05-20 16:12:07"}, {"review_id": "AJlZeOiNeaIeJgOd7_TVZw", "user_id": "TvenTNXyYtMNtED0i2tXfA", "business_id": "dUePqUU5pROUEPiWBau72A", "stars": 2.0, "useful": 3, "funny": 1, "cool": 3, "text": "I've been here a couple of times, and the experience is always mediocre to meh...The staff all seem to be a hot mess, where no one knows what they are doing, and all seem quite dazed and confused. On one occasion, we were sitting on the patio, being blasted by the sun for 2 hours - where we had asked to be moved to a number of other tables on the patio - and they waiter kept saying he had to ask, and then either forgetting or just not doing anything about it. We finally opened a large umbrella on the patio, to which he replied, \"oh, i probably should have thought of this sooner...\" -_- I have no words...\n\nThe soup and sandwich deal for lunch resulted in tepid soup, and a soggy sandwich, and the cottage pie was all gravy with very little of anything else (don't get me wrong, I LOVE gravy, but i don't want my entire dish to be and taste salty brown). \n\nI've been told that pints at this place a good for UFC games, and that the upstairs patio (when it's open) is nice. But all in all, Liberty Village has so much more to offer, I wouldn't bother with this place.", "date": "2017-11-23 20:05:30"}, {"review_id": "_Bxx_x2RBawPaI-t9DXs3A", "user_id": "x-rIBpreqXqxBYWZ8Ixbiw", "business_id": "IrHAhdmL9QH9g3NscAIsWA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great location but not the best value.  Tiny bathrooms - could barely close the door with the rug.  Noisy guests had a party - we could hear the door slam as our beds were positioned on the wall of the hall.  Poor design.  Security finally broke the party up at 1:30 am.  Lots of other hotel choices in the area.", "date": "2012-08-28 09:23:08"}, {"review_id": "9ecnLDPVKgojoTQ2IrKASw", "user_id": "BVU6ETqtOfJxaMFXxb9wSw", "business_id": "x0ghbO1UjgSsQPvmCEBrZw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I recently came here with a group of colleagues for a private dinner, and overall it left more to be desired. The wait staff were very polite and attentive; however, the food was just adequate. While the remainder of the restaurant was empty for the majority of the night, we were in the basement for the dinner. The setup was unusual in that many of the guests were left with obstructed views of the presenter.\n\nWe were served appetizers consisting of bruschetta and satay dishes which were actually quite good. For the appetizer, we had a choice of a potato and parmesan soup or a salad. The salad, although being quite large for a serving size, was quite bitter. For the entree portion, we had the choice between gnocchi, a salmon dish or chicken breast. My colleagues commented that the gnocchi was quite good, although the accompanying brisket was overdone. My salmon was well done, however the accompanying peas and potatoes left more to be desired. \n\nMany of us asked for dessert to go, as the night was getting quite late. The brownie was quite dry for both the dine-in and take-out options. \n\nI have to say that a highlight of the night was the Stratus Cabernet wine that was served.\n\nOverall, this was an average dining experience, but lacked the 'Mediterranean' dining experience that was expected.", "date": "2015-05-20 02:35:24"}, {"review_id": "vImNXHKJAJG05KS3QwgJrA", "user_id": "P9yweXls2Pg-EMipYr45XA", "business_id": "Kkat2wrdm9EKbZg7wE9lcw", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "We came to this place because we had a Groupon.  It was cold outside and I thought it better to make sure I had a thick sweatshirt on, because playing a game of mini golf can take awhile.  The group of us pulled up and I was looking for the windmill and batting cages that usually come with a mini golf place.  But, I come to find out that this place is indoors.  Hmmm!  I didn't like that.  We walk in and we were the only ones in there.  It was kind of fun, just because of family.  \n\nThe guy running the place was nice and told us about the different courses in the building. It had a total warehouse feel.  The ceiling's were bare and the place lacked any kind of decoration, except for the course itself.  But, to be honest, I don't see this place lasting much longer.  But, I hope that I'm wrong.", "date": "2014-01-09 17:41:02"}, {"review_id": "Z7xPNOzhK_WYYKiPKn88xg", "user_id": "cImvLb3Wvd5EZ8SRjKAPsw", "business_id": "6z3cgIE9dJ01wUm43f0yBQ", "stars": 2.0, "useful": 4, "funny": 2, "cool": 3, "text": "Looking at the reviews and photos I thought I would give this place a try. We got there around 8:30pm and there was only one other couple in the restaurant, not a good sign right? We tried their standard boiled pork and cabbage dumplings and for under $9 you get 14 dumplings, not bad for the price. But the dumplings could have been much better had there been some dipping sauce and ginger to go with it. The other dish we had was their beef stew noodle soup. This was very disappointing as the soup base was sour and the type of noodle they used was not to my liking. They should have mentioned it in their menu that the soup base is sour. The service was okay but I will not be going back as their dishes was just mediocre.", "date": "2014-09-01 15:39:46"}, {"review_id": "lVmqWp-n3lA9aU7KxqAmgQ", "user_id": "gZBAENqjq7Lq6TwO5lcFZg", "business_id": "Cpb142L849ilMzgiSR4a0w", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Glad to see all the good reviews because this one isn't.  I'm Filipino and not impressed, but would like to offer constructive criticism.  Filipinos are by nature, regionalistic.  They tend to be more comfortable with people they're familiar with.  Normal, but owning a business is a different story.  It would help if the owners and servers paid attention to all customers there and not just some of those they know.  No one came back to our table after the food was served to offer further service.  There was an American guy there who we assumed was an owner/partner?  He took our order and served it.  We told him we wanted lumpiang sariwa (with the wrapper), and he said they had it.  When it came, it was the fried variety, and was very greasy.  My brother ate it because he's from the Mid West and hardly tastes Filipino cuisine.  We also ordered Crispy Pata w/Kare Kare.  Conceptual but not really.  The Crispy Pata skin was crispy, but the meat was hard, not falling off the bone.  The Kare Kare part of it was just vegetables and peanut sauce on the side.  Again, my brother was happy for this since no options where he lives.  Servers should know the menu and be able to understand it.\nWe preferred not to say anything because it's not good to argue over food.  I live in Vegas.  Fortunately, there are a lot of other choices!!", "date": "2017-06-01 22:13:53"}, {"review_id": "2EY7PfxNOr68BOzGx2XEWw", "user_id": "7pwQ1TrJPz1eTXnxjhAKHQ", "business_id": "oH6QAuoTLFaX97oqqpLTMg", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "New owners. I recently stopped in to see if anything was new on the menu. Nothing is new on the menu. The new owners attitude is terrible. He seemed annoyed with me from the start. If that's your attitude I'll find a different pizza place. Good riddance.", "date": "2018-08-20 07:45:30"}, {"review_id": "aTsJs7HEib29DWNHsJX2mQ", "user_id": "sxap4xXzRxGghi71ybm1_g", "business_id": "duw-3Aj7gAKbQG-isS5UtQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I visited Verandah for lunch on last Friday and our lunch was very good. We had the Seafood Macaroni and Cheese with Truffle, the V Burger and for starters the Seafood Frito Misto. All was very good.\nThe next day we decided to go to the Saturday Breakfast Buffet and it was a terrible mistake. We arrived shortly after the opening and were greeted fine and seated outside as requested. After we were provided our beverages we proceeded to the buffet however there was only half of the food ready. The silver chafing dishes were empty. We then took what was available however once we got back to the table we found the food was barely warm. We ate a bit of it and then went back to the buffet and found there was more food. We loaded our plates and once again the food was barely warm. \nThere were no waitress around and then the man in the suit came and asked if everything was ok? We told him the food was cold and he replied that he would go find out why. He came back shortly after and proceeded to explain that the hot pans were not ready which is why the food was not warm, duh! He walked away.After that a waitress came and asked the same question and we told her the same and she said oh, that's too bad.", "date": "2013-05-18 19:23:17"}, {"review_id": "w_BhRfyVy1EYZzudDdxJLA", "user_id": "CIfb8avje6UhqQZaF74VVg", "business_id": "DcD4NnR24iiUj7w6Q6hxzA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "These joints like TGIF and Applebees are a disgrace to food. All they do is take frozen things out of the freezer and throw into fryer or onto a grill. You don't even to have to be a real chef to work in this place. Just a reheater. Had their appetizer samplers last night. Disgusting. Chicken wings were so old and had been frozen so long. The bones inside were black. Nothing fresh on the plate. Service mediocre. My pet peeve is  taking 20 minutes to pay the bill after dinner. Waitress busy gabbing back in waitress station.", "date": "2016-07-11 01:20:47"}, {"review_id": "PJiUmgN-aUp87ZeUtAzYzA", "user_id": "ILe3tzgnbGSaZfpArtJdjA", "business_id": "8nFcofQcOdXf9dG6YF8RGg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awful place. Tourist trap. I even went through the reviews. The reviews from locals were terrible. The out of town reviews were great! Maybe Galianos is great in Ann Arbor, but it isn't in Old Montreal. \n\nI suggest you just keep on walking when you see it.", "date": "2011-10-15 02:20:06"}, {"review_id": "cD9fudCj9W4hNOn0If222Q", "user_id": "-8i2JNfACRKHPub-KYOkVg", "business_id": "n0NH0FW8NU3zfeJY3QluMQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was just meh. Had the French Dip, a whole lot of bread here and not a lot of jus. Also service was way slow and they weren't even that busy. Talk about under staffed.", "date": "2014-07-22 00:50:53"}, {"review_id": "UVKMbWp9aPyyVMl7fDQiNA", "user_id": "Ldxzq9w2rU3Osg8QHakwww", "business_id": "ItqPtxnayraXSlBS0EMOgg", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "I checked this place out with a business client of mine the other day after seeing the various yelp reviews about it. The interior design is very cool inside and welcoming. Staff is friendly and engaging. They have outlets at the booths that are convenient for laptops and getting work done.\n\nFood: My friend had the MTO breakfast platter. According to him it was good. Bacon was cooked perfectly. Although for the price, I was expecting a larger portion size. I got the chicken in a waffle dish. It was good, but I wasn't in love with it. Once again price was a little steep for what you get. There's a lot of great breakfast places in town where the food is spectacular, the portions are large, and the price is cheaper. \n\nOn a side note there Mashed potato Hash browns are really really good and unique. Unfortunately I found a piece of hair in them......... Being the person that I am I didn't say anything to the waitress as I could tell she was new and didn't want to give her a rough time.\n\nOverall, place is nice, food is a little over priced. Food quality not bad.\n\nIdk if I would come back here again.", "date": "2013-11-06 19:54:35"}, {"review_id": "2QkqtYs9ZmW6Tk8unoBcwQ", "user_id": "gvyYZgFdBbcT3xGjWOvZag", "business_id": "vJvEKFtQ8Am95tWEkiwOGA", "stars": 2.0, "useful": 9, "funny": 3, "cool": 3, "text": "Out of my desperation for needing a seafood fix in Tempe one night, the boyfriend and I went to King's. It was a brand I was familiar with so I thought it would be good...the result? Very over-priced, over-cooked, bland seafood. Fish and chips were not nearly as good as George and Dragon, the shrimp was rubbery, and the clam chowder tasted like it was from a can. The only good thing about the meal was the complimentary sourdough bread and the servers were very nice and friendly. Not impressed.", "date": "2011-03-30 04:20:38"}]