[{"review_id": "Bpz-hVK4ofhAgHg0D63Q4g", "user_id": "Mn7qL2rLZvtqLdBg7-iPsQ", "business_id": "VRwT0pscR5vESCrAnUpNwQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I don't know how many times I've passed by and seen the line-ups.  NOW I get why!\n\nFinally braved the line-up to try out Wilbur this weekend.  Unfortunately, it turned out to be an off-night for their cash system which was down, so things felt a little chaotic.   It was cash only, which turned some people away.  I'm not sure if usually you go up to the counter to order, but this night, two people went around the lines taking orders and givng us our order number.  Then we waited to get to the cash, where we were told to repeat our orders while they used their calculators on their phones to charge us.  No receipts were available. \n\n(As an aside, this was totally an honour system.  One could've easily gotten away with not mentioning an item ordered and there'd be no tracking, if one was not an honest person!  Of course, with my bad luck, I realized (after I got home) that I was OVER-charged...maybe a typo on the calculator?  It was only a few bucks, so no harm, I suppose.)\n\nWith two of us eating, while I waited in line to pay, the other took up a table that had just been vacated and cleaned, to ensure we had seats, and promptly displayed our order number.  (On observation, seats turned over quickly, so I think even solo diners should not have trouble finding a spot to sit down.)  Even before I paid, the first order already arrived although we only got guac when we ordered (and paid for) guac and queso fundido.  This was quickly rectified.  Again, this may have been due to their system being down?\n\nAnyway, onto what's important...the food!  Actually I'm not sure I can add that much more to what others have already said.  Everything was SO delicious.  Of note is the fact that their guac does NOT have tomatos, which I prefer.  The queso fundido was so good, I was tempted to drink it like soup.  And the Mexican street corn - the bomb!  Their pineapple salsa is delicious, and the various hot sauces were so fun to try.\n\nAlso ordered were tacos (bulgogi and baja fish) and the S&T bowl.  The latter was super generous in shrimps (I counted 6 good-sized shrimps) and brisket.  I could not finish the bowl considering the amount of appetizers we had.  \n\nI have already made plans to go back to Wilbur and hopefully I will see how efficiently the ordering process runs when the computers are up and working!", "date": "2016-06-06 21:22:25"}, {"review_id": "-jS6wO1zRN-5ZsaKeYlStg", "user_id": "MzqIP6GLvHgMYcFySf9gGg", "business_id": "rTS8LsUmNIiXsXydE49tPA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The atmosphere is fun. There is a huge blender by the bar and fishing boats with tables in them. I saw several plates of the volcano nachos go past and they looked like the would feed 4-5 people. I stayed with a typical club sandwich - it's hard to mess that up. It came with fries and a pickle spear. The music was loud but not so much that you couldn't carry a conversation at the table. Next door is the Margaritaville gift shop where anything Jimmy Buffet or beach related can be purchased.", "date": "2015-09-07 20:11:28"}, {"review_id": "DlOcqRlIjKolu6iwGz02RQ", "user_id": "Kq_Cg-INSv4i8wNo1kDF-w", "business_id": "k-tg18rWRibZ4jKpoqhb0Q", "stars": 4.0, "useful": 4, "funny": 0, "cool": 1, "text": "I was anticipating their grand opening since a friend of mine said their wings are bomb.com!\n\nIt was a 30min wait on a Sunday, and when my party was finally seated, we ordered: The large wings (half & half), Fries, Bulgogi Sliders, and Japchae.\n\nJapchae was okay. A bit oily than what I'm used to, but it was tasty.\n\nFries were pretty good, but they were quite pricey. \n\nBulgogi burgers were just OK. It didn't really taste like Bulgogi, but it was filling.\n\nNow the wings..... The soy garlic was good, but the spicy sauce was my fav! It's not too strong of a spice, but I liked the sweetness of it & would maybe ask them to double up on the sauce next time (if possible).\n\nThe texture of the wings.. It's not your typically \"fried wings\". The texture is different than most. It's crunchy & just deep fried goodness.\n\nIt was a little oily for me though, BUT, it was really good! =)", "date": "2016-08-19 02:00:39"}, {"review_id": "cByKc0dC5vIPozkognpIxA", "user_id": "ukOaHneyO8PFo2Dkld9Lxw", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "The pizza here is DELICIOUS.\nGet the White pizza. \nBe prepared to wait in a forever long line though, esp during peak hours on the weekends (around 1-3). That's when a lot of people head over there after leaving Marquee. :) \nIf you have a party of four or more, I recommend just getting a whole pie! It's more worth it, and you can take the leftovers to your room. \nEat outside of Secret Pizza! Like where the pool table is. Lots of couch seating available. \nThe secret is out (actually, has been for a while), Secret Pizza is the best spot to grub (after Earl's) after a night filled with sweaty dancing and pounding down shots.", "date": "2012-08-26 04:48:00"}, {"review_id": "gl17dzvYWkKM6EyMeLW3EA", "user_id": "gRkhaXNXQOjOCvRfIiaqww", "business_id": "Fc-CATJZ0rD2pVfcGdPL6Q", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Nice clean grocery store.\n\nThis review is for the deli and takeout food department.  I have had great subs and fried chicken and sides.   \n\n4 stars because they have no brewed tea (sweet and unsweet)  with their fountain drinks.  This is a must have in NC.", "date": "2014-11-03 20:19:14"}, {"review_id": "hChImCXBo4fwyuFUUdo5HA", "user_id": "VkzZ70Byo57CzqcwxYCDXg", "business_id": "38slEWGRKLRSuvTfWVHTKQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This Activity is great for kids and is so much fun. The one problem I had with is is you had to be 12 of 5 ft to do the sky walk. Over all I think you should definitely go and try it.", "date": "2018-09-19 18:50:21"}, {"review_id": "WtQ1MR_TuQBCo0Q3w5C8rg", "user_id": "Ov-0pRQxz5fTTElFE-WtTQ", "business_id": "AMyTUjzB1K2Xud7m0Sqc5Q", "stars": 4.0, "useful": 5, "funny": 4, "cool": 4, "text": "Super nice to have Leslie's right in my neighborhood. Great place, super friendly employees. Bring your pool or spa water in and they will test it for you. Saves lots of $$$$$$ and frustration when you don't know what is off and you have tried everything. Maybe tried too much!!", "date": "2012-09-24 16:40:11"}, {"review_id": "o0TSIDDRcyr4W0bTHzvsEg", "user_id": "x7b_X7RGXds47C3BKdJbXA", "business_id": "WETHRoXB2IbixndSlOktJA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have driven by this area many times on my way back from Target - but I never even knew this place was there!  It's worth stopping by - it's a really cute little spot for breakfast or lunch.  Breakfast items are served until they close (at 3pm).  The staff was really friendly.  The atmosphere is charming, with exposed brick walls, a sliding barn door and quirky décor.  It is actually connected to Metro Pizza next door.  My brother tried the Benicio Del Porko - just for the name alone!  He said it was very good.  I had a turkey sandwich, and was really pleased to see it was made with real turkey that looked like it was sliced right off the bird, instead of just lunchmeat.  And I think they bake their own bread.\n\nNext time you're at Target, instead of going to nearby Taco Bell, or worse - eating in the Target \"café\" I recommend that you stop by Lulu's.  Small neighborhood spots need our support!", "date": "2016-02-06 00:28:57"}, {"review_id": "PXA-qaGk0s2cWipDhahLFw", "user_id": "ZcF-2jI0D6VbBLBu2TQueQ", "business_id": "0F_R1lagYaRVEyUqpjme3w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "My daughters go to Dr. Jack, shes great, i would recommend her to anyone. She has great bedside manner, soft spoken and is great with kids.", "date": "2015-01-14 18:05:43"}, {"review_id": "gYHXNyWKXRsiBtnkSrBiDQ", "user_id": "i4zwGKHKN765hyzIQ9lr1g", "business_id": "AVA3AwMEHfLY9anV3WgDXA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very good food, yummy!!  Will definetly go again. Sign up their app get a free meal, nothing better than a free lunch!!", "date": "2017-10-09 22:22:22"}, {"review_id": "aci-5ka6PmP__BvHbFviRg", "user_id": "qUvjGK3hsWrw311W7SPYfA", "business_id": "EgtyW19V-64c6PmRuvzSEA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The Great Dane Brat and Bacon pretzel burger could stun a water buffalo!  Damn, that is a lot of meat for a tofu eating Pacific Northwesterner.  Still managed to wedge in the deep fried Snicker sundae, which was a bit rich in combination with the burger.\n\nGood, diverse menu.  Draft craft root beer was very good.", "date": "2011-06-16 03:36:59"}, {"review_id": "73mEiFhqs8jDrPx7ZqitPA", "user_id": "AhoxHm569hH_PRkoegDwcA", "business_id": "oJSa5HCiZXKLXxggQmecEQ", "stars": 4.0, "useful": 8, "funny": 2, "cool": 6, "text": "This place is a little pricey, but so worth the splurge!\n\nGreat cocktail menu.\n\nFriendly, unpretentious staff.  Our waiter not only knew the menu extremely well, he also knew how everything was prepared.  For example, the testina we ordered took 3 days to prepare.  I also learned what testina was and that it is delicious (perhaps only when prepared properly).\n\nI had the eggplant parmagiana for my main course and our waiter told me he wanted some!  The chef wanted to serve this dish the night before, but the waiter had suggested the chef wait another day to really let the flavour soak in.  I'm glad the chef listened to him.  Not only did that mean I snagged the last eggplant parmagiana (sorry to the waiter who wanted some), but also that it was extremely good.  I know a lot of people who aren't fans of eggplant, but it's on my list of favourite foods.\n\nThe amount of cheese baked on top was just enough.  Not too cheesy that it took away from the dish, but definitely enough to add the texture and flavour.  Not overcooked either, it was just melted enough, but not hardened.\n\nBeautiful washrooms, although quite bright in comparison to the dim lighting in the restaurant.\n\nLove the lantern-like light fixtures and the warmth of the pine ceiling.\n\nI heard they were going to open it up to the outdoors, but haven't had a chance to return to see if this has happened yet.", "date": "2011-06-13 22:42:40"}, {"review_id": "Q4Dpd-UV2iwu56Czdh9yHw", "user_id": "E_9hh_pokHiYi9-j-IkZ6A", "business_id": "pi4FLFEOn9AhNUxiLbBeHg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Poke is fresh and yummy, kinda a little hole in the wall in China Town, only thing that wasn't great was parking but other than that yum", "date": "2018-03-01 00:12:58"}, {"review_id": "F1yxuUEbGqso42QAm2QYMA", "user_id": "nfZ3UOA062AR6cRdPP9t4Q", "business_id": "Hcg-t9QhHvTeSxnvzMtrtw", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "So I have been driving by this building for close to a month. I finally had a chance to look it up on the Internet. A taiwanese dessert restaurant. I found myself sans-son... (the picky one) and told the wife and daughter where we are going for dessert. Other than being totally overwhelmed by the menu. Our choice was great. We got a Mochi Shaved Ice. Huge for the three of us. Lovely flavors. I will totally recommend this Meet Fresh. I plan to plan my next visit better. Looking forward to trying out the different teas and Jellys.", "date": "2018-04-22 03:17:18"}, {"review_id": "11pTEp8Kqo2mgHd-_f04Tg", "user_id": "KdTV_PAoP4w9afAznjfRXg", "business_id": "SvHAczHxIJ00QlJ9ovQR8g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Haha.. They say you have to have nice shoes to get in; at least the guys do. No sneaks..But my homie had FLIP FLOPS!! Yeah, BOYEEEE!! And my other homies had on Pumas and Adidas! That's how we do it! Ok, so we're not that cool, but maybe we are? The bouncers really do check out your sole attire.. I was looking at where their eyes were wandering. HAHA.... Oh Vegas... \nThe place is pretty dope. Kinda space age-y.. I think they could have done a LIL better with their interior, but you know what? The AMAZING view of the city makes up for it. I went straight outside, despite the FUCKING FREEZING weather...\nOh yeah, the DJ sucked. HAHA.. but we had fun cuz we didn't have a hard time gettin' in, we didn't pay a dime, and ALL the bouncers were cool as all hell...\nCheck it out..", "date": "2007-01-24 07:55:04"}, {"review_id": "d5z_UcxvQC-TYJjIO4r-lQ", "user_id": "iMup9PVfWjMFBItUgbl0eQ", "business_id": "3Z8l7SrEM4J4K-cgWZ0Gaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good variety of Asian grocery food. Price is reasonable. There is good vegetable selection.", "date": "2012-10-24 04:42:26"}, {"review_id": "HMUNK9mbhHueabFOWc4RTw", "user_id": "Zz7wvkHp0mT8dSLgz_lgog", "business_id": "1dYpffQi3qdh-dkXF4LZBw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am stuffed. Filled to the brim with  beer and a delicious burger. \nDoes life get better than this? \nWaddling out of this place I tried to think of a place like this anywhere else.\nExpect about $10+ for the burger and another $1.50 for fries (burger comes with chips). Burgers have a good size patty and lots of options to building you own, although most premium toppings are $1-1.50, abundant choices of toppings.\nLots of beer choices. Laid back vibe. \nLots of people having milk shakes, but after a burger with pretzel bun, I'm stuffed. \nService was great! \nFortune cookies served with the check...LOL! Hysterical! Seriously? Hahahaha! Laughed all the way to the hotel.", "date": "2017-09-16 19:29:32"}, {"review_id": "-FhVueod1514hX5o2FvaSg", "user_id": "L15JCA18Ib_vMUVJILxiSw", "business_id": "MGCTs8GBtkTUFaCAkdDtKw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Mark this down and as a good ol' fashioned bar.  It has been here forever by Las Vegas Standards!  It is a Michigan sports Bar.\n\nIt has a few pool tables, a pretty big bar, and some decent bar food.  It is super laid back and just a regular joint.\n\nI stopped by there for Happy Hour.  They had buckets of Labatts for practically nothing.  I would say I got a little tipsy... everyone in the club was gettin tipsy...\n\nI had some fingers and fries.  Now pay attention - the french fries were so damn tasty.  They had a seasoning on them with parmesan cheese.  It was crazy good.  I know they were just fries, but I would say they could win a fry contest!\n\nProbably not the place for the snooty - but a great low key hang out place!", "date": "2012-05-09 04:15:27"}, {"review_id": "XIdQpcTqs2si2Lqem_kZvQ", "user_id": "zPGB5mqmejWa8J2HSgFhew", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not so secret place anymore. Their pepperoni pizza is super salty and nothing too special. However, their white pizza is pretty awesome. If you like garlic, definitely a must.  Price: $5.50/slice and $28/whole pizza.... on the pricey side but it's a Vegas experience.", "date": "2015-02-21 03:15:03"}, {"review_id": "GaRC0VOgdvDKVfTDaGoDng", "user_id": "kyMpncw5k_olRbGPiDH-nQ", "business_id": "2DmTw0k3bcXuHdAyxO_bkw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good food, fun combinations, beautiful space. The place was packed so the staff was bit behind, but very friendly once they were able to get to me.", "date": "2017-04-03 19:01:04"}, {"review_id": "XPIxBBr5QTK6Ww2-W5a9dg", "user_id": "84FuHcNTIIkkyMbO1I_gPA", "business_id": "TtbCOwOpNNzE7fW5CFwyng", "stars": 4.0, "useful": 3, "funny": 11, "cool": 3, "text": "As I have now been out of the state of Arizona for over 90 days--clean and sober from Bosa I feel I can update their star rating.  I've been spending time in a pastry recovery program and even though I relapse daily, I'm confident there is hope. \n#1DayAtATime.  Perhaps when I fully recover and am able to drive past Bosa without binging through dozens of donut holes, I'll restore their 5th star!", "date": "2014-07-22 01:43:53"}, {"review_id": "IQf2SaovzIRIpmqx4IQbyg", "user_id": "TAUwQExTxDnpPwqhouhJcA", "business_id": "DgSIKs5i1wtM2ZO1RmdqNA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Love this store, whether to purchase stuff or just get some good ideas on how to decorate.  the staff is always super nice and helpful and always have lots of great stuff in stock.", "date": "2013-04-20 17:16:49"}, {"review_id": "sxFlmXrUtBggyDeO4K47cw", "user_id": "2f1QeT1c0wAB6Xz4FBhCHA", "business_id": "4U9hnKTGidPKOSu_28m9dA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best lunch in liberty. Delicious sandwiches but also very slow. Call ahead for takeout or plan to stay a while.", "date": "2014-07-21 16:04:25"}, {"review_id": "TDyke-RxANmRkKOd2S8D9w", "user_id": "lgcGW6q2sRt_mvB59w-18w", "business_id": "k8BqCejnaMlw7aoVthvqyw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been at this place several times and every time it's good the numbers are hight and the food is good get some", "date": "2017-08-03 13:59:41"}, {"review_id": "757CeL_mtW4SHoJWJ8yIsw", "user_id": "ZiDk8UlMbn1UBwfX_vlzGw", "business_id": "uivpqxLmLXhuargU1f6uGQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Very good food for fast food place! Not a fan of seating with metal chairs and small interior but nice to eat outside or to go", "date": "2015-12-13 13:52:23"}, {"review_id": "-f650QLHb3DBwrqP4keFZw", "user_id": "CZs1Eq7t1fqpXV1yox-CVg", "business_id": "KQoeETpQ1nBEQ6fVOtFgWQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "Stumbled upon Hamptons one evening while perusing the shops and restaurants in Tivoli.  \nEntered and immediately noticed the indoor / outdoor bar seating!\nGreeted by the bartender- attentive and enthusiastic!  With that, we decided to be seated at said bar;)  the bartender immediately and cheerfully provides us with a run down of his clearly vast knowledge.  Is he a bit of a legend in the circles of bartending?!  We order and said bartender makes sure our cocktails are chilled to perfection and we are satisfied!  Now, bring on the appetizers and entrees please.  We had a number of appetizers, not a few (a handful).  Then the entrees and those desserts cannot be passed up!All were palatable, served perfectly and with a personality.  Now, let me give said bartender a name- Andrew. \nI've returned a number of times just for his enthusiasm, service and care of making palatable and delicious drinks!\nThank You!", "date": "2018-06-13 23:42:26"}, {"review_id": "LpdkMb0sMBJhu3BSfJQvNg", "user_id": "VlvRySdj5uSHTOyslYfEjQ", "business_id": "OZ9tVs7c5blngLkoovh5YQ", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "Very helpful staff, mark is very nice. They have a good selection of juice, mods and building materials. They have made me feel welcome everytime I go in. I would definitely recommend vaporice to anyone who wants to start vaping", "date": "2014-09-19 09:37:57"}, {"review_id": "ikLZWgR8A1SKNsrZRKv7EA", "user_id": "xpd1zzGnalK8zboHaS2vtg", "business_id": "hdnrqrYJE1RkoUH4MFq3Ag", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Was wandering around downtown Toronto trying to find somewhere to eat. Went in here, and we were seated fairly quickly. Our waitress was very attentive, and brought us our drinks and food quickly. She had suggestions of what drinks and food she thought was good and she was spot on. I got the bison burger that had apple pieces, apple bbq sauce, and Brie. The burger was delectable, I would easily order it again. I left here full and satisfied. I would easily come back here for just a nice sit down place to get good food.", "date": "2013-09-22 02:39:27"}, {"review_id": "p3-Jr2xmlZiZSYv8OQMjVA", "user_id": "EdoaXWhpn0WQluWVz1REIQ", "business_id": "0FUtlsQrJI7LhqDPxLumEw", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "For all those people whos experience was not so good at Joe's.  We have been going there for a long time! And Yes! The garlic fries are the hit of the menu, for that matter any menu. We have never had a bad meal ever! Maybe they ran out of tea a few times, but after mentioning it they fixed it right away. And as a group we have had most of the things on the menu. None ofwhich disappointed!", "date": "2015-01-27 04:23:28"}, {"review_id": "MbvXv8zeIF-vtwigJF_RNw", "user_id": "hcnBcIpv7tILRy1wueL-gg", "business_id": "gOvEzwpu3KbW5aJReQzYRg", "stars": 4.0, "useful": 11, "funny": 2, "cool": 4, "text": "They feature a variety of poke bowls. Personal favorite was the classic and albacore tuna. They spend a long time marinating the fish so you can really taste the flavours. The rice was well done as well. The storefront is a bit ambigous, at first it was hard to recognize the white font on a light blue fish logo sign, but luckily the entire store front was all glass, so you can see through to the inside and recognize the hawaiian decor. Would go again!", "date": "2016-10-09 01:11:24"}, {"review_id": "BklNL0rAogmhJoM-50qV6Q", "user_id": "2QvvEgSODd6nMcN73GcBUQ", "business_id": "KFrJTt-NTXUrsdr7BGx5dg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Solid selection if meats, salads, hummus, toppings, ect. The service was fast and really quite friendly. They accept credit cards, cash, and even square if you are into that movement. The original gyro and side salad is honestly more than enough food to feed one for dinner. They also have a wheat pita option but you might have to ask. The ambience is clean, quiet, and nice all around. Parking out front is a little hectic but I believe there is more around the back. Enjoy! I know I will be back when I return to Phoenix.", "date": "2014-10-18 21:32:01"}, {"review_id": "P1Kp6Ac8s3ZRG-KZC2YhpQ", "user_id": "y0pSw9bOSc1PjCYfwFVSUA", "business_id": "gBEWJ4b2OvUmN4Oh7ju3hw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I just love the food here, I am always impressed. I love the small hole in the wall (clean) family feel. The service is amazing, the food is ALWAYS fresh, and he Saki variety is really good! It's just all around good, but don't pay the outrageous delivery cost ($20) save yourself the money; and just pick-up!", "date": "2016-08-11 19:00:18"}, {"review_id": "jOWhe9909Sz15nOy2XRkLg", "user_id": "IhV5kw-KWMyPNuhzTrT_-g", "business_id": "zgQHtqX0gqMw1nlBZl2VnQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I just had to try the infamous Momofuku Noodle Bar! It's this chic restaurant next to the shangri-la with 3 floors of seating. I'd definitely make a reservation before coming as there was a lineup of people waiting to be seated. I was running late and had to push back my reservation- which I was able to do without any hassle! Great service :) \n\nMy table started off with the pork bun which is this fluffy white bun with a slab of pork inside and other garnishes. I would've preferred the pork to not be such a block of meat as it made it a little harder to eat and tbh didn't look very appealing. However, it tasted realllllly good. The oiliness of the pork really complimented the softness of the bun but I wouldn't get it again for the price. ($6/bun!!)\n\nI ordered the extremely spicy noodles as I am a huge spice fanatic. They serve it with soy milk (which I think is actually so cute lol). Pretty thoughtful as the soy milk def helped tie the whole meal together when I was done!! You can opt to get it with Katsu or fish for an additional cost. I got it with the katsu and omg it was *so* good. Rarely do I go to a ramen place where their spicy is actually spicy so I was thoroughly pleased!  \n\nI took off a star because they don't serve hot beverages. What's up with that??", "date": "2018-08-20 17:42:40"}, {"review_id": "qgGe8A50SS1GEMwFS0clMA", "user_id": "mcyD9HLoQViKTBh8LTjK6Q", "business_id": "bs07-hLuz0dq06gIUwR5mw", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "Downtown PHX can be hit or miss with food. I had a dinner meeting with someone and thought I would give it a shot. While the place was pretty empty at 6pm, it picked up as the night went on. The food is a bit pr icy for the location in the AZ Center, but the service was excellent and the food was solid. I cant say that anything special stood out about the place, it just seems to work well. Wait staff was attentive, but did not hassle us too often, as can often be the case. The food was fresh and well prepared. I would recommend it if you are looking for something nice, but modest in atmosphere.", "date": "2010-01-29 05:46:34"}, {"review_id": "Qe10emXFpXQjWRqJUw65XA", "user_id": "uav6nwbBCZTqCG_W4FiceA", "business_id": "i5snLVanPG1R9foC0QfkXQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is one of my favorite places to eat chicken fingers. The chicken is great (get the special sauce!) and tastes really fresh.\n\nThe owner (mentioned Chris' review) is a cool guy who seems to really cares about making great food. They've received really great health reviews lately so he's apparently gotten his act together on that end.\n\nOne interesting thing is that every time I go, it's never the same experience. One time they don't have waffle fries, the next time the toast is different. Last time, they didn't have bags for our take out order.\n\nI never see that many people at this place although I've only been in the summer. I hope it stays around for a while.", "date": "2008-07-13 09:22:51"}, {"review_id": "WPEeGgOI6w-GPQeVki2WYQ", "user_id": "uQslm2HovNqMmPNxl2MgYg", "business_id": "qxVcSWGKyH3HkkHV8NinDA", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "First timer here.  Sat at bar around 2pm since it was just me. Brittani (sp?) was quick in greeting as she was working the other side of the bar.  The barback meanwhile was chatting on the side with another server.  He came to ask if I had been taken care of right as she was coming over to take my order.   The meal was delivered promptly.  It was hot, eye appealing,and delicious - the fish tacos.\nThroughout Brittani continued working the bar and had time to ask if everything was alright.  Server who dropped the entree of didn't say a peep.  Usually a \"may I get you anything else\" would follow delivery.   \nThe two other bartenders who arrived later, Mallory and Nicole, were just as attentive and friendly.  \nOverall, I'll be returning and recommending.", "date": "2018-03-09 21:58:11"}, {"review_id": "IahkFFNNCxtxKwr43Z-I3w", "user_id": "CwLEKnnODT2zSpqzsLojFw", "business_id": "xvcGZGoLwWpmDMMY1VN-OA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I came for lunch and loved it. A very spacious interior provides a comfortable, relaxing atmosphere quiet enough to talk without over hearing those around you. The restaurant was very clean and seemed to be a point they are proud of as well. I had the Italian Panini and a Lumberyard IPA. The panini was delicious and would recommend it. The have a good beer selection too. The service was timely and accurate and the prices were fair. I recommend this place.", "date": "2015-03-26 15:13:57"}, {"review_id": "X-g4dKDjiBQpaHwW5VLKeA", "user_id": "R1bIQRSNg0us37blGV5JrQ", "business_id": "JuhbUwZRKoDsc1zACJGxxQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Difficult to find in NYC but easily available in Montreal.. They let you sample the menu before you order and the food is good.. Simple eats but great service. Merci", "date": "2014-07-06 13:24:52"}, {"review_id": "Yl8oC4pYReC99KCm4Bsvkw", "user_id": "eyf2Vv31Njmn68GVW4JrsQ", "business_id": "FuYcbqKT2JKD05RYvvELaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fun place.  Good drinks and a casual crowd...\n\nThey have a whole lot of old retro game systems like the Nintendo NES, Sega Genesis, and even the Atari 2600.\n\nThe sangria was pretty good.", "date": "2017-10-08 01:24:49"}, {"review_id": "7YdsIJrH4G9n0mo9gPaycA", "user_id": "FX7BjzTJAuCAul1eXyRWqw", "business_id": "v5zzCmCf1L4Utjit12EMuQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time trying a Brazilian steakhouse.  Some of these reviews may have been written when  the team was still new.  Dinner last night was great.  Server Emily was attentive, Colton was out primary Gaucho and he was fantastic.  Manager Shawna checked in several times.  Great food, excellent salad bar.  Everything was very tasty.  Give it a try!", "date": "2016-12-11 18:20:48"}, {"review_id": "v6jFL-oCT3tOtFs24QI_gw", "user_id": "hFDFHO70fyENIQ1bbtYufQ", "business_id": "sfYHVPv4ZBJdu4hImx2wjg", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "A surprise small market with good produce. The blueberries here are great and cheap. You might want to check their chocolate section. ..locally made.", "date": "2012-09-22 19:24:32"}, {"review_id": "mBSe4d5MdqvrgfESQ7akTw", "user_id": "tKFex-Twu-W2s52WrRMseQ", "business_id": "G6BwYw_0_atLPTzI1uokIA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was a lot of fun. Much better than I expected. Average portions that taste pretty good. The difference maker was the great customer service. I will definitely be back. Had a nice menu that I want to sample. Happy Hour menu was good. Lots to choose from. I will be back!", "date": "2016-04-16 23:21:06"}, {"review_id": "Agz2InHRcv57CIV8wnwF4Q", "user_id": "XEHZoTDWjw3w-gcQyYIe4g", "business_id": "ltQ-ilKwrlBtub7b_7gKww", "stars": 4.0, "useful": 6, "funny": 4, "cool": 4, "text": "Staff is great. Everyone knows what to do and when to do it. \n\nI had the corned beef on a hoagie roll toasted with Swiss and 1000 dressing. The meat was shaved like a porn star and had good flavor. The roll was fresh and tasty but not toasted enough. The Swiss was plentiful and not melted at all. \n\nOverall the sandwich was a 3.85. \n\nNothing screams 5 stars yet.", "date": "2010-04-08 20:15:30"}, {"review_id": "DyIldmk3xI2tssKsmj43gQ", "user_id": "hd-S4mtrPY9Q6iuBJegnOQ", "business_id": "p4qvXkb34X8hgidxEZ33Gw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Oh my gosh- such a combination of delicious wonderment!\nWhile visiting my daughter's family in Madison I know we learn about the best places appreciated by local families.\nWe had a curry with noodles, a beef and green bean dish, sticky rice with mangoes and a rice and pork dish. Will check on the names of these yummy delights on the menu but truly you should high tail it down to Ha Long Bay.", "date": "2014-03-08 13:37:23"}, {"review_id": "HSWpic35JpOVokth7S0tLg", "user_id": "gSr7j5_jwsFJCaT3LaG91A", "business_id": "GAHO3393t6r5xFhfLl9NEw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "So I decided to go to this place with my fam jam after looking at the reviews. I have been looking for a good place that serves delicious pad thai and I was glad I came here :)\nThe chicken fried rice was not too oily and it was quite flavorful. We also took the spicy chicken stir-fry. We knew it was freshly made as the veggies were super crunchy. \nFor dessert, we tried the Jackfruit smoothie. Not too sweet and filling, the size of the smoothie was large (we regretted not splitting it between 2 people).\nIn all, this would possibly my go-to place from now on for authentic Cambodian food!\nThe service was pretty good too.", "date": "2017-05-06 15:54:46"}, {"review_id": "7c69VGg5I-OJURxEnLOoGg", "user_id": "trO6aQpnXxRXqIyKQ_ryrQ", "business_id": "fweirQtdgcrIQ61jk6RdyQ", "stars": 4.0, "useful": 2, "funny": 1, "cool": 2, "text": "I really just went in to exchange some items my little sister received as X-Mas gifts. I do have to say, this place wasn't my 1st stop. I went The Children's Place in Meadows Mall but they were so rude and unwilling to help, not mention under-stocked, I was referred to this location. I'm glad I did come here.\n\nI could tell from the moment I walked in that they were fully stocked and organized. Although, the store is smaller than I'm used to, it's still larger than the one in the mall. It was confusing on where the line started, because the line area is so small. We just picked a place between the shelves and racked and waited, hoping that we were not skipping anyone or being skipped.\n\nI was in line for a while. They were slightly understaffed. There was one cashier on the register and she was new so she was operating slower than a seasoned employee would. She worked with the same customer the whole 20 minutes that I was in the store (Apparently the situation was complex and the manager had to walk her through most of it).\n\nThere were 4 or 5 of us in line so the manager had to jump on a register to knock down the line. She didn't seem to happy. I guess she didn't expect a big rush on a Sunday. Either way, she allowed me to exchange the Jeans and Leggings, which I was happy because the store in the Mall didn't have the products and refused to help me.\n\nIt took only a few minutes for the transaction, after I picked the new clothes. I expected her to be as rude and unprofessional as the other store but I was surprised that she wasn't. She didn't have a lot of conversation for me but she did smile at a joke a friend and I made. She also explained the difference between Skinny and Super-Skinny Jeans. Her explanation wasn't that good, but I understood what she was trying to say (I only asked to start a convo lol).\n\nIn all, I will be shopping at this location from here on out. I like how easy it was to find what I was looking. I have already added this place to my \"Need Clothes, Must Go!\" list.", "date": "2016-01-11 23:05:37"}, {"review_id": "3YneG5QRB-7cqDc37YQeGw", "user_id": "0BBUmH7Krcax1RZgbH4fSA", "business_id": "dgpPVSFL84ONx477Lln2sw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "I heard so much about this place, I decided to come and find it. Granted, I did not try their coffee yet  - but I LOVE this space. \n\nIn a small building, it's quite large. Tons of chairs, and tables for working. And it's quiet. Free wifi, and no one will bug you. It might be made to be a coffice.\n\nSeems like there is a lot of coffee events here, so not sure the work envirmonment when one is on. \n\nThis will be my new coffee haunt when I need work, and I'm torn between here and my love for Rooster Coffee up the street. \n\nThere is free parking on Matilda St. How nice.", "date": "2013-10-17 17:58:48"}, {"review_id": "tH4rWTYvsSR4mbM9N97QmQ", "user_id": "xoEC-0lXwgEJD6iWCTrMOg", "business_id": "MWfVSlO_SzJYnPEAUd4iEw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The hotel was great. The front desk folks could have been a little more pleasant, but overall they were ok. My room was very comfortable. The bed was great. Flatscreen in the room with several HD channels. My room overlooked the pool and where I parked my car. There are several places to eat and fuel up if you need to. The hotel is very close to the highway. The free breakfast was very good. The wifi was free and fast.\n\nMy only compliant is not with the hotel but with the way the Choice Privileges handled my stay. Due to the fact that I booked my stay using points (10,000 points) my stay did not go towards my account. On this entire trip I stayed at different Choice Hotel chains. The Choice Privileges people should be ashamed by not allowing me to have my points and credit for this stay. Nothing against this hotel, but this is the type of treatment that makes me want to avoid any Choice property ever again. Lesson learned Choice Privileges folks, I WILL NOT STAY AT A CHOICE PROPERTY EVER AGAIN IF I'M BOOKING WITH POINTS!!!!! Because of this, I do not qualify for the free night promotion that Choice is currently running with their Choice Privileges program.", "date": "2014-03-25 19:57:06"}, {"review_id": "4bjeLnHe0nYvBVceTSqa7A", "user_id": "5ZF8fsF1byZEd8cmVrHjyQ", "business_id": "lQgO_uT6KUAzTLUqTTspcA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Very delicious food. The kale salad was super yummy. I had a vegetarian polenta dish that was really good. Very nice dining room that is not too large.", "date": "2017-01-10 23:21:28"}, {"review_id": "dipNbrgs-jkWgvFAOg_wlw", "user_id": "rJqmB3F93EwLxUSKFLGg1w", "business_id": "46Ld9Qc9nAx_A0jwclNZiw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really love that place, perfect for a nice lunch break when strolling in the old port. Quality ingredients, finesse in the preparation, not too overpriced, and cutest decoration. Only down side is the line, which can't be helped in Montreal's top gourmet restaurants.", "date": "2017-09-28 00:44:06"}, {"review_id": "WC3gMrs1M57i64YdVrc1Hg", "user_id": "w-pfyKtvUszCTVfWhgVC3g", "business_id": "SIqwJPn603ChWpxneRpVag", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty much know what to expect and what you're getting with a Jimmy Johns even though they are franchises. They're typically all the same. They're fast. Sometimes they forget the peppers. Unfortunately I'm 1/4 mile outside their delivery range.", "date": "2018-02-06 20:38:11"}, {"review_id": "TCr3CDuLwnyvZ2z_X4qDBw", "user_id": "7OJimEkNPTXgLAj5hKRMlQ", "business_id": "k-tg18rWRibZ4jKpoqhb0Q", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I have only been for lunch, and think this is a solid option in the area. I have only had the wrap which is good and very filling! The seasoned fries are also great, and only $3 for lunch, I feel like the dinner prices might be a bit high so will stick to the lunchtime visits.\n\nI agree with the tip about calling ahead for takeout, it can be a very long wait.", "date": "2016-08-31 03:16:49"}, {"review_id": "Wq8LKnMpfMic-5_ygFgMkw", "user_id": "3pxtW-prGMbe4tnvxNCGcw", "business_id": "Net_BZG7t8JRLjXxNtvyNg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere! I really dig the entire set up and the service is impeccable.", "date": "2016-02-29 02:23:00"}, {"review_id": "5p3RwS0DWGT34TWsG4Et-g", "user_id": "FaUpV-0Mo0MbPgnuuAvBIw", "business_id": "iQ7tfyfw6lNMre4EIbXpSg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stayed here on my cross-country trip. La Quinta was the only place in Phoenix that was affordable would let me bring my 90 lbs lab. The hotel is well lit outside and the staff is very friendly--they even provided a wine opener. The one downside is the rooms are run down, but if you are staying to just sleep you will be fine.", "date": "2017-01-09 17:57:10"}, {"review_id": "5AXiQ0UHk8l3Ecp88pogFw", "user_id": "ZEgJMMjYruWPzQtY8R_Xvw", "business_id": "JMiaNitMzMbJm6Kh0RbT5A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with a couple of friends for their Summerlicious 2015 dinner menu. It was quite busy at that time and we arrived early, but we were quickly seated at our table (I also wished the lighting was stronger...but that is their restaurant design). I could not have foreseen it, but when I first saw the food I thought I would be hungry given the small portions (as more expensive restaurants usually give). The food was, however, very filling and savoury. The greatest takeaway from the restaurant experience was the view of the CN tower and city at night (amazing!) and the exceptional customer service.", "date": "2016-02-19 00:08:30"}, {"review_id": "twy3tt0IZCmLNH9zlmL2Bw", "user_id": "bYi9dDPQiDVtwxFMlIhz6g", "business_id": "q80WmfxmifLBdB8_rPYu1w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great variety of tasty Hakka style Chinese food. Prompt service and reasonable prices.", "date": "2016-12-25 05:50:37"}, {"review_id": "0AZUOdzZG5lRAXZ_mKss0Q", "user_id": "Aew1AHMO_Bs1pxQtRYF2xQ", "business_id": "024QUHVU7nlyW5y2BeeGLg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Table chef, does great show, really likes \"fire\". Prices in par with other similar style places. Service was great, only complaint is WAY to much garlic!  Chef put liquid garlic concoction on EVERYTHING!", "date": "2018-10-01 16:41:55"}, {"review_id": "EnFRcwYW2EzSe_wU4Mhm7Q", "user_id": "p47CQe-EtDqFjpre7O0GWg", "business_id": "_5PJ4GHIXNdUdXtohylKGQ", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "A great brunch place worth checking out in Cleveland.  I highly recommend their latte and the shipwreck especially if you are looking for a meaty breakfast dish.  I got the omelette which was well cooked but I was overwhelmed by the amount of spinach and mushrooms in it.", "date": "2016-09-25 00:06:07"}, {"review_id": "J20PVSF4wzWzooQxSQklIQ", "user_id": "DIL-EZK8_ibl_Q6gCi0krw", "business_id": "kfwpXBsMQLqhUvscWB6b9g", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "The indian taste restaurant is located in the Donut Works restaurant.. I asked the hostess if they still carried donuts she said yes but that they switch over to buffet after, pretty weird but whatever.  The food was pretty good the buffet price at lunch time was in the 10.00 range.  No kid prices for the buffet just one price.  Bottled water is the preferred drink I suppose it was cool so that was a plus.  I also ordered a mango lassi which for 2.49 was a deal in itself. I couldn't even finish it.  Takeout is on the expensive side but If you're going for good authentic indian food GREAT!! If you're going for the decor, make the drive to Jaipur Junction in Hudson.", "date": "2017-02-04 22:24:49"}, {"review_id": "VSP03HdRaq3KFHxKTH0EYQ", "user_id": "GsVW5t9MXP9UsHA0HNq1jA", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "Came here for brunch....amazing. The food was delicious-fresh& tasty. The angry Mac N cheese is a must try. (Warning:spicy)\nAnother favorite: the French toast (moist & flavorful). Chocolate covered strawberries & apple donuts were my favorite for sweets. \nThe place is beautiful & modern. Short wait. A bit pricey $39 per person. But worth every penny. Come hungry-there's more food than you could imagine. \nTook away one star because it's a bit pricey & also for there pork looking pink. \nSausage and meatballs that were pork had a raw like pink color. Waitress told us it's from some colored salt or seasoning of some kind. Still, I couldn't get past that it looked raw. Gross. She assured us it wasn't and had chef check temperature on it. (Good service).", "date": "2013-11-30 18:03:50"}, {"review_id": "NrPmuhQkJ8Ht8ymY-2UL3Q", "user_id": "ETw20Fu1CKRi1SlO_fDg7Q", "business_id": "gTlDDzDEHyDQ6iwjNhpI6A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Decided to try this restaurant as it was highly rated Indian restaurant on yelp. We went during long weekend dinner.\n\nPlace : Ambiance is big but bit dark.\n\nService : This is where I cut one star. We had to wait 15 minute before owner/server took our order. We enjoyed free papad in mean time.\n\nFood : We ordered Paneer Tikka & Malai Kofta. Curry came with rice. I loved the taste, my wife didn't (it was bit spicy for her). Food quantity was big.\n\nPrice : Reasonable considering quantity, free papad & rice.\n\nIt was good experience overall.", "date": "2017-02-27 03:29:34"}, {"review_id": "0YN3basyWZ4gOOJ4ViPGzw", "user_id": "Dy7UctUxEtAj5jdUBniVMA", "business_id": "9PGhcb_ozHN_qa4ZIFK-_Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been coming here off and on over the past year am very happy with my experience.  The place is clean, upbeat and the beds are well maintained.  \n\nMy experience with Brittany has been excellent.  She is always helpful, energetic and happy.", "date": "2016-03-24 17:32:03"}, {"review_id": "cEt4EKFf4C9lx7gEYFilzg", "user_id": "Ty2ZuT8-K9MNaJKBdUrJXg", "business_id": "cXmlv2WBzuB6JLMhaCvLuQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We came here for lunch on a Sunday and ordered the seaweed salad, chicken Kung bao and lamb skewers (with an extra one for checking in!). The service was pretty slow considering the amount of servers to patrons when we went. However, The food was delicious! The lamb was well seasoned and the chicken dish was just the right amount of spicy and sweet. I didn't love the seaweed salad, it was a little oily for me. But otherwise, we enjoyed our meal.", "date": "2015-04-09 17:17:16"}, {"review_id": "DGW7naNpwbv1EyHO4N1bBQ", "user_id": "45VFbv2t3oMrvx8kk2535g", "business_id": "AD5r187-LD836JW6ERa9Cg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time at any location. Great country atmosphere with the general store and old style decor. We were sat promptly and the entire staff was courteous and helpful. We ordered both breakfast and lunch dishes. \n\nDidn't care for the grits or the gravy, but everything else kicked ass! Crispy fat bacon, sausage patties, pancakes, hash browns, Mac and cheese, WHoah!  Would definitely come back to try something else (or get the same thing).", "date": "2016-03-22 19:53:59"}, {"review_id": "C2E90AOKN01hw53l_JKPVw", "user_id": "bxaICaGxzYHSB1MsztlGdg", "business_id": "CqKa_LEbFfhwCVCmcn1Q4g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We loved this little restaurant. Service was okay, but their amazing tomato spaghetti pasta made it all okay. So far, this is the best tomato pasta I have tried. My boyfriend and I were going nuts on the sauce - just saying if you are into those kinds of things! Pizza was good, crust was thin and well baked. Toppings were fresh. I'll have to go again and try another flavour (my boyfriend ordered one I wasn't crazy about but he was :) ). Their wine is good too, so it was a nice addition to this meal. For my Italian cravings, I'll know where to go!", "date": "2015-10-03 14:41:43"}, {"review_id": "IyAykYNLVB2ig_VTAI8a3w", "user_id": "LbJcCxgG4Xq6QHbSe3GQIQ", "business_id": "tNYmZEKXXvroyDt4IJX1cw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service department helped us through a flat tire, that really could have been expensive! Knowledgeable techs.", "date": "2018-02-17 01:16:10"}, {"review_id": "sKiLfBiAAUj-YIRumshT0A", "user_id": "TIFbwK1AnjiFvN76dP1M5g", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "Have your cake and eat it to . Wicked spoon has a quite the spread . I've tried both dinner and breakfast and breakfast far surpasses dinner . As for breakfast there wasn't anything even remotely bad on the \" menu \" and desserts are the same for dinner so you're not missing out on anything . Now as for dinner there was some good some ok items . The salads were fantastic and so was the friend chicken of all things . The steak was over cooked the pasta super chewy and a little dried out . Ehh either way I'll return !", "date": "2015-06-03 22:31:43"}, {"review_id": "8YTZpUIW-qU9SNbalp5bIw", "user_id": "I_YnqZySExnM-IPOcs7UyQ", "business_id": "mwE5uNVkxCXvEuVa1KQ_3g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is my neighborhood bar....love the atmosphere and offerings. Rhea is the best server and only person we rely on for our orders!  Management is pretty good but could cut some of the lack-luster employees.", "date": "2016-09-11 20:48:45"}, {"review_id": "Efv3uRB9XibnmLS_iVKVEA", "user_id": "9fkLbah6aOx4FWxT0ito3A", "business_id": "2skQeu3C36VCiB653MIfrw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Delishous!! Great aptmosphere and fun local brews. So happy we stumbled upon Bootleggers! It will be a place we visit again when in Phoenix..", "date": "2015-05-20 15:47:22"}, {"review_id": "TbbbRaz8QEshi7F9YIGcmA", "user_id": "VFp9AYShu_C9T4QsHpM3yA", "business_id": "pL-QrHxQ0kHBDA1ZyOjGQw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Whole Foods cold salad bar has two types of quinoa and two types of kale.  Other than that, I don't find it being as amazing as I used to.  Whenever I drove up to Phoenix, I would stop at this Whole Foods especially when it first opened.  I love the fact that you can find unique items like local, creative flavors of ice cream, probiotic coconut water, and udon soup.  I also liked being able to try on Toms shoes.  I am still annoyed though at having to pay a \"dine-in\" tax if you eat on the premises.", "date": "2011-04-04 03:32:41"}, {"review_id": "5KQSSYGl98lti6Rbryu5Mw", "user_id": "DAt-A8_s1xeyJTeaRjrBSQ", "business_id": "Rq2rdq3Za9kfF-UE_x8VOA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "From the outside it was hard to gauge how utterly relaxing this center was.\nWhen stepping in, the lobby was decked out for Halloween and the receptionist acknowledged me and called my 1st treatment.  Acupuncture from Keri.  The crystals, low lighting in treatment room, soft music,  it was exceptional!   You could feel the positive energy.  She offered great customer service,  was welcoming and friendly.\nAs she talked and asked me questions I felt confident in her and felt she was pretty knowledgeable.   The acupuncture went well and I was very relaxed.  Was also interested in a facial and a massage.  Pretty sure I was asleep by the end.  Lots of services available here including: chiropractic care, massage, facial, reiki, acupuncture, energy medicine, and full body waxing for women & men.  After a day of hiking, this center is a must!!  Glad I found this and hope to be a regular here.", "date": "2017-10-31 05:20:37"}, {"review_id": "WwcH2_MsKDAEW-nYOrw58g", "user_id": "oC15k2LvszXv0BKHXt5zvg", "business_id": "YoLipZK51s1ZeX656oQYOQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had a great experience at Vagas Ink! Melissa hooked me up with a great Tat! Will be back for another Tat.", "date": "2015-07-23 18:47:19"}, {"review_id": "ujYv663qjIxH9qcM5A2DwA", "user_id": "47o3g8bBfB502lG9yO3A1g", "business_id": "odhwxNT5Y1qWB8v_rdmS6Q", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "This place just opened up in the Alton Towers plaza.  They did a good job of renovating the space (it had been closed for almost 2 years). It is also quieter than other dim sum restaurants I've been to. We were able to get a table right away but this might change if more people know about here. Dim sum is 3$ before 10:55 and after it is a set price per size. We ordered 6 different dim sum items plus a dish of fried crispy noodles with shredded pork.   We were impressed with everything. Good taste and all is well cooked. We were also pleased with the quick and friendly service. Will come again, especially to try the dinner menu.", "date": "2017-12-10 17:39:54"}, {"review_id": "AYdPNpx1oLQvZ5sNb7U5Fg", "user_id": "NdHGV2JmZmhYG1tSCRwrBg", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Not the first to review obviously... so i'll try to keep it to the point. I went just this last Saturday. \n\nObvious:\n1. beautiful decor... hello! it's Encore... \n2. crowded as heck... it's at its peak of popularity...\n3. crowd varies, from great looking to not so great looking... but yah like i said peak of popularity, everyone is trying to check it out.\n\nPros:\n1. HUGE! our group got split up and lost in the first few seconds of walking in\n2. available seats to rest at\n3. wading pool for tired feet\n4. good ventilation\n\nCons:\n1. HUGE line... but organized. Get there early! we got there a min or two before 10 and while the line was intimidating we didn't have to wait as long as I expected. \n2. no guestlist... sorta... they do bc we were on one... but don't and can close at random times blah... i guess i'm just not in the-know enough hehe\n3. music was only so-so to a large portion of my group... i was cool with it though\n\nOver all... get there early, be patient, be nice... check it out at least once if not more. Drinks strong, bartenders friendly, bouncers nice (to me at least :) XS and Tryst are my fav at this time :)", "date": "2009-06-30 18:17:22"}, {"review_id": "tfops-Ale0AnMne3OYFh4Q", "user_id": "W_CkghBYSgJIJYi44GBTPA", "business_id": "kfpaN4ookWht6XgJjGhHkg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "They have plenty free toppings including caramelized onion. I often go there to grab a quick lunch. The burger is fresh. However,their dining room might not be the cleanest. Last time when I went, they had some problems with the air conditioning machine,and staff did not mention so water drops on my head. Apart of that, their foods are worth the price.", "date": "2017-02-16 17:45:19"}, {"review_id": "kKDxsTrjcfDQNGtFB3mXbQ", "user_id": "2Zo30nYe6gwBsKRpvCyzkA", "business_id": "ZU4sZ0_PB918bK9h6z9l0w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I always have a good time at Wurst! The staff is so friendly and helpful. My friend and I didn't like the wine we ordered and they gave us another bottle. They have a great selection of beers as well. I am vegetarian so the food menu is not for me but otherwise go for it! Music is always good! I highly recommend the place.", "date": "2016-06-17 03:11:44"}, {"review_id": "qBcCuJ6xasg9CPbAIcsHpw", "user_id": "G3civyLatxrzYk0lln3MUQ", "business_id": "D-8yidw7FLKKQpciKJSd2g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hipster-y, just like everything else in this area. Captain Jerk and the Atomic Burger are certified goodness. The cheese in the Atomic Burger was something I craved for days after. Fries were fresh and the dips were good. Plenty of seatings for dine ins.", "date": "2017-09-04 06:59:37"}, {"review_id": "wq8HMZ4TaOG4Vu968tRdZA", "user_id": "c5UIr_BJtN6-7X1iD03SHQ", "business_id": "8mKV3KThn3wXGL3OVxrCNg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very clean and attractive place in a former bar. They've kept the bar, but it could benefit from adding more booths. It's the same management and menu as Bombay Indian Grill (at Green & 6th St., Champaign). There's more room to spread out at Sitara, and fewer students.  I've come here for dinner several times since it opened. The food is awesome.  service is great.  prices are reasonable. The beer selection is limited to domestic macro and Indian malt liquor, all pretty gross.  Stick with water.", "date": "2015-05-05 16:02:45"}, {"review_id": "C79COYD7ZSQRFLD7MUtj_Q", "user_id": "nA7fXJeD5FTfInjvh1eMJA", "business_id": "Q8DwQAKYugHSm9os3AGS1g", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "My wife booked a massage, pedicure, wrap and facial there in an epic 4 hours of spa-info while I was at the football game.  She loved every minute of it, said the deep tissue massage was among the best she has had and the spa itself was gorgeous.  Only complaint was that she asked for food service multiple times (she was there 4 hours, after all) and was never able to order.", "date": "2016-12-11 04:14:48"}, {"review_id": "MVLapsoI5qCbNwLT9GFN9Q", "user_id": "SMDJXinW4QjtQadV1ow12w", "business_id": "4cPRznhtVzBMq0ePOD2Zvw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The traditional acai bowl was great, a little pricy but good. I was not a fan of my kids peaunut butter acai bowl. Like the atmosphere. I've had acai bowls at tournaments and they were cheaper and I got a lot more but this place is good for a craving.", "date": "2017-03-08 21:48:48"}, {"review_id": "A-U19JEatuAUabBWK5NwcQ", "user_id": "x-ECHEIMRajTXFCy4zFvMQ", "business_id": "mE_zWBkvmTGgmVmf1T1Zlw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I got a groupon for this place. The first time I went the service was alright. I purchased another groupon months later. They got a new manager and he is excellent! Very friendly and helpful.", "date": "2013-02-10 12:46:22"}, {"review_id": "mc5nmeJMqEDHtcoI4qaOZg", "user_id": "uTeLTM0rWHpL_-roqiE9jg", "business_id": "-zuJkmIjdRahT_yHED-62g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "i am a fan indeed.  pretty impressed with the service and the quality of the food.  you order with the ipad.  you get precise ordering this way.  the dessert came with a very tiny plastic throwaway spoon!  too small for my liking.  the dessert was good though.  the waiting staff were pretty good.  not stellar.  some dishes were put on the table as if they did a drive by.  the food was very fresh and came out at a steady rate.  tempura batter was light and crispy and fluffy.  the various flavours were pretty spot on.  oh yeah, the soya sauce looked to me as if they were diluted.   it was not that dark/black brown that real soya sauce looks like.  all in all i was pretty happy to eat here.  i would defo come back here.", "date": "2016-09-26 00:01:33"}, {"review_id": "PuK-AR4n-KpCXGjiszPyiQ", "user_id": "2gtD_ED2iaT9jYMvQxfeBw", "business_id": "AqpiBApzrd30LA-vmU3Rvw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We had a blast. Got there right at 7 and got front row seats. It was a Thursday but it was pretty full within an hour or so. There is the \"VIP\" side where you pay for a seat ($15 the night we were there) and the standing room side. We liked sitting. Our server was excellent and kept the drinks flowing. The piano guys keep it going non-stop. They switch every 75 minutes, or so, and bring in fresh piano players almost without stopping. We will go back for sure. Great fun!  Also, I should add it was a huge mix of people from 21 to 81.  We are in our 40's and I would say a lot of people in our age range but everybody can enjoy this.  Reasonable prices on the drinks; well, reasonable for Vegas.", "date": "2014-09-02 02:30:29"}, {"review_id": "1qHl56exX9Zb-lUW6KbnZg", "user_id": "48VpixVaQcPFw2w6UPHWww", "business_id": "4KPp6fLU8WJHJ63bxSb3Ww", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "damn, i haven't been to this spot in a miiiiiinute. \n\nalthough, last time i was there i had a coffee and a tasty pastry. defs gonna hit it up asap. \n\n\n---updates to come---", "date": "2016-01-09 20:53:22"}, {"review_id": "ep2tW_GU-fk68muIFQuvRw", "user_id": "JDEhGFIPAyIMkfHD0G13UA", "business_id": "CjfsFcNnV62PWWFq7-ZLgg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "First of all let me tell everyone that this is Not authentic afghan food. So don't be misled by their name and their claim. This is more of a Pakistani cuisine than afghani. Yes they serve some afghani dishes but the Pakistani dishes are better. The chicken Karahi was very good. Their serving size was good. Their serve ware was good. Their service and bathrooms were good. \nI ordered a sultani Kabab, which is an afghani dish. The meat of the grilled cubes was not tender enough. The kabob was just ok.\nTheir BBQ items are good. Their wings are very good.", "date": "2015-12-14 04:05:29"}, {"review_id": "1oLJZr4nIAm8QF6y62ByHg", "user_id": "Nh75diBuPgSSBMNoT5IGDA", "business_id": "UPIYuRaZvknINOd1w8kqRQ", "stars": 4.0, "useful": 4, "funny": 4, "cool": 4, "text": "Coming from the Venetian, I was blissfully leaving the tourist sin otherwise known as Grand Lux Cafe to stumble into the gritty strip mall that houses Monta, just right down the street.  In my love-hate relationship with Vegas, things like this definitely belonged to the first category.  \n\nTwo groups of very jovial Japanese business men occupied the cozy joint when we walked in.  They seemed right at home, joyfully exchanging conversations from across the restaurants to each other as well as the waitresses.  From the smiling eyes to the careless laughter, I make the speculation that they were tourists happy to have found Monta.  I've been there, that rare delight from finding a great Vietnamese restaurant somewhere completely unexpected.  \n\nIt was a frigid night.  Lips cracked from the desert air, my mouth greedily welcomed the steaming broth of the Tonkatsu Ramen, rich with pork bone flavor and complimented with smooth strings of fresh noodles.  Had it been warmer weather, I'd have opted for the Tonkatsu-Shoyu Ramen, a bit lighter with the mix-in of chicken-flavored Shoyu broth.  \n\nI could do without the pricey upsell of add-ons, but I still highly recommend them, especially the soft-boiled egg, corn, and seaweed.  You may end up spending nearly 10 bucks on ramen, but it's still a better choice than anything at Grand Lux", "date": "2011-02-27 04:21:32"}, {"review_id": "nfdRFSg4WgX0IVXoo4WGjQ", "user_id": "nNL2nhkNJQJWOYOynOpWYw", "business_id": "jBhOVAEdnzCJvgSnvA4UDw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place, always a fun place to hang out, get some good drinks, and listen to some really mixed music.\nThe vibe is very chill, candlelit tables and leather couches line the walls of this bar.\nIt's got a Gothic almost dungeon-esque architecture.\nThe only reason for the 4 stars is that this bar like many others still allows smoking which sucks.", "date": "2017-07-15 05:44:06"}, {"review_id": "u4VCj2NCJyZoylPFYuRdZw", "user_id": "DEx_LwiOnm0_bmffS2ICtQ", "business_id": "M-ajUawvXeHSqpeM_2UDOg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Quick, Easy, and cheap.  \n\nReserved a midsize on the Alamo website using our Costco Codes for about $10/day + fees) and got a free upgrade to Standard size thanks to being an Alamo Insider.  Used the \"Skip to Counter\" Check in feature before we left, and printed out the confirmation with the barcode.\n\nThis was our first time renting a car in PHX despite my husband being from there and us visiting 2 or 3 times a year (finally got tired of borrowing a car from the in-laws).  It was easy and convenient.  You walk through baggage claim to the Rental Car Shuttles, and there seems to always be one waiting (there were 4 lined up at the terminal entrance when we walked up - so nice not to have to wait for one, and there was a guy directing people to the front one :).  I think the shuttle services just one specific terminal (of the 3 that PHX has), so there's not multiple stops.  It then takes a (rather long) drive to the Rental Car facility, which is a GIANT parking structure with all the different rental car companies in it... nice facility, looks new, great AC, good signage.  Since we had done the Skip the counter, the confirmation tells you to take the escalator to level 2 and we were welcomed down there.\n\nThe greeters handed out FREE BOTTLE OF ICE WATER (which is like a TOTAL God-send after landing at Phoenix airport in the middle of summer... between the extreme heat and how much airports now sell water for!! and directed us to pick out our car from a certain row of vehicles... even gave tips that the \"cooler\" muscle cars were on one end.  That definitely peaked my husband's interest and we ended up with a Dodge Challenger.  glad he had fun driving it. Get in the car, proceed to exit booth, off you go\n\nTAKE CARE TO CHECK THE RECEIPT THEY GIVE YOU BEFORE PROCEEDING OUT OF THE EXIT BOOTH.  we were running late and hubby had exited before I noticed that the final recipt showed a charge of over twice what we were quoted... and since there was no way back, we ended up circling and going to back to the front desk of the rental car facility (thankfully, there is a parking/waiting lot, but its not the shortest walk when its 100+ degrees outside).  Turns out, the system didn't register the Costco discount for some reason, so they fixed it without complaints at the front desk (if we had noticed we could have had it fixed at the exit booth too).  So lesson learned, check the receipt before exiting.\n\nReturn was easy, though if you navigate to PHX directly, following the signs seems to take a LONG time to get to the rental car facility.  Not sure if you navigated directly there, that there would be a shorter route or not.  Quickly dropped off the car, and remember to get back on the correct shuttle for your terminal.\n\nEasy Peasy!  We'll definitely be back!", "date": "2015-07-24 20:13:37"}, {"review_id": "GF5P_uH5lHiVWFM6dVFvKw", "user_id": "_AwABkxw1joJPXn-j9dNiA", "business_id": "OGFBCNUHJ-182MbnV6NTvQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here a few times and sat in a few different areas.  When there are floor seats, they aren't very comfy, but not expected really.  Staff are pretty organized.  Drinks are strip priced.", "date": "2018-03-09 20:15:02"}, {"review_id": "6isHFdwihUzu1slUeRASnQ", "user_id": "QOkNZxcKuGzxRVlE5vfiJA", "business_id": "BbPVtY7hzBPnpRrZMBElIg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "The staff here is very friendly and the place is very clean! The food isn't bad and it's consistent.", "date": "2012-04-16 04:18:13"}, {"review_id": "G-wtDw_mIr0Y_0QHSTGV3A", "user_id": "8C8Ml7hj1zxyhcChk1TESQ", "business_id": "yhDAzBBjFujZbHwBPfE2eQ", "stars": 4.0, "useful": 4, "funny": 0, "cool": 1, "text": "Recently discover this authentic korean bbq place. I wonder why it is not well recognized as other bbq places. It has daily special, takes reservation, convenient location, cool decor.\n\nService was adequate, but I won't say it's perfect. \n\nI have been twice in two weeks and enjoyed their bbq and tapas. Korean Bulgogi Poutine and Veggie Cold Soba are must order tapas. Their unlimited banchans are tasty. Bbq comes with steam egg, cheese corn, soup and unlimited lettuce; meat portion is generous. \n\nThe only complains would be their air conditioning. I wish it would be stronger especially having bbq in a hot summer day.", "date": "2018-06-29 22:58:35"}, {"review_id": "usc9KNypUIoDJY8JQvjk4g", "user_id": "2Rw4bXIrKd94be-BXMzoyw", "business_id": "mdoALqA201oRodl-lN_czg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Located at the corner of Spadina and Richmond, Kupfert and Kim is a great addition to the hood for healthy choices. I passed by this a few times but didn't get a chance to try it until today at lunch (i forgot to bring my lunch)...ended up ordering the cauliflower tahini bowl which worked well with everything else. Since I am on the Paleo diet, I was restricted to no carbs so I opted out of the brown rice and asked for extra veggies instead. I added Guac to my box. The hot sauce was quite interesting as it's not the typical hot sauce you see at most places...it had a slight after taste kick...which I enjoyed!\n\nI also ordered the Blueberry smoothie and got the Green smoothie for my coworker...both were quite enjoyable. I personally liked the blueberry more..the green was a crowd pleaser when I asked one of the cashier but the first sip had a strong ginger taste..a bit too strong for my taste buds..\n\nPrices are slightly higher than your average place due to quality. A place I would come back without hesitation.", "date": "2017-04-04 15:30:33"}, {"review_id": "E1YlgONlP1F0bR5HZHzx8A", "user_id": "vBSzgSvcawxtaDuIdi9hCA", "business_id": "TkEMlu88OZn9TKZyeY9CJg", "stars": 4.0, "useful": 4, "funny": 2, "cool": 3, "text": "Overall, just this shy of an utter delight. \n\nThe shrimp cocktail made a great impression with the oxymoronic jumbo shrimp suspended in cocktail sauce above a boiling cauldron of dry-ice steam. The horseradish and sauce combo was something close to ambrosial.\n\nI ordered the bone-in filet done \"rare-plus\" and believe it to be some of the best prime beef I've experienced. My friend had the porkchop which also was done just right. The sides were the gorgonzola mac and cheese and a dish I almost refuse to believe were brussels sprouts: they were THAT tasty. We left with 5 boxes of leftovers, and neither of us could be called dainty eaters.\n\nThe atmosphere spoke of swank in a way that a high-dollar steakhouse should, with friezes in glass panels and blood-red lighting throughout. \n\nSo what holds me back from 5 stars in this case? Well, at this level of pricing ($47 for the filet a la carte) in a place like this on a Friday night, no customer should need to remind the server twice to bring water. And we did.\n\nSo, not quite perfect. Would I go back? I think so.", "date": "2011-08-08 04:36:04"}, {"review_id": "YqO4R4iLm5r4VkqmnHgKUg", "user_id": "-JvGSLhvX1WHgry6tvU2ZQ", "business_id": "pxuklyPyDzYNxDndthhVew", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great coffee (they roast their own beans), great service, very knowledgeable barista. If you like rustic and great art you'll love this little spot. I am a Fan!", "date": "2014-03-07 03:20:40"}, {"review_id": "Cu0hRv9Xdkxjn0GImzV1cw", "user_id": "AaJlcLNfA7QHlppDpRkarw", "business_id": "BBTkC1Z3ZnEE916SkCONIg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was light and fresh yet filling and the staff there Ellie ( ee-lee?) Was fantastic. She took our order and answered any questions we had about the menu. I settled on the brown rice bowl with jumbo shrimp and sweet chili sauce. She let us taste the sauces beforehand to ensure we got what we liked. They have awesome add ons you wouldn't expect like portobello mushrooms and ones you would like avocado. My coworker got a chicken spinach wrap with choice of 5 veggies and she had no complaints. The gal that took our order also made our food and brought it out to us. She was happy to bring us hot sauce etc. She later cleared our table. She did it all basically. I highly recommend. Don't let the shopping/strip mall surroundings deter you from a healthy well made food option.", "date": "2015-09-29 04:15:44"}, {"review_id": "BNOvOGMCLQJHm16KrwQxiQ", "user_id": "6rGVoAI0Bl8ZEbMNJWOK3w", "business_id": "i1uIHAkiRrf5uxBa6RF0NQ", "stars": 4.0, "useful": 22, "funny": 16, "cool": 20, "text": "Very nice place in the same plaza as the AJ's.  I have been there twice now with my girlfriend, she was in town in between her many travels and was treating me to a pedi.  We got the spa pedicure, which includes callous removal and scrub at $35 it is a fair price.  The leg massage was very nice.  I will have this as my new spot since they are so close to my home.", "date": "2016-05-13 14:48:59"}, {"review_id": "Uxzai06N4q1dZ7QqA2bGzA", "user_id": "hgF4uMhgxIhXchMpuM1fCQ", "business_id": "eGWHBdETGp1ZjicMPlEEwA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I come here in the morning. The place is busy from Noon through 3PM. The it is quite busy from  5PM to closing. So, best bet is breakfast before 10:30 AM. Service is great in the morning. Staff get overloaded as the day goes on.", "date": "2016-08-17 13:25:46"}, {"review_id": "3upbIf2SnYDjs4YXPmEIIw", "user_id": "taXhBpKvgCTHPx3v94u1og", "business_id": "nT16Y6AsJDwEpUB1JICKzg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "A great place to grab lunch & bakery items for later. The perfect place to get your souvenirs! Bring cash, you may get a better deal from the local artist right outside the main entrance. Note to self: purchase more mini maple bears & maple cream cookies.", "date": "2015-07-11 19:59:51"}, {"review_id": "7Zks9MmmmDlAWRikUuOQiQ", "user_id": "mESX1wm4nQxCKzcZuPMrHQ", "business_id": "iQ7tfyfw6lNMre4EIbXpSg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This hotel went above and beyond our expectations! The staff was VERY friendly and helpful. My husband and I were traveling from Texas, and this was the first place, since leaving Texas, that had actual grass for our pup. We appreciate that La Quinta is pet friendly with no extra charge or limit to rooms. We were able to stay on the top floor, where it was splendidly quiet. We were also traveling in a large truck and trailer and found parking, simply. The bathroom was lovely and spacious. It was very clean, quiet, and comfy! We will stay here any time when we are passing through!", "date": "2016-06-27 19:59:05"}, {"review_id": "_J9msnaMa1DnqQD0-Vv1jA", "user_id": "YEb5ibe-AUNMcbPxRkm6hA", "business_id": "aVHClxgKDfGbw4j_yk24OA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 2, "text": "Used to be Koreanna's. My wife and I frequented Koreanna's a number of times as we enjoyed their BBQ and soups. The only issue we had with Koreanna's was sometimes their service as the waitress there was not always pleasant and sometimes she'd give us the bill right in the middle of our meal. \n\nNow with new management, new servers, the atmosphere has changed for the better and the food is still great. All the servers are extremely courteous and welcoming. I've had the Bibimbap and the tofu soup, both were excellent. They offer a great variety of side dishes along with your meal.  I was there by myself for lunch on a weekday and had SIX side dishes all to myself (along with my Bibimbap)!  Have still yet to try the BBQ but that will be next on our list. A great Korean joint in Calgary.", "date": "2015-10-21 21:46:41"}]