[{"review_id": "bIERJh0v7D_7TJpS-dQBpA", "user_id": "SqDu5Ydi4hpIxeuE33j23A", "business_id": "68DBEQq7I0lqlY9bMQdb-Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "As I first walked in I thought that everyone was going to be stuck up and rude, but that was not true. My husband and I where greeted with kindness and the gentleman who greeter us was more than helpful.", "date": "2017-02-02 06:43:48"}, {"review_id": "0H3HzOKwrR6y9JVTud-3dg", "user_id": "0GgyuhG58_SzNrZ5S4unqg", "business_id": "3NCnsa2MLUXiJ8YauUMFoA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome! Full of amazing individuals who knows how to make your idea into a reality! I've been working with Dave for the last couple sessions on my back and he is doing an amazing job! I recommend getting a tattoo here! Artist and staff are friendly and the best in the business!!! Will be getting more tattoo from!!!", "date": "2016-06-28 00:04:12"}, {"review_id": "JQzGuwG8Fqo8P9A_B_8Gyw", "user_id": "q6qMRq4Kpuh9XL3yvthNtQ", "business_id": "bfK3fOfyFdRCLZzSrtzEMw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "LOOK Style Society is the best and Nazzi is the best stylist here. Male cuts are the best wheb done by Nazzi", "date": "2017-09-27 01:34:15"}, {"review_id": "M7kxoRDnbGdGmPmmGmGnog", "user_id": "LdYJlllsD2fPkBhycioj3Q", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 5.0, "useful": 6, "funny": 0, "cool": 2, "text": "XS IS SERIOUSLLLLYYY MY FAVORITE CLUB IN VEGAS SO FAR!! :D\n\nEvery time I make a Vegas trip, I always have to save a day for XS :D.\n\nFirst time in Vegas: XS, Sunday night, David Guetta was performing\nMy 3 girlfriends and I were on the guest list so we went into a separate line (I always feel like such a princess when I'm in Vegas haha!) Once we got into the club, I was so amazed with everything! We sat down and guys were already approaching us with cranberry volka and red bull volka. Yummmm! I'm not going to lie, but that stripper pole is amazing!! Especially because it got really crowded that night because it was the Sunday of labor day weekend. It was so crowded that I was not able to walk anywhere so my friends and I danced at the stripper pole area. These guys approached us to join their VIP table and of course we said yes. :). I had an amazing time! XS always treats me right!\n\nSecond time in Vegas: Friday night, April 5th, 2013. David Guetta was also performing.\nIt was a lot less crowded this time. I was able to get onto the dance floor to see David Guetta up close! It was a wonderful experience. :). \n\nWhat I really like about XS is the pool area. I love how they open the pool so we can soak our feet in it. Come on girls! Being able to take off your heels and soaking them in water feels so good! \n\nXS usually only have an all girls guest list, so make sure your guy friends buy presale tickets to skip the crazy long line! \n\nOh XS also gives girls on the guest list a free complimentary drink! :D", "date": "2013-04-20 07:00:51"}, {"review_id": "mvO6VnNEAxcG2qcRYhiQjQ", "user_id": "0sNAZ--Oh_bXbS-Fff8Gog", "business_id": "d10IxZPirVJlOSpdRZJczA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Love the service, the waitress is so nice and very helpful with all the quest I asked. Recommendations for dishes are excellent! Love this place", "date": "2015-08-27 01:12:08"}, {"review_id": "4tu8zP8BAyTsNf5RP1l-Uw", "user_id": "8cCiGytDyiL48Ir6WI4NLQ", "business_id": "hX56JNZZjz_oEQbSsboHBQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this Medspa. I had a wonderful IPL photofacial with great results on my face and neck last week. \nOwner and laser tech extremely knowledgeable and experienced!\nHighly recommend. I will certainly return for additional treatments.", "date": "2018-01-04 01:08:09"}, {"review_id": "cdZ3dIPvKoQ6qcKCkAPGUA", "user_id": "USG1wkzku03asNV8TQZetw", "business_id": "Wg4jlAgOUB51aX1c3ex9GQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "When I walked in, I saw many tables were occupied, including sushi bar. This is a good sign. We were offered to the table on the patio. Luckily the weather was already cooled off at night.\n\nThe service is nice and the food came out very fast even though the restaurant was packed.\n\nI love their pork Katsu curry. The rice is perfectly cooked. The pork Katsu is perfectly deep fried and has great texture. The curry is the best one I ever have. It is simple but complex in flavor. The pickle helps put all the flavor together.\n\nWe ordered some nigiri and rolls. The scallop nigiri is so good. The scallop is firm and dry. It is hard to find other place that can prepare the scallop like this. Thumb up!\n\nThe plum and shiso roll is interesting. It is tasty and refreshing. The tsubugai shellfish nigiri is also good. It is so crunchy good.\n\nWe were full so we got matcha marron cake to go. The tiny cake with red bean, cream, and match cream on top is so delicious.\n\nI like their indoor water fountain, and they have many Tanuki in different size around the restaurant.", "date": "2018-10-02 19:56:17"}, {"review_id": "t4B4u7w5epYu5hl4WEqBaw", "user_id": "qwljXqZg4ddFru8dK7gaEg", "business_id": "yuR9r6QMFY-zCzMLanW3mA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome staff! Ask for Josh or call ahead. Fun, Chill and relaxing atmosphere! Love the Urban Hip hoppish' feel!", "date": "2018-07-31 21:42:25"}, {"review_id": "Qnsbn96I-1fVbzqqMSlvzw", "user_id": "VPoIDsGNA4JqYO2QHO7cOQ", "business_id": "mHcfv-cdbx1LtR3n3FoooA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We ended up trying this place because everything else is closed, it's Christmas Day. We are so happy we did! Absolutely delicious food. Definitely fresh! \nI got the Mongolian beef and an order of lo mien. We loved it, even my kids enjoyed it!  We will be back soon!", "date": "2016-12-26 02:04:13"}, {"review_id": "u0vsojcl0dk6oVz_T44YaQ", "user_id": "3rRV7vCkCtruxj2csK9BSA", "business_id": "kRgAf6j2y1eR0wOFdzFAuw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Firefly is an excellent choice as they have a variety of dishes to choose from and they are fast at serving!  There is something for everyone's taste. Love going with a group of my friends when here on business!", "date": "2017-08-15 12:08:42"}, {"review_id": "FtmVAUnuQmmq9Zcz31NptA", "user_id": "r_DOwFXtp1IVVcUXwKxn4w", "business_id": "ppHkkuDvvH8g1Enz6F8OJA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is by far the best breakfast place around!\n\nThis a smaller restaurant where you seat yourself at a variety of home style tables and are greeted by ever-changing paintings on the wall created by a local artist. The waitstaff here are young, as described in other posts, but we have always found them to be hard at work, always asking us what we need, making sure to get us our drinks quickly, and greeting customers as they come in. They even get to know their customers, and know regular drink and food orders. \n\nAs for the food - well it is EXCELLENT! Now, I have only had breakfast here, but I have never had a bad meal. The home fries are Amazing, and are not full of grease or salt like you might get from larger chains. Everything is cooked fresh to order so most meals can be adjusted to your needs and since there are so many choices you can really create your own meal beyond what their menu has. The food also comes out super quick, considering there's only one or two cooks at a time, and everything is always delicious. \n\nMy husband and I go here at least once a month, and we will continue to frequent this little shop as long as we live in Vegas. Some personal food recommendations - The Bacon sandwich is a go to for us, and if you want something to satisfy your sweet tooth, definitely opt in for their whipped cream on your pancakes as it is rich and creamy and very yummy. \n\nThis restaurant is worthy of its 5-star rating from me!", "date": "2017-07-03 23:18:56"}, {"review_id": "KJJ0MO1uDv-z9IC03N8hCA", "user_id": "ps1cfaRkNUn4NwEXuWcwfg", "business_id": "2DkHpKLssE4GsIeWMAz97Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Chef Aaron is hands above the rest. His passion and love for baking come through in every bite of his amazingly delicious cakes. There is no other person alive that I would want or trust making my birthday cakes from now until the day I die. And if you haven't tasted his Blackberry Velvet Chambord cupcakes you haven't lived.", "date": "2016-12-12 01:08:46"}, {"review_id": "eY77m8u91egv5P4ozVKrWw", "user_id": "5nhKPFmes-p0rPOT42uXxA", "business_id": "dCX6CvWGn8oiPSD_yxrm0Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am visiting in the area and found this on Yelp. It was a VERY good choice!!! Dinner special I got was the shrimp egg Foo young for $8.59 which included fried rice and egg roll...I have enough left for tomorrow as well. It was excellent!! Wish I lived closer... it's hard to find good Chinese in Phoenix area!! I highly recommend it!", "date": "2017-07-14 02:33:44"}, {"review_id": "LdE632rQzl2umQpktD_8UA", "user_id": "WKiaq8fihdvjZWbFpo9DHQ", "business_id": "SS0ZvmaFQSm6gZFiQ0WGOQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Everyone here was so nice and welcoming. I (accidentally) came in about 20 minutes before they closed and they had absolutely no problem fitting me in! The gel color selection is great and so is the atmosphere. I'll be back without a doubt.", "date": "2015-04-08 23:22:16"}, {"review_id": "SwgVk_53KC1mlzH-nc3wMA", "user_id": "9eL8pQ44LVbbtmDyMIJUCw", "business_id": "i39--wZD6L9hm9Lg90Uziw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My new favorite restaurant in the Robinson area. Large menu, daily specials, huge portions, and good wait staff. This place is always packed and for good reason. The food is fantastic. I always love looking at what is going to the other tables to see what I might get on my next trip there. Give this place a try. Well worth it!!!", "date": "2016-03-01 06:34:07"}, {"review_id": "CHsKRk9F2tsx7QE6Oy0xAg", "user_id": "5rXm9JMg9kNYpPdqWbxZpg", "business_id": "UidEFF1WpnU4duev4fjPlQ", "stars": 5.0, "useful": 5, "funny": 2, "cool": 6, "text": "Maria is the best manager !!! Service is great food is great I do recommend this place whenever you are in Las Vegas Yummi in your tommy ;)", "date": "2017-08-23 03:58:28"}, {"review_id": "KOeeIlJl2sbUYNOIALFcTQ", "user_id": "_0bpfpVYYbnqN_NBJNXudQ", "business_id": "3Xq-bUUpRF9qi3MIXPY8cQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "Heading to a show on the east side of Phoenix and looked for a place to grab a sandwich. A quick search on Yelp led us to Outta Bronx.\n\nHubby ordered the Empire Steak, which he proclaimed as \"really good\" and onion rings. I enjoyed the Cal Chic but opted for fried instead grilled. So much food! But really good food! Next time we will share one sandwich.\n\nThe ingredients were fresh and not prepackaged, prebreaded, etc. The bun was fresh and just the right texture. The onion rings had a good taste. And the staff was very friendly.\n\nOur tab for two sandwiches, onion rings and two canned drinks came to $25.50, plus a few dollars in the tip jar.", "date": "2017-04-26 01:30:19"}, {"review_id": "uo6y7zvNH51TNRNJG63Bjw", "user_id": "XEHZoTDWjw3w-gcQyYIe4g", "business_id": "VRC7J-ahI4em9ddhihxq5w", "stars": 5.0, "useful": 5, "funny": 3, "cool": 5, "text": "Great Pizza - Margharita pizza was excellent. \nGreat Decor - Simple yet classy.\nGreat Service - Owners/Employees were very nice.\nGreat Fresh Food - You can taste the fresh!\nBad Location- I foresee a more in the next year or so. \nThey do not have Mt Dew ... bad - Everyone cannot be expected to.  \n\nThis is one of the reasons I love YELP. There is a Zero percent chance I would have gone here. I am never in the area, would have never noticed it and never heard of it. \n\nNow, I will be taking my family there and telling everyone about it.", "date": "2008-10-08 21:45:24"}, {"review_id": "k8HUD_RUiQIbRpiQrbKozQ", "user_id": "RlXfOTtpgTfcisRmukrGbw", "business_id": "MVIthKWqwkQz0dai7LkVzQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "Tommy's on Coventry has been a family favorite for decades -   in my 6 year term in Cleveland, I used to cut school and go down here to eat lunch (hey - I had like 3 hours of study hall assigned by a spiteful guidance counselor).\n\nAfter that - I always get in a visit to Tommy's on my rare visits to Cleveland.  My August 2011 lunch with my mom did not disappoint - they are solid with the hippie homestyle foods - mostly nutritious and all delicious with piles and piles of options for vegetarians and vegans.\n\nOne of my favorites is the BBQ seitan sandwich - but the tempeh reuben is pretty good, too!  \n\nThis is a super clean restaurant with friendly approachable kitchen staff who work on the other side of a 3/4 high wall in the center - so if you are sitting in a dark wood booth, you can watch them and strike up short chit chat once in a while.  The back dining area is much larger with tons of light - it's bright and airy without being cold.  The whole place has a warm, homey feeling without being hippy-dippy (ie - no weird art or furnishings that might alienate the 80 year old ladies who lunch from Beachwood).\n\nGreat prices and excellent service - you can't go wrong with Tommy's, whether you're a vegetarian, vegan or omni!", "date": "2012-01-14 02:32:01"}, {"review_id": "shnyqwbcAPfBXEMEKRkxGA", "user_id": "fc6JvJcRW_2QDwEWViRHfw", "business_id": "euoYMyL1GgrmzuV4UmR92w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Wow what great customer service and very friendly employees.  Price are the same as big retail stores the coolest things build your on Lego people, my kids spent a lot of time making three people.", "date": "2017-05-05 18:42:51"}, {"review_id": "CiKnmvlmf3IlHczw9pUMhA", "user_id": "qFDAIMyF3FQCO3Poi7tXwQ", "business_id": "CE7hNKYS6gIMKv6jK429uQ", "stars": 5.0, "useful": 6, "funny": 4, "cool": 3, "text": "Full disclosure. I'm not a brunch person. I usually sleep in on weekends. And I don't like lines. Whew, now that I've gotten that off my back, let's get this review started.\n\nI came here on a Saturday morning around 9:45AM aka prime time for brunch with two other friends. I was expecting the typical 30 min - 1 hour wait before getting seated, but lo and behold, we were seated within 20 minutes. Hmm not bad so far.\n\nWhen we arrived, the waitress gave us a biggest smile ever and kindly asked if we wanted coffee while we wait for our table. Why yes, of course. Anything to make the time go by faster.\n\nSoon enough, we were seated inside. First impression. Cozy. Comfy. But very homey. I'm starting to like this place so far.\n\nDining friend #1 ordered the Stuffed French Toast. The French toast comes in either a savoury version or a sweet version. She ordered the savoury version and it was absolutely divine. \n\nDining friend #2 ordered the eggs benedict with smoked salmon and avocado and the eggs were poached perfectly. Another plus!\n\nI broke out of the brunch norm and ordered the Dairy Lane burger after having read so many raving reviews about this burger. At first bite, I could also taste the smoky and delicious char on the outside of the burger. A sign of a great grilling temperature. Next, the bun. It was toasted just right. Simply delicious.\n\n\"More coffee?\" \n\"Of course!\"\n\nMy coffee was continually topped up by our waitress and never went below the 50% mark. It was as if she received a notification on her phone every time my coffee was running low. Magical.\n\nOh and the service throughout the meal was spot on. What a win.\n\nDairy Lane. You get the coveted 5 stars.", "date": "2015-07-11 21:38:10"}, {"review_id": "Eu7eLe2pHa7UgTQDtCjFAA", "user_id": "j7Ma_bsmWFB3H_O84biWrg", "business_id": "sOPBbhDCi7bJlW7dNBuITg", "stars": 5.0, "useful": 1, "funny": 2, "cool": 0, "text": "This place has been completely revamped. What a great experience! Give this place a try for a great evening out. Private karaoke rooms and great staff. Who knew this was in Urbana?", "date": "2015-09-06 04:03:47"}, {"review_id": "rGgY1zrF8kzNIQtrP1OWxQ", "user_id": "ONkvEOAKc5thWgR4cPDxMQ", "business_id": "YrAbF_a8KCGdEz-QuICmFQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Mark has always been super quick to get back to me and most times he has just accessed my computer remotely to fix it.  At the end of the day Mark has been a life saver!  I would recommend him to anyone and he has been so reliable and trustworthy over the years.  I wouldn't dream of going anywhere else!  Thank you Mark!! :)", "date": "2017-08-14 03:35:16"}, {"review_id": "QbxR-DBfsMhS-VFpAd4Oqw", "user_id": "WNrrUmyiNVK7Jrpbxfwbag", "business_id": "X8c23dur0ll2D9XTu-I8Qg", "stars": 5.0, "useful": 0, "funny": 1, "cool": 2, "text": "Ok, so admittedly this night was a \"once in a lifetime\" thing for us.  We were eating at the restaurant and started chatting with the table next  to us. We all hit it off and they invited us to their table at the nightclub. It was right next to the DJ booth on the main floor, and we danced and drank all night! The staff was awesome, and the music was great. We will be back again, but probably not at a table. Unless we can find people to split with. Awesome night, great club!", "date": "2014-05-17 19:19:09"}, {"review_id": "AmjkuIGr2caZJhIiMmetPA", "user_id": "ii4GvW9-89liHMwXZblYKg", "business_id": "b48IZPvY6MQO8MXK3uCNCQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly, great food! Happy hour 4-7 and 11pm to I forget. Anyways my onion better than pt's..... always drink specials and good variety of food! Games you actually WIN on! 5 stars all the way and best location.", "date": "2012-10-23 17:17:34"}, {"review_id": "S78mPEYDarJ7wZ3LWwW0Hw", "user_id": "ar-xdcmIXwnZUORcL4dMpw", "business_id": "Y0qISMyxVC3EY-TPmKUNmg", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "I have lived in Charlotte for sixteen years and have jumped around from hair salon to hair salon many times but I don't think I've been to a salon I loved as much as Hair Klaudt.  Other salons charge a lot for just a haircut, and I have very short hair, and most of the time the cut doesn't turn out the way I want it to.  I find Hair Klaudt's prices quite reasonable, especially since I always love how my hair turns out.  Hair Klaudt also has an enthusiastic, hospitable, easy to talk to staff and it feels like they want you to be there, and to talk to you.  And if you're tired of the usual salon decor Hair Klaudt is a nice change of pace with a more alternative look to the place.  I recommend Patrick, he's the best!", "date": "2013-06-06 15:38:44"}, {"review_id": "ymH6ZlR6i4vtG30hYxg-fQ", "user_id": "rn-b9Q2k0ND05bmaOUNPYw", "business_id": "6ZMrT3rIB2XedgZ4SBu9sQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here on a Saturday night and had a throughly wonderful experience. Made Open Table reservations for 7:30 and when we showed up at 7:25 our table was ready and seated promptly. They immediately informed us that the kitchen is backed up so it set our expectations appropriately. We ordered the lobster bisque, lobster poutine with the bisque (the maple syrup came but we didn't use it), warm croissant lobster roll and the seafood linguine (Neptune's.. Something, I forgot).  Pretty much all the dishes were pretty good: the bisque may require a bit of salt but I was happy with it as is; a salt shaker is on the table :). And the poutine was great - perhaps (is it possible?!) a little TOO much cheese. I guess there are worse problems. At this point, the two of us were already full but the entrees were still to come! I just ate half the roll and the lobster (which was yum). And my partner had about 1/3rd of the linguine and it was pretty good; the broth was appropriately flavourful for such a wonderful looking dish. I would highly recommend all the dishes we tried. \n\nThe only miss was the take out container. I didn't want to lose the broth from the linguine (not sure how it will taste today..) but the clamshell styrofoam container probably wouldn't be great to stop it from leaking. Aside from that, I appreciated the great service from the friendly staff and being told when to expect our food (which was delicious). \n\nWould definitely come back if the opportunity arose!", "date": "2015-12-13 12:25:35"}, {"review_id": "4PPe-TkR9ViLs4xzkBm3OA", "user_id": "iKBoe_1hLQsX7flAeepzuA", "business_id": "1AU59e4NcMJm7piOCKv94w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Can one actually say a visit to the dentist is \"enjoyable\"..? Karen, my hygienist, is very knowledgeable but also fun and cheerful. I never wait long; they're very aware of the costs of services and help with discounts when they can. This is my new dentistry home.", "date": "2018-07-23 20:32:06"}, {"review_id": "izH0QhjwCcsuBy9fc5toXw", "user_id": "9TYv7d5jSsaSQCaSHHMdNg", "business_id": "XeDDJuyiMM2GYaJ0-uRRNg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I can't say enough about these folks. It is easy to see that they love the work that they do and are very good at it. Our four legged family member has gotten terrific care and we appreciate it.\nBrian Flynn", "date": "2016-06-06 22:39:03"}, {"review_id": "fa_AwkFYR6aS0GbqvQW_XA", "user_id": "Ez8ifxrtOUT5TM4817scOQ", "business_id": "-0BxAGlIk5DJAGVkpqBXxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "This review is not necessarily about this coffee bean in particular but about all of them. These coffee shops are by far the best in existence. I wish they had these where I live. They use only top quality ingredients and I love that they use powders instead of syrups for flavoring. The chai here is brewed in the espresso machine rather than using a premixed blend with steamed milk like most places. These coffee shops seem to only be around in southern California and Vegas. When you see one, make sure you treat yourself.", "date": "2010-06-11 05:11:08"}, {"review_id": "xUQILHnQWMZ02X_gHqjzbQ", "user_id": "LpHeLC8wDPofnBgpljQh7A", "business_id": "TqL0ytKAucWdW2mR7EbayA", "stars": 5.0, "useful": 6, "funny": 0, "cool": 3, "text": "Amazing food . Unlike many Indian restaurant which put oodles of oil and spices, this one cooks in authentic Indian home style with required amount of oil and flavours.worth for money", "date": "2014-08-19 17:17:37"}, {"review_id": "UegCzFBhkyd8h9COfe7gVg", "user_id": "eoINDiBnYoh0WDWNO-ASQw", "business_id": "gaEgDDKsuBVzDFg8wsF2Ig", "stars": 5.0, "useful": 9, "funny": 0, "cool": 0, "text": "The best burgers ever!!!!! My boyfriend loves the grape juice lol \n\nThe customer service is good. The food is amazing. \n\nI recommend this place to everyone I know.", "date": "2015-11-25 01:21:13"}, {"review_id": "oGxkbowP-WmkGnro83yPXw", "user_id": "2XrBkSRP0vCNCDJUjIqjAA", "business_id": "jKrlc4xQIvfzDZ8eNfqxwg", "stars": 5.0, "useful": 0, "funny": 1, "cool": 1, "text": "Omigosh - this place is sooooo beautiful! It's so peaceful and serene and absolutly worth the trip. Make your reservation for around sunset and prepare to be dazzled. \n\nCombine the best view on the strip with really a great drink menu and superior service and you are an asshole if you complain about the price. Really. Shut up.", "date": "2011-04-04 17:30:11"}, {"review_id": "160yKXA5roecQG1m-3OdFA", "user_id": "TdYKJgSgY2GF_YJnwsi5yQ", "business_id": "pmJqSsCfgbo3TxPWpQNLIw", "stars": 5.0, "useful": 6, "funny": 2, "cool": 5, "text": "Artisanal Foods is AWESOME. In every way possible. It is a candy store for food enthusiasts and chefs. If you're looking for a specialty item or ingredient, it's likely here and if it isn't, you just need to ask!\n\nIt's a fun place to just check out as well. You can learn about these unique foods from the extremely knowledgable Brett Ottolenghi. He is passionate about the products he carries and the people who make them. I love how everything is so carefully curated.\n\nThe best part of this already amazing place is their new cafe powered by Chef Johnny Church. It's lunch only and there are just six seats available. The menu is fun and exciting, which shouldn't be surprising with the access to great ingredients. There's a Prix Fixe option for $35 (basically a chef tasting menu) or you can order a la carte. We requested a couple items, but left the rest of the decisions up to Chef and we were very pleased with the selections!\n\nCorn and Crab Chowder with Espelette Pepper oil and lime crema ($6). A nice warm broth with a light flavor from corn and a touch of crab meat. I loved the welcoming spice from the Espelette pepper.\n\nLion Fish Ceviche with Coconut and Citrus, served with Tempura Wasabi Leaves ($9). A really fabulous interpretation of ceviche with an unique use of coconut milk. This was my first time trying lion fish and it's great - a clean firm, white fish. Lion fish is dubbed \"one of the most aggressively invasive species on the planet\" and they threaten sea life on our Atlantic coast. Brett is an advocate for their consumption, but it hasn't caught on with chefs in town just yet. Either way, this is a wonderful way to try it! Also, it was my first time with wasabi leaves and those are fantastic as well. \n\nPancakes with Seared Sonoma Foie Gras and Three Grape Gastrique ($12). This is so, so amazing. Individual pancakes with delicious foie gras, a cool group of grapes (like Icicle Grapes) and Vermont maple syrup. This is a fantastic combination!\n\nCrispy Brick Chicken Thigh made with Mary's Pasture-Raised Organic Chicken; served with mushroom bread pudding ($11). This delicious chicken thigh goes through quite the process. The thigh's bone is removed, then flayed before being stuffed with a truffle concoction. Then it's sous vide before getting crisped. The result is a succulent, flavorful chicken with crispy skin. \n\nDuck Fat Fries with Sir Kensington's Ketchup. There's nothing to hate when it comes to cooking things in duck fat. I loved the topping of fried thyme and this natural ketchup is very tasty (of course, a product you can purchase here).\n\nZucchini and Squash \"Spaghetti\" with Tomato, Parmesan, Basil; plus, Housemade Burrata ($12). I make zucchini \"pasta\" at home, so I'm a fan of this preparation. I like that this dish was well seasoned and surprisingly flavorful. The creamy Burrata made it that much better.\n\nHexx Chocolate Pot de Crème with Fennel Pollen and Orange Segments ($4). This has a wonderful texture and richness that's thicker than pudding. I loved the semisweet nature of the chocolate and the orange paired really well.\n\nThey plan to change the menu frequently, so I'm happy to visit just as often. The price point is fantastic and I love the exposure to unique ingredients.\n\nHighly recommended: Lion Fish Ceviche, Pancakes with Seared Foie Gras, and Hexx Chocolate Pot de Crème.", "date": "2015-11-27 22:23:43"}, {"review_id": "RvXBeyiQ-_vrux-DYxHiKw", "user_id": "dEbD0tYCbO1Zw7xM74NMIQ", "business_id": "2px99IppAcnxR238eq_8_w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is our go to Chinese restaurant.  The food is so fresh and tasty.  We come here once a week and usually get four things.  For $30, we get dinner there and pack it up and get two more meals at home!  We are vegetarians who do eat fish occasionally and they accommodate us and even make suggestions.  The Kung Pao fish fillet is superb as is the vegetarian soup and lo mein.  If I had anything that they could fix it would be to add two tea bags to the pot of tea to make it stronger and give a bigger amount of the crunchy noodles with the soup.  Other than that, this place is a real great addition to the west valley.", "date": "2014-03-21 07:14:10"}, {"review_id": "fYy4_UkWuOIvvynDx75-qQ", "user_id": "zrdQOFQKx_5lVwIQyfNK_A", "business_id": "G6V99_DIFF10uTDSmTklpA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best shawarma in town hands down . Took me back to Dubai oh man love it you have to try it trust me!!", "date": "2018-04-20 02:59:19"}, {"review_id": "nNhA-a-XVvmQ5Ixh-fw48g", "user_id": "_bExvq1kIbHdHXXlGsOWrw", "business_id": "OmdxXytUF6d7lCLPD4TbsA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Late in doing this review, I wanted to add a picture of using them in Mexico. This place rocks. I showed up with some Bottle Keepers that are stainless steel and powder coated.  3 days before leaving for Christmas in Dallas.   I brought them in Monday, he had the proofs for me on Tuesday, of course changed my mind on style, font and words..ha ha.  he had them changed and called me Wednesday as they were finished!! I kept thinking I would ship as I knew it was a short fuse but, they got them finished!.  This hard working young owner has about 5 machines that seem to engrave anything and everything.  Stop by and see what they can do....", "date": "2017-02-14 21:37:11"}, {"review_id": "XH_xMVmGiJXRfcmaLPlRFw", "user_id": "8eAAExQ13sd8JlMWBteOvA", "business_id": "sXYkjcuGhtaYP8yeQPaHgA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love Heritage!  This place is amazing.  From the food, to the staff to the physical space, it's perfection.  Upscale, but cozy and surprisingly reasonable for what you get.  You can tell they think about every detail, it's not just farm-to-table--it's the experience beyond the food too.  The staff is professional and many of them I recognize from years at other great restaurants.  I even love the dinnerware and their vintage fireking(?) plates.  The food is delicious and  inventive, but not intimidating  portions are generous for a restaurant of this quality.  I remember loving Underground Kitchen here, but I always left hungry and  broke.  Heritage takes reservations which is nice.    I hate waiting for tables in Madison.  I feel like I live in Madison so that I don't have to wait an hour-plus for a table.", "date": "2014-06-04 16:37:40"}, {"review_id": "HvUOZSJoDY9YpKyqXlVWSw", "user_id": "NEytnLM9H4IcdgS_dXC_wg", "business_id": "RPYJXaRYEk4Mto7kPhmVnQ", "stars": 5.0, "useful": 3, "funny": 3, "cool": 0, "text": "Best coffee in our area by far!! Amazingly fast friendly and professional service and the flavors of their arabica coffee are so smooth and satisfying!! I'm quite a regular at this location and they always make it a point to remember us and are so great with my kids! \n\nMy kids love their flavored milks (vanilla is top choice) they love their smoothies soooo much so fresh and flavorful and made with real fruit... They are so great to put whip cream right on the straw for my kids as a fun bonus treat! My kids also love their Italian sodas with lots and lots of flavor choices but we recommend the raspberry with extra cream and whip and especially delicious orange with extra cream and whip!! It's just like an orange creamsicle Y U M! \n\nHere's my fun mommy tip... Don't want to have to get your kids a drink every time you treat yourself to coffee (much needed caffeine lol I have 4 kids 6 and under I know:-) then ask the workers for free \"whip-sticks\" it's just a straw with whip cream on top and it's free and my kids love it! \n\nAnother HUGE thing that DB does over Starbucks is their stamp system!! You get a stamp per drink instead of per transaction!! After 10 stamps you get a FREE drink, any drink you want! They ALSO do promos Alll the time!! You can find them locally, through text, or Facebook... Like New Year's Day they gave 3 stamps per any drink purchase and every Tuesday is double stamp day, two stamps per drink purchase! If you have a crew in your car like me go on tuesdays and  I let my kids get vanilla milks with my coffee purchase and pay less then $10 for 4 drinks and score 8 stamps towards a free drink!!! \n\nLastly favorite drinks are\nIced white zombie (yup they have a \"secret delicious menu\" that they will share with you if you just ask) this drink is a blend of their delish coffee and vanilla and white mocha!! It's rocking no lies!!\n\nHot white grasshopper!! Best holiday season drink! It's a white mocha and smooth mint flavored coffee party in your mouth!!\n\nAnd my favorite on menu drinks are the inhalator (a macadamia nut coffee) try it white!! White inhalator, iced! It's like the macadamia  nut cookies with the white Chocolate chips:)\n\nAnd the Cocomo! Like a mounds bar in a cup! Try it hot, iced or blended for an amazingly satisfying treat!", "date": "2014-01-09 16:40:53"}, {"review_id": "3Nr2ng9YzM1pUsIcvmwOqA", "user_id": "7TudBzWFzIjSpScaTeFBFw", "business_id": "4SaiowHLioT-AphA-swwMw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just move here a couple months ago and this is by far my favorite vet to take my dog.The staff is super friendly as well as the doctor. Will definitely be making this my permanent spot to take my dog or any other pets I get in the future !", "date": "2017-08-23 18:01:02"}, {"review_id": "FFbNGzUALlYXVB6RJn65-w", "user_id": "ktYO1_gw5-Q_BE8cNlizEQ", "business_id": "_ecuzP8HBsuQfYy7IR8Jyg", "stars": 5.0, "useful": 2, "funny": 1, "cool": 3, "text": "The coziest, most charming and adorable place with the best food!!! It is seriously so cute- I think I read it was an old train depot? This will definitely be my new go to seeing as how it's only a few minutes from my house. The food is amazing!!! Yummy authentic Italian food and delicious drinks. I had the italian wedding soup (scrumptious) and the truffle mushroom sachetti (also scrumptious) as an entree. The decor is so inviting and I love the intimate feel of the inside. They also have outdoor seating for Summer. I cant wait to go back!!", "date": "2018-02-17 22:37:09"}, {"review_id": "FRZMdwvYbFmDQHwgTwV2bw", "user_id": "G1X2jTh8ltSfIbVIdRd-PA", "business_id": "Ol4QM1QI5GlK36t2sGC7KA", "stars": 5.0, "useful": 2, "funny": 2, "cool": 1, "text": "My b/f and I were staying at a nearby hotel and woke up with the kind of hunger that a measly room service breakfast just won't satisfy.  He pulled out his phone and searched for nearby yummy places to get our grub on at.  He found a place called 3 Sisters.  Sounded awesome.  We threw on some clean clothes and out the door we went.  ...As we pulled up I had just remembered that it was Easter morning - dammit.  They were closed.   So we took a little drive and stumbled upon this diner.  Looked cute, it was busy, so we parked and went in.\n\nWe waited a whole 30 seconds for a table.  THEY HAD MIMOSAS.  Done.  I ordered one.  Joe had some OJ.  They had a cute little menu for breakfast.  One of the dishes that caught my eye was the potato zucchini pancakes...yum!!!!  I didn't order those though :( I did order the special breakfast quiche.  And my oh my was I a happy lady :) You had the option to get either the typical pie crust OR a hasbrown crust.  I decided to walk on the wild side and get the hashbrown crust.  Just delicious!  Joe ordered their french toast, 2 eggs, bacon, and hashbrowns.  The french toast was creamy and delicious.  They make the cinnamon swirl bread that is the main star of the french toast.  Obviously.  He also got a biscuit as a side.  It was the size of a small child and more delicious than I can begin to tell you.  It was tangy, flakey, buttery, chewy...heaven.  We ordered 2 to go.  I also ate them with honey.  Ohm nom nom.\n\nWe were too full to order pie :( that and we had no where to store the pie at.  We were checking out of our hotel that morning and headed back home.  I hear that it is delicous.  They had a chocolate cake that was like 2 feet tall.  I had a dream about that last night.\n\nIf you find yourself near Middleton, WI or Madison... go here.  Eat.  Drink.  Be Merry.  And bring me some pie.  OR biscuits.", "date": "2013-04-01 19:17:58"}, {"review_id": "KfwaCdHfdUOBW6mwBRvkMQ", "user_id": "rPFmIVntVg0Y8ek73sKudw", "business_id": "ztP466jMUMtqLwwHqXbk9w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Beef medallions were special tonight. Absolutely awesome! Prime rib was excellent. My husband ordered something he should not have and when he told our waiter this he was concerned. The chef came out and offered to cook a shrimp pasta that my husband says was phenomenal. Extremely pleased with our meal and the 1/2 price wine special let us splurge on a great bottle of Jack London Merlot. (Well, 2 bottles!) service was great and we would definitely recommend this establishment.", "date": "2015-02-10 04:41:15"}, {"review_id": "kYDSpewntFeJ3XKNun7wYQ", "user_id": "uhNSFfVqC_mQeC4eVCQn1A", "business_id": "l9CbJC2BIXpVlV7EgxpOeg", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "went here based on reviews and I was pleasantly pleased with the décor, customer service (Steve), and overall the price :D it looked so modern in there that it surprised me their gel manicures were so reasonable...but hey I'm not complaining. I really love this place, and thank God it's only 3 min drive from my place. try this place guys, they're awesome! it's very clean and modern in there too, unlike those run down looking nail salons you see elsewhere.", "date": "2013-10-17 02:50:42"}, {"review_id": "WP_ghhBouvH78k9v2_juOw", "user_id": "T8PWHgTuLepz7hhJBeaIZA", "business_id": "e3PBfbtXUjMziX6XGsOMoA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've lived in Japan for few years and this place totally brings back the times I was there! Love the looks inside with lots of seating area. The chefs and staffs are friendly! Did i mention, they make there udon homemade!?", "date": "2018-01-04 04:05:34"}, {"review_id": "oxDjOjo8l1bQ2fOg0KREwA", "user_id": "gowoyqPocpwU2CtKkQ4mZw", "business_id": "4ltQKpHLzZ6BhZWIResqPA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "OMG seriously the BEST experience ever! By far the most fun I've have since starting all this wedding planning stuff. \n\n-firstly Tessa is amazing!!!!! She listened to my very broad list of things I liked/--I didn't have a vision in mind so I'm sure it was difficult to narrow things down but she pulled AMAZING dresses and they were all within budget---all said and done I was $6 under budget which was amazing!!! My dress is stunning unique and really just amazing--all because of Tessa! \n\n-got to meet Vera and she was such a doll!! We saw a pic of her in her wedding dress and that was precious \n\n-did the picture on the staircase...so cute-what a beautiful tradition!!\n\n-all said and done Tessa was amazing and we are def coming back for bridesmaids dresses!\n\nThank u Tessa and Vera!!\n\nXox\n\nMargaret", "date": "2015-12-29 23:18:09"}, {"review_id": "8syp2ENGPzSA4gNqu70yhw", "user_id": "_u3fnAioKgbcMRczm1cjbA", "business_id": "pXaCLoK4sH6V4IM3Pc5ofw", "stars": 5.0, "useful": 3, "funny": 1, "cool": 4, "text": "These guys are legit! We just moved out of our rental which required major cleaning. Not only did they give us a great deal, but they went above and beyond what they were asked to do. I highly recommend booking Yeti Maids for cleaning.", "date": "2016-03-22 15:49:26"}, {"review_id": "QkDH2rXm7ZViM6e_02H9ZA", "user_id": "FdMNvBDX--D_MWuu5qKWDw", "business_id": "wg-1uNV3xHrjWEmULlAFPg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Mon amie et moi sommes arrivées vers 13h, il y avait une petite file, mais nous étions assises en dedans de 10 mins. J'avais tellement entendu parler du Trilogie, que peu importe l'attente, il fallait que j'y goûte. Oh My que je n'ai pas été déçue!! J'e referais la file n'importe quand. \n\nSelon ce que j'ai vu et entendu, l'opération est complètement assurée par des femmes. Girl Power!! Charmant petit restaurant dans le nord du boulevard St-Laurent, ouvert du lundi au vendredi de 11:00 à 15:00. \n\nNous avons décidé de partager des plats pour s'assurer de goûter à un max de choses. Notre 1ere entrée: la salade de concombre écrasés. Le parfait mélange de concombre, arachide et un épice délicieuse dont je ne suis pas certaine d'avoir compris le nom. Mais WOW, quel délice! Notre 2e entrée, une salade de champignons (minces comme une feuille d'algue) avec coriandre et piments forts. Nouveau goût délicieux qui a complètement enflammé mes papilles. Et finalement, le plat de résistance: 12 dumplings agneau et coriandre. MY GOD! trop bon. Full juteux (je crois qu'on appelle ça des soup dumplings) et tellement goûteux.\n\nPour le prix, 23,21$tx incluses, plus pourboire, pour 2 personnes, c'est définitivement accessible à toutes les bourses!\n\nVraiment, les meilleurs dumplings que j'ai mangé en très longtemps!!! Juteux à souhait, goûteux... très, très satisfaisant!!! \n\nÇa vaut le déplacement!!", "date": "2016-11-02 21:01:25"}, {"review_id": "DJlYbCJGPIGnp9Dpqe0naQ", "user_id": "BphqGSimmiveMskm85AjqQ", "business_id": "n_K2xa_nqzUqaUJa0S_5tQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I visited Vegas during Christmas. I found this place in Chinatown. I love their Special House Milk Tea with boba and aloe vera jelly :3 the service was ok, notthing to complain about. Definitely come back when I come back Vegas :3", "date": "2014-01-07 21:30:26"}, {"review_id": "39ML1Lt2veIj45CEn6FQZg", "user_id": "L6HGM8pmm2xCC8RTFqv0og", "business_id": "XrcB7Of1KfHlkeXYpHLIrw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The best chicken momos in the 6\nPatio is well kept and ample sunlight\nService can be slow, but great hospitable servers", "date": "2016-12-13 06:05:02"}, {"review_id": "1YHHncpzIU0WyXY0dgdsQA", "user_id": "M8b3GXkUYtktJ9J9sE8qaw", "business_id": "5vxp6inj3sY4Eb2MFyOOPg", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "This restaurant warranted my first review because I enjoyed it that much! It was my first Ahfgan cuisine experience and I will definitely be going back. \nI had their combo #2 which includes a salad,  brown rice, lamb tikka, chicken breast and beef kafta. All were seasoned perfectly. \nAlong with great food, the service was on point. If you're in the Mississauga area, you should definitely make an effort to check this place out.", "date": "2014-05-16 14:07:58"}, {"review_id": "htrLLUzl-jfLPrKYKmun4g", "user_id": "TA-1Ew6uo4pdkFowGaNBRA", "business_id": "plWuv4gda7m0KlqCNhrb4w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love their burgers! Beer is also great. Can't say much else about the food because ever since I got a burger on my first visit, I haven't been able to get anything else on the following visits!", "date": "2015-07-25 01:23:04"}, {"review_id": "aQDvN1RLXjlt0YC04u9dQg", "user_id": "56iHuqkVNjfrpLhHwziPuQ", "business_id": "CmQ0BCNQbvjhItvsaAXNUQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Recently, my husband and I purchased a home in NLV. We were so excited to play with our kids in our new backyard. Until we discover the hazardous amounts of Dog waste left behind by the previous home-owner.  \nThankfully Mr Skip was kind enough to work with my situation at the most reasonable price across the market. Skip is very knowledgeable of his products as well as personable and honest. The results were amazing, my small yard and all the gravel are clean and the smell is completely gone. This service is remarkably become of the pride skip takes in his work and brand.", "date": "2017-07-15 18:40:33"}, {"review_id": "ukldRgPnWee7KzXrQU1B1Q", "user_id": "rpl9yC7qOpaHdJYzUhAUhg", "business_id": "A37lz_WjrzRwkHRLuz4v2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been coming here since 2015 and I always get nothing but GREAT service. Every single staff member knows what they're doing and they attend to everyone's needs. Every time I go in there super busy but they still greet and reassure all the customers that they will be taken care of. Highly recommend this Location if you're in Vegas!", "date": "2017-02-27 22:46:02"}, {"review_id": "MMNM9gfFofjU0GGrVbL4PQ", "user_id": "rmZ9gUyoGHYSsGkg5mzZHw", "business_id": "guKs9pUC3iYliaqdXeWERg", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Went to Paige and Elliott yesterday with a friend to shop for her wedding gown. She had an appointment at Paige and Elliott, which I think is required for Sundays. We were seen promptly at our appointment time by Candace, who was fabulous. Candace went through a quick questionnaire with my friend Kim to get an idea of what Kim's dress shopping and planning process have been up to this point. She asked Kim about styles she likes, budget, feel of her big, day. It was very helpful in getting to see the whole picture before we went rogue on the shopping.\n\nCandace handed all of us clothes pins and told us to pin our favorite. As we were pinning, Candace was pulling them in the dressing room for Kim to try on. We were the only group in the store, which was really nice. It made the experience really fun and personal, and Candace was great to work with. She accessorized when appropriate but was great at letting Kim talk through her likes and dislikes of the dress.\n\nKim found her dream dress, and Candace hooked us up with a champagne toast to celebrate. It was so fun and easy!\n\nOne thing that stands out to me about this bridal store is how reasonably priced everything is. There is not a lot of inventory, but what they do have is great and versatile. I also love that all of their beaded belts are made locally by The Bead Lady in Concord. #ShopLocal", "date": "2017-04-03 14:43:00"}, {"review_id": "qYQGo4kdBUkl7NCRDnpFFQ", "user_id": "xWzG_eDIn8CmXeGfdXd-zQ", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "2nd floor behind elevators no sign nothing , best pizza ever ( pepperoni and ref. Margareta ) 5$ for slice", "date": "2016-12-10 10:11:25"}, {"review_id": "HUrh0RI_uKg2Eduhm3xNIw", "user_id": "Exgz6KisOVHv87cCUdXu8Q", "business_id": "LWvrTFkCSLPGldJqccGHhQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This review is long overdue. I have been an extremely satisfied client of Hon-man for 10+ years. They have helped me navigate through all of my car issues with my Honda. My old vehicle has over 200,000 miles and I have Hon-man to thank in helping my car live a long, happy, and healthy life. \n\nHon-man's website is well put together and easy to use! Their drop off system works perfectly with a busy work schedule. They have fair pricing and are completely honest. They work with me to figure out major fixes and have never pushed any type of service or fix on me. I completely trust them and so thankful my brother found these guys! \n\nWhen I lived in California and Nevada, I still made sure to have my car's appointment at Hon-man whenever I visited Arizona. When I had a problem in a very remote location in Nevada, I called Tait and he respond back very quickly within the same day! He was patient with me (I'm not car savvy at all, they know this) and asked me to check and listen for certain things.  He explained my fix and he was spot on! Luckily I was able to get my car back to Arizona without any damages so they could look at it. David has also patiently explained to me how to take better care of my car after my appointments and has never rushed through the instructions. Hon-man is the BEST mechanic in the whole world! \n\nThey also have a cute pup named Amy, and a bearded dragon Donald (formerly known as Bruce) you can hang out with while they work on your car. Their garage is always clean, quiet, and comfortable. The waiting room is very nice and they have a really cool fish tank and terrarium. You can tell they take extremely good care of their animals. \n\nNot to digress too much; my point is that Hon-man has really helped me out a lot. Thank you Hon-man!! I wanted to buy a Tacoma for my next vehicle but decided I should get another Honda because I don't want to change mechanics. No one looks under MY hood except Hon-man!", "date": "2016-10-08 02:27:29"}, {"review_id": "pE_JEiGtv6ZcOIvruHxu5w", "user_id": "TgTCVstXM1u7FA4wNEAxQA", "business_id": "IN3ysgB0iD2BuLf9eXqx_A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Loved our stay here during MLB Spring Training.  I was a bit worried when I saw average ratings on this beautiful resort, but we were pleasantly surprised.  Our room was updated and very comfortable. Loved the main pool area and even enjoyed the nearby sports bar.   Very friendly staff.    If you have kids, take them for a nice morning or evening walk to the park that is across the street.  Our son had a blast there.  I am assuming it gets way to hot there in the summer.   i would highly recommend this place if you get a decent price on it.", "date": "2015-04-10 03:12:18"}, {"review_id": "10HQ88IaH4-yWAPT9MVaxg", "user_id": "eCPFkdoHhySZAAMWLOa3kg", "business_id": "V7LeK0mPA_qk1I7hApgtyw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I brought my car in on Saturday after experiencing a loss of power on Friday evening. \n\nI was able to bring the car in and get checked in with my advisor quickly. He set me up with a loaner and told me he'd contact me Monday with what they found.\n\nI had expected to get the call Monday afternoon, maybe around noon if I was lucky. However, the call came in at 7:45am telling me that the issue had been found and the faulty part replaced.\n\nI came by in the afternoon to pick up my car and was able to get it and go quickly. My car had even been given a cleaning.", "date": "2014-06-18 17:57:27"}, {"review_id": "uW7VuluiWB1hnkCgVMLl0A", "user_id": "9tRof-G-SxZhW0gwakU4TQ", "business_id": "G_LtZnL66Iwama_7_FCLUQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Freshest and highest quality sushi in town! Delicious food and great service. My husband and I go often and we're always satisfied.", "date": "2018-09-10 20:03:08"}, {"review_id": "Dvy-QwWp8jQZKZ4v4fd0sQ", "user_id": "2RGo1x54G9-URKRQcaC4NA", "business_id": "JMiaNitMzMbJm6Kh0RbT5A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "We came to Canoe to top off our trip to Canada. What a way to end!! We got the 7 course tasting menu with the wine pairing. Not cheap at $150 a head but to be honest every mouthful and sip was worth it. This was hands down one of the tastiest meals I have ever had. The wine pairings were excellent and our server Kevin was fantastic. This was an expensive evening but a very special one. Make sure to ask for a window seat when you reserve a table and take in the exquisite view of Toronto from the 54th floor of the TD building!", "date": "2016-01-11 17:56:00"}, {"review_id": "DMiFOSEoSIz45tIok8mqPA", "user_id": "vIZo8okxwwIfKfjq_FEa2A", "business_id": "vukW5OFpcd7mE-fkUzozbw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic service! Everyone talks about how difficult mattress buying is, but we had just the opposite experience. Plenty of time to figure out what we wanted and got an awesome deal!", "date": "2016-02-06 01:42:30"}, {"review_id": "RPjTMMKMWHmIq8m49XxZoQ", "user_id": "-r2kFalV7SMObweMMBBVkw", "business_id": "HqaheljgQWV5Bk4WWbxKGg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "These guys are just fine:  responsive, smart, efficient, reasonably priced.  You live in the valley of the Sun, you want A/C service you can count on and they've been there for me almost instantly, when they said they would.", "date": "2015-08-26 02:05:20"}, {"review_id": "_-RSMpHNj9JoRCjBuH9RLQ", "user_id": "s7AZG-TfS0F9PCz7gzQrVw", "business_id": "JMiaNitMzMbJm6Kh0RbT5A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really do love this restaurant. They're expensive, yes, but the food is wonderful, the staff are various levels of good (ranging from pleasant & professional to really warm & lovely), the view is TDF and if you call with a weird request (one year for my anniversary I asked them to create a menu without prices like an old-fashioned 'ladies' menu') they're happy to oblige.\nIf you can squeak in during Winter/Summerlicious, do. It's super-difficult; they book up in seconds, but try. It's a great way to try a superlative restaurant for a low price. Otherwise, save it for a special occasion, but do try it. It really is worth it.", "date": "2011-03-04 03:11:43"}, {"review_id": "HlaSvHeDDsJpzRSE_HDSDw", "user_id": "E_O0z5Qmxs6gnr2ReSRwwQ", "business_id": "CWzdDb0R73D9o0EZK0H4gg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "9round, conceptually, is genius. No class times, go as many times as you want, 30 minute classes, and customized workouts that change daily. What more could you want?\n\nBut this location specifically is amazing. As someone who has always hated working out, the staff and culture are a huge reason why I find myself looking forward to these classes. Ra is amazing- firm yet sweet and encouraging. Even the playlists are awesome! Everyone should seriously consider joining. My membership fees are worth their weight in gold. Thank you 9Round!", "date": "2018-10-02 23:13:46"}, {"review_id": "pCU-FR5nbra6dTGxXJrsPA", "user_id": "YqbxuF6zFuBtWSaeNyQ74Q", "business_id": "fskIA-YRflPnwHWL7Q8bLg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We've been here twice - once before Groupon hit and once with a Groupon. Both times the food was excellent-  we'd been to lunch. I am a sucker for their bean fritters and the lemony garlicky dip it comes with. Very good vegetarian entree - cho cho flavored with carribean curry. The husband devoured his tres leche and my flan. He seemed to enjoy his house sangria as well. \n\nWish we lived closer - it's not an easy hike for some lazy people in chandler.", "date": "2012-10-25 02:40:35"}, {"review_id": "ul3483K3Vbk_9f2ivDdryA", "user_id": "Na7G05m9-UJ-bdtYoBnFHQ", "business_id": "L2p0vO3fsS2LC6hhQo3CzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome food great price friendly staff we will be coming back for sure when we come to Phoenix I would recommend this place to everyone.", "date": "2017-09-02 17:35:23"}, {"review_id": "U0flFz0p_GzFeiEa75UXmQ", "user_id": "AEaQGWCD4hL4QIv2oAHkBw", "business_id": "S91O3KYPlqqpCurYMKyREQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We are in here at least once a week. Initially it was for RO water or salt water and the occasional reefstew. It has taken me a while to review because i wanted enough experience to base any type of opinion.\n\nI like the place. I've read reviews mentioning information that I  know nothing of and quite frankly, I feel all of the staff that I have dealt with has been kind and helpful. \n\nWe have a number of fish and all of them to this point are still alive and swimming (ha! Get it? Alive and kickin'?) I recently purchased a madarin goby from there and he's still going strong on month 2. \n\nWe've had questions, they given helpful suggestions or ideas. The dogs that are sometimes there are cute huge boys. We've visited a couple of other places when out of the way but i just prefer reef monsters personally.", "date": "2016-07-20 01:48:32"}, {"review_id": "uRaecthx454_Fl-sC6xhCA", "user_id": "9BJ7oxe-nNVFA5S3iR64kQ", "business_id": "ASvQjxsHVd8J8o_kHJUQiQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place for quick and healthy food.  And I love the  Mad Spice.  I had a party of 14 for lunch this week and it was quick and the service was flawless.  You can travel the world's cuisine here!", "date": "2017-04-25 20:30:48"}, {"review_id": "eoMLiWKTsYoYMDRgrDLtIQ", "user_id": "SwShKJQ2doxoDxaUuYOf6A", "business_id": "1qukytvAndMQU2QeIE1KLw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Well it's Taco Bell so I wasn't really expecting much. I actually went inside since I had some time to kill and it was surprisingly clean on the inside. The employees were all extremely friendly. They must be doing an overhaul on their customer service because the last few times I've been to Taco Bell they have been extremely friendly. Food wasn't anything impressive but it's fast food that I paid $5 for sooo you get what you pay for there. Anyway I was very impressed with the cleanliness and the the employees.", "date": "2015-10-01 21:31:33"}, {"review_id": "5AwTlPIS11bKeEM_bmLZbw", "user_id": "qwGcLbQmX60tlNHkKlP7jw", "business_id": "aKEEQqL1UFMieilnylI1gw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Pricey menu but the food overall is spectacular. The beef tartare is a MUST try.  It is so unbelievably finely chopped--I can't believe it's not butter! Skip the sheep's milk ricotta ravoli (too \"goaty\" smelling in my opinion) and opt for the Lasagnette Con Ragu Di Crostacei recommended instead. Can't pronounce it? Just point to it! =)  Just don't let the name prevent you from ordering this dish. The homemade pasta is superb; it just melts in your mouth and makes you not ever want to eat pasta al dente ever again. The flavors of lobster, crab, and shrimp are balanced perfectly and are not overpowering. Pairing this dish with a glass of Kerner made for a heavenly culinary experience.", "date": "2009-01-10 08:11:20"}, {"review_id": "mfuORlYVfDcATnGatgmaYw", "user_id": "rBeFpEdSS-Hmz5Eny1u2xg", "business_id": "QFPS9JBNdOOHVP0C3pSslw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent service and wonderful and knowledgeable  Manager named Michael who was involved in ensuring that we got great service.The food was high quality and we appreciated that when he was late serving a drink that was ordered, he comped it (it was a crazy, busy night)... Lively and engaging atmosphere. We are definitely going back!", "date": "2013-11-24 05:13:39"}, {"review_id": "JcrtXEyIWV-l3Gh9r50XFg", "user_id": "QnfnKN0bXlXn3kNOfDDkfg", "business_id": "pik4ebdFa0UcUhnNkivFcg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My friend and I were trying to find somewhere to eat when we stumbled across this restaurant! Took one look at the menu and we walked right in. We didn't make any reservations but the wait wasn't long. \n\nFirst off, the portions are huge. Our waiter suggested that the both of us share an entree and I'm glad we listened.  We still had lots of left overs to take home after! The chicken Parmesan was delicious. Also, the bread is addicting. Pretty sure that's the reason we decided on only ordering one entree. \n\nNow that I know it's a family style restaurant I will definitely be returning with a group! I heard that happy hour has a smaller serving size so I will have to come back for that!", "date": "2018-06-14 21:47:39"}, {"review_id": "DbdPhpiLjB4tlJc5NhqlVg", "user_id": "pounkUDcj3boOnZ75i-9xA", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 5.0, "useful": 1, "funny": 1, "cool": 2, "text": "Definitely one of the best buffets on the strip. It's on par with the Bellagio and Rio for sure. I would definitely come back!", "date": "2017-12-22 22:55:27"}, {"review_id": "Jju1NisunTRJ1_QzgbmPig", "user_id": "6xjyrd9P8gIu9-VqxwTdbQ", "business_id": "6Iu4YDjAPrDRRrPCt_E2zA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is AMAZING!! Best steak I have had in awhile, their chicken fried chicken is great and don't even get me started on their mashed potatoes and gravy!! You can't go wrong with anything here and their service is FABULOUS!!", "date": "2014-09-15 04:34:36"}, {"review_id": "TtkNHRxLwblBKTiFG2QKcw", "user_id": "VVZyTpk6r4frT1LwlgddEg", "business_id": "T1tvWywCdTv8YiK-r_roLw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our new local favorite!  They took our business from Zoyo......we live in the neighborhood.....SUPPORT!!!!", "date": "2013-06-30 00:55:52"}, {"review_id": "eE_jOs5jTEYocTI3kmcStg", "user_id": "MV45koFR5K9H4rGGWmpkMQ", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 5.0, "useful": 3, "funny": 3, "cool": 2, "text": "Beautiful club with great music! I attended on a Friday night with a group of friends. We all had an amazing time. The bar was quick and efficient and the staff is super friendly and accommodating. Arrive early to avoid a long wait or better yet, get on a guest list. Shawna from XS hooked me up and she is super attentive and amazing with follow up! Be sure to get in touch with her to make arrangements esp on busy nights. This club has a diverse age group, so I felt in my zone as a 30 something year old ;) The drinks are poured generously and the vibe is incredible. Make this a must if you are looking for a hot club! I saw comments about it smelling bad, so I was wary because I have a super strong gag reflex, but I found no smells at all - super clean and well kept. The outside area was closed when I went, but I would not have ventured outside in the 25 degree weather anyway! CHECK IT OUT!!", "date": "2013-12-17 22:14:32"}, {"review_id": "1ec4iQAIMk75gLzc1l-2mQ", "user_id": "qq08QJT0jfwn46C7SSnJ5A", "business_id": "HjXI6lKGPVNQ8dYJPtaOCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Their pizza is probably not for everyone, it is definitely not your standard NY or Chicago style.  However their style of crush is probably my favorite and their ingredients are first rate.  Good beer selection as well.", "date": "2011-11-12 17:22:41"}, {"review_id": "X-dn740isQL1L2VfxsQvoA", "user_id": "dbhxQODP_HpOypB2R6-sFA", "business_id": "xSs1Z1OrWC_KmhY0SPKJ1Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great hibachi chicken. That's what I order most of the time. They have buy 1 get 1 sushi rolls so we tried those today and it was good. I will come here again and enjoy some good food.", "date": "2016-09-25 00:28:33"}, {"review_id": "gtLu99vu6HoQy3XTchVW9Q", "user_id": "3YVhNK5slPHsOJflYR2kyA", "business_id": "FrEVQuO1Qr6LlIEY7ycJQw", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "always fast and fresh...family love to eat here and take out...prices are fair and serving large..so come hungry", "date": "2015-04-22 22:14:02"}, {"review_id": "ZgtrHJBB6wz3KNwJcCqy0Q", "user_id": "CI2lSx6xk-kJYrysjIcRag", "business_id": "7ONpBeG74dGo2kVmTNXCFg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome experience. Exactly what I needed. I felt like I was floating after my massage. All my tension was gone. It was so relaxing I ended up taking a nap in the middle of the day! It was lovely. I signed up to be a member. I look forward to my next visit.", "date": "2018-02-17 02:22:01"}, {"review_id": "rHoHbFNFaT_VhNS2bdoR_g", "user_id": "L-F0i3c7ZtuxSgo6-GOvPA", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is very delicious and worth the money. The desserts were all great, with a wide selection of flavors and options. The service was nice and helpful.", "date": "2018-04-11 20:23:40"}, {"review_id": "85hJuIN4zpHjiauzwl8Qnw", "user_id": "H_wNfqYSIn9kxtLI-jDsvw", "business_id": "i1Xkm22_96GNVVOXSUoL0A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I'd been dying to try this place for quite some time and it did not disappoint. My friends and I ordered the shrimp, snow crab, mussels, Seafood Cajun fried rice, Cajun fries, and clams. For the sauces, we picked captains boil which is their signature flavour and garlic for the clams. One waning when selecting the heat level however, not being one for spicy food, medium spice was too much for me and I ended up having to settle for mild. All else, everything was so tasty and the whole experience of eating with our hands just out the entire experience over the top. I will definitely be returning.", "date": "2016-02-04 12:18:22"}, {"review_id": "ebrpKYjycH9-4JG_507q0g", "user_id": "nwPIsasc3LaCyeottksMtA", "business_id": "024QUHVU7nlyW5y2BeeGLg", "stars": 5.0, "useful": 4, "funny": 3, "cool": 7, "text": "Stopped by for some sushi in old town at this place on the corner...had reservation at 10 pm but they sat us down at 850 pm (not at teppanyaki table) which we wanted sushi anyways. Their baseline products were very fresh and very good!! Started with their Hakushika sake which we had 3 bottles...was really really good and went well with their sushi!! Started with their soft shell crab and it was amazing!! Their salmon was fresh, beef sashimi was spicy and unbelievable!!  I would come back for that alone!! The albacore was really fresh...the uni was super fresh!!! When everything came out it was really pleasing!! I honestly will come back to bring my dad for the beef sashimi...different and amazing!!", "date": "2017-05-21 05:23:02"}, {"review_id": "odhz628C5MJsw67RyQMLQA", "user_id": "o2SAIadomHUxL15ihhzhVA", "business_id": "wnXnYgsthEnplgNrth2olw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had a facial with Rachael C.  At 8esplande spa  What a great experience, Rachael was very knowledgeable, and she made me feel so confortable.  My skins looks rejuvenated and I felt so relaxed.  Rachael's voice was very soothing and the smell from the armotherphy bed was amazing.   I can't wait to go back and see Rachael C again!", "date": "2015-04-25 16:31:21"}, {"review_id": "eHWmRExKBCkLKEybtrn0uQ", "user_id": "n8WVyezq1ibU2FLvPp4eJg", "business_id": "sUXTuONpR8SBLPHGaPNL2A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Im updating my review because I can honestly say \"it feels great to be home again\" James introduced himself with full communication and he is seriously so easy to talk too. I just feel bad because I'm sure he has A LOT of stuff to clean up from the last manager.. \n\nI just hope something can be done about the smoke from the neighbors near me and I can soon live comfortably with my child again.. Not being about to turn the heat and now AC on due to the smell of marijuana is so difficult and makes my living here so stressful. \n\nThank you James", "date": "2017-03-21 04:03:51"}, {"review_id": "31fUsHfJF4yizlIT3tOYgw", "user_id": "fOPXkSNVVGmzP5VpO8mVTA", "business_id": "X8vBib9PoVh-jagZlpG2dA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great experience with Caroline!  Really really LOVE my eyelashes!!  They came out fantastic and exceeded my expectations!   I couldn't be happier!!!", "date": "2018-07-12 18:07:41"}, {"review_id": "waIsUsIieOjETIYCB-_zVg", "user_id": "dYr_0d2CAb1Rgn2HgrWHgA", "business_id": "gTw6PENNGl68ZPUpYWP50A", "stars": 5.0, "useful": 2, "funny": 2, "cool": 0, "text": "This was recommended by every Korean we met during visit and yes I know difference :)\n\nOnly negative is its far from strip but that turned into positive based on their pricing and below. \n\nFirst off , if you have ever Been to eat at a Korean spot, service is either 5 stars or 1...I'm half Korean and I can say that.\n\nThis place was top 3 best service I have received . The young gentleman filed up barley tea and water at half point or higher all the the and was attentive.\n\nKimchi jigae was good, yukejang was best. The original bulgogi we ordered was delicious...the second tasted different and they took it off. I also got the dolsot bibimbap which was delicious .\n\nNext time in Vegas, make the trip . They also seemed to turn into a night spot to drink and eat like in Korea which seemed fun.,,maybe I will be back and meet my future ex wife!? \n\n-cheers", "date": "2015-02-10 11:00:12"}, {"review_id": "NZCLH7cXelj28gL9ZNcHsg", "user_id": "M7xWJ6bmFHlCQ3VhvbfdPg", "business_id": "YuiM5VKscO8rS1EX7f19_g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "I broght my gf to fleur de lys at the end of last month.  I had the Chef's tasting menu... and it was superb.  First we started off with amuse bouche compliments of the chef of tempurad halibut with a potato salad.  Then we had a onion soup that was out of this world.  It was creamy and savory.  Next, course was a veal with a potato ravioli with a veal sauce... reccomendation is to use the sauce for bread.  Then, we had a olive oil poached hamachi with shitake mushrooms.  The final coarse we had a guiness braised beef short rib.  THis was probably the most inovative dish i had that night which used a guiness foam..\n\nThe service was laid back and on point. I never had to ask for anything and someone was always there to keep my table maintained.  The greatest part of the night was when we got to meet Hubert Keller, the celeberity chef... and we were so lucky because he just happened to be there and hes usually not there all the time.  He handed us an autographed menu of all of the courses we had of the night with a rose.  :). \n\nI reccomend this place, especially now, because locals are able to get pretty good deals if you mention you are from Vegas.  Just mention your a local and the server should able to hook yo up.\n\nOveral a very very good place.", "date": "2009-04-12 23:07:13"}, {"review_id": "GVNuY9QziuPGV7bJQfU43Q", "user_id": "1vLIyp-SvOg4w_ToH8XSUg", "business_id": "5EJdDudgYO2apB3Kl_TMWQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Clean, fast and helpful service, best pizza around. Enjoy I do. I eat there at lunch, but my kids want me to bring some home.\n\nThe owner waited on me and went above the level of service, you can tell he enjoys his job.", "date": "2016-01-22 21:34:13"}, {"review_id": "c2rk8r1ThXhtoeCCM-6ReQ", "user_id": "R72pDI35uURsOT1Ziqg4Gw", "business_id": "4vDffQ7eSQ7n39cyroOSKQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "Great place! The desserts were fantastic - I had the bread pudding and my hubby had the 180 pineapple cake. We're not often in this area, but this place deserves a special trip!", "date": "2015-09-20 00:21:25"}, {"review_id": "s2kk7HD0pWJFg_c0-dLArg", "user_id": "7KVv0M4EhFMyCBN_kyDdqg", "business_id": "KXfhB9wkyycKBi3BZ7On5A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Can't say enough good things! Delicious cappuccino made how I like, friendly owner and staff who take a lot of pride in their product. Everything local like it should be! Will certainly visit again when I'm in the area", "date": "2013-04-20 19:11:29"}, {"review_id": "8rRJ0eKCWHDKAm7h9KZF3A", "user_id": "vQTUB5eo6I-fvi_1-IqgIg", "business_id": "s0vNtuLs1cwEqHTXKiS05w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best breakfast joint in town , fresh food and the service is fast. Highly recommended.", "date": "2016-09-23 18:39:53"}, {"review_id": "9ucf0ZZpqhtH18Hqhsq0hw", "user_id": "zhT5MLTV4lyekxSQbqbT-w", "business_id": "cemMv5hvZZPj-_1V4xT9rQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely top notch. We truly enjoyed our food...scallop ceviche and the fish specials, trout with a seaweed sauce topped with cherry tomatoes and sea urchins and halibut with a to die for sauce. Our server, Gregory, made the experience even better! Highly recommend Le Filet for visitors and residents alike!", "date": "2017-10-18 00:32:30"}, {"review_id": "qeBjI0fUQz4I_q6CgwFo0w", "user_id": "1x-323wzmntjFhsd5OQ0og", "business_id": "2NjHpPRNLdLLEYbu7T-lLQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was so fortunate to have the opportunity to see this show, which was actually almost like going over to Wayne's house and chatting about his life and career.  He is a very warm and caring human being. My experience was in a group arranged by Wyndham Grand Desert and included dinner at Morton's. Wayne showed up toward the end of our meal and met each one of us before the show. After the show, he chatted with us and let us have the photographer take as many photos as we wanted. If you only see the show, you will enjoy his candor and warmth. However, if you can include the meet and greet, absolutely do it!!  Wayne can still sing, not the powerful amazing voice he had when younger but you can catch that on a cd!  No cd can match getting to know the legend that is Mr Las Vegas!", "date": "2018-07-31 03:57:02"}, {"review_id": "fpcDUG4Bf_6vNtw2qYTAuQ", "user_id": "eyUbG7Ogq_7VCD0oRwM5DA", "business_id": "JrXxQKt-TuHG1-ZjZifa1A", "stars": 5.0, "useful": 0, "funny": 3, "cool": 0, "text": "Best Car company ever  Easy when you arrive... go directly to the Emerald Isle and jump in and go.  Great cars, super nice staff!  \n\nThe only thing that could make it perfect would be a pack of tissue in the car.  Then they would truly be thinking of everything!", "date": "2015-03-23 14:58:53"}, {"review_id": "9F2W1fno_dNff8Du_kj8cQ", "user_id": "kiTLOjAV_zJDgdtt0UueJQ", "business_id": "ahyNR2Sfgrrbyds1nWq6cg", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "This morning I woke up in a panic. It's my mother in law's birthday and both my husband and I had completely forgotten. We're still newlyweds and this is a disaster. \n\nI called Blooming Expressions around 10 AM with a very vague: \"I need an arrangement delivered some time today. Fall-ish colors and I don't care what kind of flowers. Make it beautiful and here's your budget.\" \n\nNot 4 hours later I get a text from my mother-in-law:\n\n\"Hiiii! Look at the beautiful flowers that came to my door today. What a surprise! The bouquet is lovely!!! Thank you both so much. I enjoyed your nice card too. You're so special.\" \nThe text included two smiley faces and a kiss-y face.\n\nCrisis averted. \n\nThank you Blooming Expressions for making me look thoughtful and well prepared. You may have just saved my marriage ;)", "date": "2015-10-13 23:08:05"}, {"review_id": "HqpEqva5z5LYw-1mzaraKw", "user_id": "EmGbV1jbeKUCUm4UX6J3rg", "business_id": "KqhvtfJITeZDVubTnMVAlg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Kenny was very efficient and dialed my car in tight. I will refer anyone who asks where to go for their tinting needs..... Thank you again. Fabulous job BOYS.", "date": "2016-07-30 22:01:04"}, {"review_id": "F2I8yUXnjNpGWWRZvZENWw", "user_id": "KwDFLhpjFvLNFrH4_yLE1g", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Nicer decor than bellagio--place mats, mood lighting, chandeliers, wood accents. Inventive menu and portioning, which you've probably read all about in the other reviews. Impressive salumi. Delicious bone marrow. Tender mussels cooked to order in flavored butter--oh SO tender. Crab legs that, fortunately, aren't still frozen (bellagio's often are). passion fruit macaroons. Gelati. \n\nLike bellagio, laughable sushi offerings. Oh well. I didn't come to Vegas to eat sushi. \n\nA quick note re lamb: of the highly-rated vegas buffets that come to mind immediately (bellagio, Wynn, studio b at m resort, and this), wicked spoon and bellagio are the only ones serving leg of lamb on weekdays; none serve rack of lamb except bellagio on weekends. rack of lamb is the only reason I make a trip to bellagio at all--wicked spoon is better in nearly every other culinary regard. \n\nAnd as aptly noted by others, cheapskates beware: they close after lunch and reopen at 5 pm for dinner. None of this piggybacking stuff allowed.", "date": "2012-05-13 08:18:33"}, {"review_id": "TyCS2m1thL1q5TPZJ6wvgg", "user_id": "2jZ_8EJGiKTDQZjNfWMbQA", "business_id": "STtrEGylaYOXoXQFLP5OAQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome! This little quaint place was right up our alley. Fresh cocktails and a delicious food!!", "date": "2015-06-03 00:16:07"}]